/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    storage: Storage,
    align: [Align; 0],
}

impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn new(storage: Storage) -> Self {
        Self {
            storage,
            align: [],
        }
    }

    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];

        let bit_index = index % 8;
        let mask = 1 << bit_index;

        byte & mask == mask
    }

    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];

        let bit_index = index % 8;
        let mask = 1 << bit_index;

        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }

    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < self.storage.as_ref().len());

 # [ repr ( C ) ] # [ derive ( Default ) ] pub struct __IncompleteArrayField < T > ( :: std :: marker :: PhantomData < T > ) ; impl < T > __IncompleteArrayField < T > { # [ inline ] pub fn new ( ) -> Self { __IncompleteArrayField ( :: std :: marker :: PhantomData ) } # [ inline ] pub unsafe fn as_ptr ( & self ) -> * const T { :: std :: mem :: transmute ( self ) } # [ inline ] pub unsafe fn as_mut_ptr ( & mut self ) -> * mut T { :: std :: mem :: transmute ( self ) } # [ inline ] pub unsafe fn as_slice ( & self , len : usize ) -> & [ T ] { :: std :: slice :: from_raw_parts ( self . as_ptr ( ) , len ) } # [ inline ] pub unsafe fn as_mut_slice ( & mut self , len : usize ) -> & mut [ T ] { :: std :: slice :: from_raw_parts_mut ( self . as_mut_ptr ( ) , len ) } } impl < T > :: std :: fmt :: Debug for __IncompleteArrayField < T > { fn fmt ( & self , fmt : & mut :: std :: fmt :: Formatter ) -> :: std :: fmt :: Result { fmt . write_str ( "__IncompleteArrayField" ) } } impl < T > :: std :: clone :: Clone for __IncompleteArrayField < T > { # [ inline ] fn clone ( & self ) -> Self { Self :: new ( ) } } impl < T > :: std :: marker :: Copy for __IncompleteArrayField < T > { } extern "C" { # [ link_name = "\u{1}_Z13__assert_fail" ] pub fn __assert_fail ( __assertion : * const :: std :: os :: raw :: c_char , __file : * const :: std :: os :: raw :: c_char , __line : :: std :: os :: raw :: c_uint , __function : * const :: std :: os :: raw :: c_char ) ; } extern "C" { # [ link_name = "\u{1}_Z20__assert_perror_fail" ] pub fn __assert_perror_fail ( __errnum : :: std :: os :: raw :: c_int , __file : * const :: std :: os :: raw :: c_char , __line : :: std :: os :: raw :: c_uint , __function : * const :: std :: os :: raw :: c_char ) ; } extern "C" { # [ link_name = "\u{1}_Z8__assert" ] pub fn __assert ( __assertion : * const :: std :: os :: raw :: c_char , __file : * const :: std :: os :: raw :: c_char , __line : :: std :: os :: raw :: c_int ) ; } pub type __u_char = :: std :: os :: raw :: c_uchar ; pub type __u_short = :: std :: os :: raw :: c_ushort ; pub type __u_int = :: std :: os :: raw :: c_uint ; pub type __u_long = :: std :: os :: raw :: c_ulong ; pub type __int8_t = :: std :: os :: raw :: c_schar ; pub type __uint8_t = :: std :: os :: raw :: c_uchar ; pub type __int16_t = :: std :: os :: raw :: c_short ; pub type __uint16_t = :: std :: os :: raw :: c_ushort ; pub type __int32_t = :: std :: os :: raw :: c_int ; pub type __uint32_t = :: std :: os :: raw :: c_uint ; pub type __int64_t = :: std :: os :: raw :: c_long ; pub type __uint64_t = :: std :: os :: raw :: c_ulong ; pub type __quad_t = :: std :: os :: raw :: c_long ; pub type __u_quad_t = :: std :: os :: raw :: c_ulong ; pub type __dev_t = :: std :: os :: raw :: c_ulong ; pub type __uid_t = :: std :: os :: raw :: c_uint ; pub type __gid_t = :: std :: os :: raw :: c_uint ; pub type __ino_t = :: std :: os :: raw :: c_ulong ; pub type __ino64_t = :: std :: os :: raw :: c_ulong ; pub type __mode_t = :: std :: os :: raw :: c_uint ; pub type __nlink_t = :: std :: os :: raw :: c_ulong ; pub type __off_t = :: std :: os :: raw :: c_long ; pub type __off64_t = :: std :: os :: raw :: c_long ; pub type __pid_t = :: std :: os :: raw :: c_int ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct __fsid_t { pub __val : [ :: std :: os :: raw :: c_int ; 2usize ] , } # [ test ] fn bindgen_test_layout___fsid_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __fsid_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( __fsid_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __fsid_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __fsid_t ) ) ) ; } pub type __clock_t = :: std :: os :: raw :: c_long ; pub type __rlim_t = :: std :: os :: raw :: c_ulong ; pub type __rlim64_t = :: std :: os :: raw :: c_ulong ; pub type __id_t = :: std :: os :: raw :: c_uint ; pub type __time_t = :: std :: os :: raw :: c_long ; pub type __useconds_t = :: std :: os :: raw :: c_uint ; pub type __suseconds_t = :: std :: os :: raw :: c_long ; pub type __daddr_t = :: std :: os :: raw :: c_int ; pub type __key_t = :: std :: os :: raw :: c_int ; pub type __clockid_t = :: std :: os :: raw :: c_int ; pub type __timer_t = * mut :: std :: os :: raw :: c_void ; pub type __blksize_t = :: std :: os :: raw :: c_long ; pub type __blkcnt_t = :: std :: os :: raw :: c_long ; pub type __blkcnt64_t = :: std :: os :: raw :: c_long ; pub type __fsblkcnt_t = :: std :: os :: raw :: c_ulong ; pub type __fsblkcnt64_t = :: std :: os :: raw :: c_ulong ; pub type __fsfilcnt_t = :: std :: os :: raw :: c_ulong ; pub type __fsfilcnt64_t = :: std :: os :: raw :: c_ulong ; pub type __fsword_t = :: std :: os :: raw :: c_long ; pub type __ssize_t = :: std :: os :: raw :: c_long ; pub type __syscall_slong_t = :: std :: os :: raw :: c_long ; pub type __syscall_ulong_t = :: std :: os :: raw :: c_ulong ; pub type __loff_t = __off64_t ; pub type __qaddr_t = * mut __quad_t ; pub type __caddr_t = * mut :: std :: os :: raw :: c_char ; pub type __intptr_t = :: std :: os :: raw :: c_long ; pub type __socklen_t = :: std :: os :: raw :: c_uint ; pub const _ISupper : _bindgen_ty_1 = 256 ; pub const _ISlower : _bindgen_ty_1 = 512 ; pub const _ISalpha : _bindgen_ty_1 = 1024 ; pub const _ISdigit : _bindgen_ty_1 = 2048 ; pub const _ISxdigit : _bindgen_ty_1 = 4096 ; pub const _ISspace : _bindgen_ty_1 = 8192 ; pub const _ISprint : _bindgen_ty_1 = 16384 ; pub const _ISgraph : _bindgen_ty_1 = 32768 ; pub const _ISblank : _bindgen_ty_1 = 1 ; pub const _IScntrl : _bindgen_ty_1 = 2 ; pub const _ISpunct : _bindgen_ty_1 = 4 ; pub const _ISalnum : _bindgen_ty_1 = 8 ; pub type _bindgen_ty_1 = u32 ; extern "C" { # [ link_name = "\u{1}_Z13__ctype_b_loc" ] pub fn __ctype_b_loc ( ) -> * mut * const :: std :: os :: raw :: c_ushort ; } extern "C" { # [ link_name = "\u{1}_Z19__ctype_tolower_loc" ] pub fn __ctype_tolower_loc ( ) -> * mut * const __int32_t ; } extern "C" { # [ link_name = "\u{1}_Z19__ctype_toupper_loc" ] pub fn __ctype_toupper_loc ( ) -> * mut * const __int32_t ; } extern "C" { # [ link_name = "\u{1}_Z7isalnum" ] pub fn isalnum ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7isalpha" ] pub fn isalpha ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7iscntrl" ] pub fn iscntrl ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7isdigit" ] pub fn isdigit ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7islower" ] pub fn islower ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7isgraph" ] pub fn isgraph ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7isprint" ] pub fn isprint ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7ispunct" ] pub fn ispunct ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7isspace" ] pub fn isspace ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7isupper" ] pub fn isupper ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8isxdigit" ] pub fn isxdigit ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7tolower" ] pub fn tolower ( __c : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7toupper" ] pub fn toupper ( __c : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7isblank" ] pub fn isblank ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7isascii" ] pub fn isascii ( __c : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7toascii" ] pub fn toascii ( __c : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8_toupper" ] pub fn _toupper ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8_tolower" ] pub fn _tolower ( arg1 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __locale_struct { pub __locales : [ * mut __locale_data ; 13usize ] , pub __ctype_b : * const :: std :: os :: raw :: c_ushort , pub __ctype_tolower : * const :: std :: os :: raw :: c_int , pub __ctype_toupper : * const :: std :: os :: raw :: c_int , pub __names : [ * const :: std :: os :: raw :: c_char ; 13usize ] , } # [ test ] fn bindgen_test_layout___locale_struct ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __locale_struct > ( ) , 232usize , concat ! ( "Size of: " , stringify ! ( __locale_struct ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __locale_struct > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __locale_struct ) ) ) ; } impl Default for __locale_struct { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub type __locale_t = * mut __locale_struct ; pub type locale_t = __locale_t ; extern "C" { # [ link_name = "\u{1}_Z9isalnum_l" ] pub fn isalnum_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9isalpha_l" ] pub fn isalpha_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9iscntrl_l" ] pub fn iscntrl_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9isdigit_l" ] pub fn isdigit_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9islower_l" ] pub fn islower_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9isgraph_l" ] pub fn isgraph_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9isprint_l" ] pub fn isprint_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9ispunct_l" ] pub fn ispunct_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9isspace_l" ] pub fn isspace_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9isupper_l" ] pub fn isupper_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10isxdigit_l" ] pub fn isxdigit_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9isblank_l" ] pub fn isblank_l ( arg1 : :: std :: os :: raw :: c_int , arg2 : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11__tolower_l" ] pub fn __tolower_l ( __c : :: std :: os :: raw :: c_int , __l : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9tolower_l" ] pub fn tolower_l ( __c : :: std :: os :: raw :: c_int , __l : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11__toupper_l" ] pub fn __toupper_l ( __c : :: std :: os :: raw :: c_int , __l : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9toupper_l" ] pub fn toupper_l ( __c : :: std :: os :: raw :: c_int , __l : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z16__errno_location" ] pub fn __errno_location ( ) -> * mut :: std :: os :: raw :: c_int ; } pub type int_least8_t = :: std :: os :: raw :: c_schar ; pub type int_least16_t = :: std :: os :: raw :: c_short ; pub type int_least32_t = :: std :: os :: raw :: c_int ; pub type int_least64_t = :: std :: os :: raw :: c_long ; pub type uint_least8_t = :: std :: os :: raw :: c_uchar ; pub type uint_least16_t = :: std :: os :: raw :: c_ushort ; pub type uint_least32_t = :: std :: os :: raw :: c_uint ; pub type uint_least64_t = :: std :: os :: raw :: c_ulong ; pub type int_fast8_t = :: std :: os :: raw :: c_schar ; pub type int_fast16_t = :: std :: os :: raw :: c_long ; pub type int_fast32_t = :: std :: os :: raw :: c_long ; pub type int_fast64_t = :: std :: os :: raw :: c_long ; pub type uint_fast8_t = :: std :: os :: raw :: c_uchar ; pub type uint_fast16_t = :: std :: os :: raw :: c_ulong ; pub type uint_fast32_t = :: std :: os :: raw :: c_ulong ; pub type uint_fast64_t = :: std :: os :: raw :: c_ulong ; pub type intmax_t = :: std :: os :: raw :: c_long ; pub type uintmax_t = :: std :: os :: raw :: c_ulong ; pub type __gwchar_t = :: std :: os :: raw :: c_int ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct imaxdiv_t { pub quot : :: std :: os :: raw :: c_long , pub rem : :: std :: os :: raw :: c_long , } # [ test ] fn bindgen_test_layout_imaxdiv_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < imaxdiv_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( imaxdiv_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < imaxdiv_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( imaxdiv_t ) ) ) ; } extern "C" { # [ link_name = "\u{1}_Z7imaxabs" ] pub fn imaxabs ( __n : intmax_t ) -> intmax_t ; } extern "C" { # [ link_name = "\u{1}_Z7imaxdiv" ] pub fn imaxdiv ( __numer : intmax_t , __denom : intmax_t ) -> imaxdiv_t ; } extern "C" { # [ link_name = "\u{1}_Z9strtoimax" ] pub fn strtoimax ( __nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int ) -> intmax_t ; } extern "C" { # [ link_name = "\u{1}_Z9strtoumax" ] pub fn strtoumax ( __nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int ) -> uintmax_t ; } extern "C" { # [ link_name = "\u{1}_Z9wcstoimax" ] pub fn wcstoimax ( __nptr : * const __gwchar_t , __endptr : * mut * mut __gwchar_t , __base : :: std :: os :: raw :: c_int ) -> intmax_t ; } extern "C" { # [ link_name = "\u{1}_Z9wcstoumax" ] pub fn wcstoumax ( __nptr : * const __gwchar_t , __endptr : * mut * mut __gwchar_t , __base : :: std :: os :: raw :: c_int ) -> uintmax_t ; } pub type va_list = __builtin_va_list ; pub type __gnuc_va_list = __builtin_va_list ; pub type wchar_t = :: std :: os :: raw :: c_int ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct max_align_t { pub __clang_max_align_nonce1 : :: std :: os :: raw :: c_longlong , pub __bindgen_padding_0 : u64 , pub __clang_max_align_nonce2 : f64 , } # [ test ] fn bindgen_test_layout_max_align_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < max_align_t > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( max_align_t ) ) ) ; } pub type FILE = _IO_FILE ; pub type __FILE = _IO_FILE ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct __mbstate_t { pub __count : :: std :: os :: raw :: c_int , pub __value : __mbstate_t__bindgen_ty_1 , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union __mbstate_t__bindgen_ty_1 { pub __wch : :: std :: os :: raw :: c_uint , pub __wchb : [ :: std :: os :: raw :: c_char ; 4usize ] , _bindgen_union_align : u32 , } # [ test ] fn bindgen_test_layout___mbstate_t__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __mbstate_t__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __mbstate_t__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __mbstate_t__bindgen_ty_1 ) ) ) ; } impl Default for __mbstate_t__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout___mbstate_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __mbstate_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( __mbstate_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __mbstate_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __mbstate_t ) ) ) ; } impl Default for __mbstate_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct _G_fpos_t { pub __pos : __off_t , pub __state : __mbstate_t , } # [ test ] fn bindgen_test_layout__G_fpos_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _G_fpos_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( _G_fpos_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _G_fpos_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _G_fpos_t ) ) ) ; } impl Default for _G_fpos_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct _G_fpos64_t { pub __pos : __off64_t , pub __state : __mbstate_t , } # [ test ] fn bindgen_test_layout__G_fpos64_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _G_fpos64_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( _G_fpos64_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _G_fpos64_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _G_fpos64_t ) ) ) ; } impl Default for _G_fpos64_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _IO_jump_t { _unused : [ u8 ; 0 ] , } pub type _IO_lock_t = :: std :: os :: raw :: c_void ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _IO_marker { pub _next : * mut _IO_marker , pub _sbuf : * mut _IO_FILE , pub _pos : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout__IO_marker ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _IO_marker > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( _IO_marker ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _IO_marker > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _IO_marker ) ) ) ; } impl Default for _IO_marker { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub const __codecvt_result___codecvt_ok : __codecvt_result = 0 ; pub const __codecvt_result___codecvt_partial : __codecvt_result = 1 ; pub const __codecvt_result___codecvt_error : __codecvt_result = 2 ; pub const __codecvt_result___codecvt_noconv : __codecvt_result = 3 ; pub type __codecvt_result = u32 ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _IO_FILE { pub _flags : :: std :: os :: raw :: c_int , pub _IO_read_ptr : * mut :: std :: os :: raw :: c_char , pub _IO_read_end : * mut :: std :: os :: raw :: c_char , pub _IO_read_base : * mut :: std :: os :: raw :: c_char , pub _IO_write_base : * mut :: std :: os :: raw :: c_char , pub _IO_write_ptr : * mut :: std :: os :: raw :: c_char , pub _IO_write_end : * mut :: std :: os :: raw :: c_char , pub _IO_buf_base : * mut :: std :: os :: raw :: c_char , pub _IO_buf_end : * mut :: std :: os :: raw :: c_char , pub _IO_save_base : * mut :: std :: os :: raw :: c_char , pub _IO_backup_base : * mut :: std :: os :: raw :: c_char , pub _IO_save_end : * mut :: std :: os :: raw :: c_char , pub _markers : * mut _IO_marker , pub _chain : * mut _IO_FILE , pub _fileno : :: std :: os :: raw :: c_int , pub _flags2 : :: std :: os :: raw :: c_int , pub _old_offset : __off_t , pub _cur_column : :: std :: os :: raw :: c_ushort , pub _vtable_offset : :: std :: os :: raw :: c_schar , pub _shortbuf : [ :: std :: os :: raw :: c_char ; 1usize ] , pub _lock : * mut _IO_lock_t , pub _offset : __off64_t , pub __pad1 : * mut :: std :: os :: raw :: c_void , pub __pad2 : * mut :: std :: os :: raw :: c_void , pub __pad3 : * mut :: std :: os :: raw :: c_void , pub __pad4 : * mut :: std :: os :: raw :: c_void , pub __pad5 : usize , pub _mode : :: std :: os :: raw :: c_int , pub _unused2 : [ :: std :: os :: raw :: c_char ; 20usize ] , } # [ test ] fn bindgen_test_layout__IO_FILE ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _IO_FILE > ( ) , 216usize , concat ! ( "Size of: " , stringify ! ( _IO_FILE ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _IO_FILE > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _IO_FILE ) ) ) ; } impl Default for _IO_FILE { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _IO_FILE_plus { _unused : [ u8 ; 0 ] , } pub type __io_read_fn = :: std :: option :: Option < unsafe extern "C" fn ( __cookie : * mut :: std :: os :: raw :: c_void , __buf : * mut :: std :: os :: raw :: c_char , __nbytes : usize ) -> __ssize_t > ; pub type __io_write_fn = :: std :: option :: Option < unsafe extern "C" fn ( __cookie : * mut :: std :: os :: raw :: c_void , __buf : * const :: std :: os :: raw :: c_char , __n : usize ) -> __ssize_t > ; pub type __io_seek_fn = :: std :: option :: Option < unsafe extern "C" fn ( __cookie : * mut :: std :: os :: raw :: c_void , __pos : * mut __off64_t , __w : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int > ; pub type __io_close_fn = :: std :: option :: Option < unsafe extern "C" fn ( __cookie : * mut :: std :: os :: raw :: c_void ) -> :: std :: os :: raw :: c_int > ; extern "C" { # [ link_name = "\u{1}_Z11__underflow" ] pub fn __underflow ( arg1 : * mut _IO_FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7__uflow" ] pub fn __uflow ( arg1 : * mut _IO_FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10__overflow" ] pub fn __overflow ( arg1 : * mut _IO_FILE , arg2 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8_IO_getc" ] pub fn _IO_getc ( __fp : * mut _IO_FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8_IO_putc" ] pub fn _IO_putc ( __c : :: std :: os :: raw :: c_int , __fp : * mut _IO_FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8_IO_feof" ] pub fn _IO_feof ( __fp : * mut _IO_FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10_IO_ferror" ] pub fn _IO_ferror ( __fp : * mut _IO_FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z16_IO_peekc_locked" ] pub fn _IO_peekc_locked ( __fp : * mut _IO_FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13_IO_flockfile" ] pub fn _IO_flockfile ( arg1 : * mut _IO_FILE ) ; } extern "C" { # [ link_name = "\u{1}_Z15_IO_funlockfile" ] pub fn _IO_funlockfile ( arg1 : * mut _IO_FILE ) ; } extern "C" { # [ link_name = "\u{1}_Z16_IO_ftrylockfile" ] pub fn _IO_ftrylockfile ( arg1 : * mut _IO_FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11_IO_vfscanf" ] pub fn _IO_vfscanf ( arg1 : * mut _IO_FILE , arg2 : * const :: std :: os :: raw :: c_char , arg3 : * mut __va_list_tag , arg4 : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12_IO_vfprintf" ] pub fn _IO_vfprintf ( arg1 : * mut _IO_FILE , arg2 : * const :: std :: os :: raw :: c_char , arg3 : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8_IO_padn" ] pub fn _IO_padn ( arg1 : * mut _IO_FILE , arg2 : :: std :: os :: raw :: c_int , arg3 : __ssize_t ) -> __ssize_t ; } extern "C" { # [ link_name = "\u{1}_Z9_IO_sgetn" ] pub fn _IO_sgetn ( arg1 : * mut _IO_FILE , arg2 : * mut :: std :: os :: raw :: c_void , arg3 : usize ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z11_IO_seekoff" ] pub fn _IO_seekoff ( arg1 : * mut _IO_FILE , arg2 : __off64_t , arg3 : :: std :: os :: raw :: c_int , arg4 : :: std :: os :: raw :: c_int ) -> __off64_t ; } extern "C" { # [ link_name = "\u{1}_Z11_IO_seekpos" ] pub fn _IO_seekpos ( arg1 : * mut _IO_FILE , arg2 : __off64_t , arg3 : :: std :: os :: raw :: c_int ) -> __off64_t ; } extern "C" { # [ link_name = "\u{1}_Z20_IO_free_backup_area" ] pub fn _IO_free_backup_area ( arg1 : * mut _IO_FILE ) ; } pub type off_t = __off_t ; pub type fpos_t = _G_fpos_t ; extern "C" { # [ link_name = "\u{1}_Z6remove" ] pub fn remove ( __filename : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6rename" ] pub fn rename ( __old : * const :: std :: os :: raw :: c_char , __new : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8renameat" ] pub fn renameat ( __oldfd : :: std :: os :: raw :: c_int , __old : * const :: std :: os :: raw :: c_char , __newfd : :: std :: os :: raw :: c_int , __new : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7tmpfile" ] pub fn tmpfile ( ) -> * mut FILE ; } extern "C" { # [ link_name = "\u{1}_Z6tmpnam" ] pub fn tmpnam ( __s : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z8tmpnam_r" ] pub fn tmpnam_r ( __s : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z7tempnam" ] pub fn tempnam ( __dir : * const :: std :: os :: raw :: c_char , __pfx : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6fclose" ] pub fn fclose ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6fflush" ] pub fn fflush ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z15fflush_unlocked" ] pub fn fflush_unlocked ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5fopen" ] pub fn fopen ( __filename : * const :: std :: os :: raw :: c_char , __modes : * const :: std :: os :: raw :: c_char ) -> * mut FILE ; } extern "C" { # [ link_name = "\u{1}_Z7freopen" ] pub fn freopen ( __filename : * const :: std :: os :: raw :: c_char , __modes : * const :: std :: os :: raw :: c_char , __stream : * mut FILE ) -> * mut FILE ; } extern "C" { # [ link_name = "\u{1}_Z6fdopen" ] pub fn fdopen ( __fd : :: std :: os :: raw :: c_int , __modes : * const :: std :: os :: raw :: c_char ) -> * mut FILE ; } extern "C" { # [ link_name = "\u{1}_Z8fmemopen" ] pub fn fmemopen ( __s : * mut :: std :: os :: raw :: c_void , __len : usize , __modes : * const :: std :: os :: raw :: c_char ) -> * mut FILE ; } extern "C" { # [ link_name = "\u{1}_Z14open_memstream" ] pub fn open_memstream ( __bufloc : * mut * mut :: std :: os :: raw :: c_char , __sizeloc : * mut usize ) -> * mut FILE ; } extern "C" { # [ link_name = "\u{1}_Z6setbuf" ] pub fn setbuf ( __stream : * mut FILE , __buf : * mut :: std :: os :: raw :: c_char ) ; } extern "C" { # [ link_name = "\u{1}_Z7setvbuf" ] pub fn setvbuf ( __stream : * mut FILE , __buf : * mut :: std :: os :: raw :: c_char , __modes : :: std :: os :: raw :: c_int , __n : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9setbuffer" ] pub fn setbuffer ( __stream : * mut FILE , __buf : * mut :: std :: os :: raw :: c_char , __size : usize ) ; } extern "C" { # [ link_name = "\u{1}_Z10setlinebuf" ] pub fn setlinebuf ( __stream : * mut FILE ) ; } extern "C" { # [ link_name = "\u{1}_Z7fprintf" ] pub fn fprintf ( __stream : * mut FILE , __format : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6printf" ] pub fn printf ( __format : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7sprintf" ] pub fn sprintf ( __s : * mut :: std :: os :: raw :: c_char , __format : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8vfprintf" ] pub fn vfprintf ( __s : * mut FILE , __format : * const :: std :: os :: raw :: c_char , __arg : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7vprintf" ] pub fn vprintf ( __format : * const :: std :: os :: raw :: c_char , __arg : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8vsprintf" ] pub fn vsprintf ( __s : * mut :: std :: os :: raw :: c_char , __format : * const :: std :: os :: raw :: c_char , __arg : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8snprintf" ] pub fn snprintf ( __s : * mut :: std :: os :: raw :: c_char , __maxlen : usize , __format : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9vsnprintf" ] pub fn vsnprintf ( __s : * mut :: std :: os :: raw :: c_char , __maxlen : usize , __format : * const :: std :: os :: raw :: c_char , __arg : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8vdprintf" ] pub fn vdprintf ( __fd : :: std :: os :: raw :: c_int , __fmt : * const :: std :: os :: raw :: c_char , __arg : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7dprintf" ] pub fn dprintf ( __fd : :: std :: os :: raw :: c_int , __fmt : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6fscanf" ] pub fn fscanf ( __stream : * mut FILE , __format : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5scanf" ] pub fn scanf ( __format : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6sscanf" ] pub fn sscanf ( __s : * const :: std :: os :: raw :: c_char , __format : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}__isoc99_fscanf" ] pub fn fscanf1 ( __stream : * mut FILE , __format : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}__isoc99_scanf" ] pub fn scanf1 ( __format : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}__isoc99_sscanf" ] pub fn sscanf1 ( __s : * const :: std :: os :: raw :: c_char , __format : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7vfscanf" ] pub fn vfscanf ( __s : * mut FILE , __format : * const :: std :: os :: raw :: c_char , __arg : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6vscanf" ] pub fn vscanf ( __format : * const :: std :: os :: raw :: c_char , __arg : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7vsscanf" ] pub fn vsscanf ( __s : * const :: std :: os :: raw :: c_char , __format : * const :: std :: os :: raw :: c_char , __arg : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}__isoc99_vfscanf" ] pub fn vfscanf1 ( __s : * mut FILE , __format : * const :: std :: os :: raw :: c_char , __arg : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}__isoc99_vscanf" ] pub fn vscanf1 ( __format : * const :: std :: os :: raw :: c_char , __arg : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}__isoc99_vsscanf" ] pub fn vsscanf1 ( __s : * const :: std :: os :: raw :: c_char , __format : * const :: std :: os :: raw :: c_char , __arg : * mut __va_list_tag ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5fgetc" ] pub fn fgetc ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4getc" ] pub fn getc ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7getchar" ] pub fn getchar ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13getc_unlocked" ] pub fn getc_unlocked ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z16getchar_unlocked" ] pub fn getchar_unlocked ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z14fgetc_unlocked" ] pub fn fgetc_unlocked ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5fputc" ] pub fn fputc ( __c : :: std :: os :: raw :: c_int , __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4putc" ] pub fn putc ( __c : :: std :: os :: raw :: c_int , __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7putchar" ] pub fn putchar ( __c : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z14fputc_unlocked" ] pub fn fputc_unlocked ( __c : :: std :: os :: raw :: c_int , __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13putc_unlocked" ] pub fn putc_unlocked ( __c : :: std :: os :: raw :: c_int , __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z16putchar_unlocked" ] pub fn putchar_unlocked ( __c : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4getw" ] pub fn getw ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4putw" ] pub fn putw ( __w : :: std :: os :: raw :: c_int , __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5fgets" ] pub fn fgets ( __s : * mut :: std :: os :: raw :: c_char , __n : :: std :: os :: raw :: c_int , __stream : * mut FILE ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z10__getdelim" ] pub fn __getdelim ( __lineptr : * mut * mut :: std :: os :: raw :: c_char , __n : * mut usize , __delimiter : :: std :: os :: raw :: c_int , __stream : * mut FILE ) -> __ssize_t ; } extern "C" { # [ link_name = "\u{1}_Z8getdelim" ] pub fn getdelim ( __lineptr : * mut * mut :: std :: os :: raw :: c_char , __n : * mut usize , __delimiter : :: std :: os :: raw :: c_int , __stream : * mut FILE ) -> __ssize_t ; } extern "C" { # [ link_name = "\u{1}_Z7getline" ] pub fn getline ( __lineptr : * mut * mut :: std :: os :: raw :: c_char , __n : * mut usize , __stream : * mut FILE ) -> __ssize_t ; } extern "C" { # [ link_name = "\u{1}_Z5fputs" ] pub fn fputs ( __s : * const :: std :: os :: raw :: c_char , __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4puts" ] pub fn puts ( __s : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6ungetc" ] pub fn ungetc ( __c : :: std :: os :: raw :: c_int , __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5fread" ] pub fn fread ( __ptr : * mut :: std :: os :: raw :: c_void , __size : usize , __n : usize , __stream : * mut FILE ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z6fwrite" ] pub fn fwrite ( __ptr : * const :: std :: os :: raw :: c_void , __size : usize , __n : usize , __s : * mut FILE ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z14fread_unlocked" ] pub fn fread_unlocked ( __ptr : * mut :: std :: os :: raw :: c_void , __size : usize , __n : usize , __stream : * mut FILE ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z15fwrite_unlocked" ] pub fn fwrite_unlocked ( __ptr : * const :: std :: os :: raw :: c_void , __size : usize , __n : usize , __stream : * mut FILE ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z5fseek" ] pub fn fseek ( __stream : * mut FILE , __off : :: std :: os :: raw :: c_long , __whence : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5ftell" ] pub fn ftell ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z6rewind" ] pub fn rewind ( __stream : * mut FILE ) ; } extern "C" { # [ link_name = "\u{1}_Z6fseeko" ] pub fn fseeko ( __stream : * mut FILE , __off : __off_t , __whence : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6ftello" ] pub fn ftello ( __stream : * mut FILE ) -> __off_t ; } extern "C" { # [ link_name = "\u{1}_Z7fgetpos" ] pub fn fgetpos ( __stream : * mut FILE , __pos : * mut fpos_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7fsetpos" ] pub fn fsetpos ( __stream : * mut FILE , __pos : * const fpos_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8clearerr" ] pub fn clearerr ( __stream : * mut FILE ) ; } extern "C" { # [ link_name = "\u{1}_Z4feof" ] pub fn feof ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6ferror" ] pub fn ferror ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z17clearerr_unlocked" ] pub fn clearerr_unlocked ( __stream : * mut FILE ) ; } extern "C" { # [ link_name = "\u{1}_Z13feof_unlocked" ] pub fn feof_unlocked ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z15ferror_unlocked" ] pub fn ferror_unlocked ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6perror" ] pub fn perror ( __s : * const :: std :: os :: raw :: c_char ) ; } extern "C" { # [ link_name = "\u{1}_Z6fileno" ] pub fn fileno ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z15fileno_unlocked" ] pub fn fileno_unlocked ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5popen" ] pub fn popen ( __command : * const :: std :: os :: raw :: c_char , __modes : * const :: std :: os :: raw :: c_char ) -> * mut FILE ; } extern "C" { # [ link_name = "\u{1}_Z6pclose" ] pub fn pclose ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7ctermid" ] pub fn ctermid ( __s : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z9flockfile" ] pub fn flockfile ( __stream : * mut FILE ) ; } extern "C" { # [ link_name = "\u{1}_Z12ftrylockfile" ] pub fn ftrylockfile ( __stream : * mut FILE ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11funlockfile" ] pub fn funlockfile ( __stream : * mut FILE ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union wait { pub w_status : :: std :: os :: raw :: c_int , pub __wait_terminated : wait__bindgen_ty_1 , pub __wait_stopped : wait__bindgen_ty_2 , _bindgen_union_align : u32 , } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct wait__bindgen_ty_1 { pub _bitfield_1 : __BindgenBitfieldUnit < [ u8 ; 4usize ] , u8 > , pub __bindgen_align : [ u32 ; 0usize ] , } # [ test ] fn bindgen_test_layout_wait__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < wait__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( wait__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < wait__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( wait__bindgen_ty_1 ) ) ) ; } impl wait__bindgen_ty_1 { # [ inline ] pub fn __w_termsig ( & self ) -> :: std :: os :: raw :: c_uint { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 0usize , 7u8 ) as u32 ) } } # [ inline ] pub fn set___w_termsig ( & mut self , val : :: std :: os :: raw :: c_uint ) { unsafe { let val : u32 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 0usize , 7u8 , val as u64 ) } } # [ inline ] pub fn __w_coredump ( & self ) -> :: std :: os :: raw :: c_uint { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 7usize , 1u8 ) as u32 ) } } # [ inline ] pub fn set___w_coredump ( & mut self , val : :: std :: os :: raw :: c_uint ) { unsafe { let val : u32 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 7usize , 1u8 , val as u64 ) } } # [ inline ] pub fn __w_retcode ( & self ) -> :: std :: os :: raw :: c_uint { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 8usize , 8u8 ) as u32 ) } } # [ inline ] pub fn set___w_retcode ( & mut self , val : :: std :: os :: raw :: c_uint ) { unsafe { let val : u32 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 8usize , 8u8 , val as u64 ) } } # [ inline ] pub fn new_bitfield_1 ( __w_termsig : :: std :: os :: raw :: c_uint , __w_coredump : :: std :: os :: raw :: c_uint , __w_retcode : :: std :: os :: raw :: c_uint ) -> __BindgenBitfieldUnit < [ u8 ; 4usize ] , u8 > { let mut __bindgen_bitfield_unit : __BindgenBitfieldUnit < [ u8 ; 4usize ] , u8 > = Default :: default ( ) ; __bindgen_bitfield_unit . set ( 0usize , 7u8 , { let __w_termsig : u32 = unsafe { :: std :: mem :: transmute ( __w_termsig ) } ; __w_termsig as u64 } ) ; __bindgen_bitfield_unit . set ( 7usize , 1u8 , { let __w_coredump : u32 = unsafe { :: std :: mem :: transmute ( __w_coredump ) } ; __w_coredump as u64 } ) ; __bindgen_bitfield_unit . set ( 8usize , 8u8 , { let __w_retcode : u32 = unsafe { :: std :: mem :: transmute ( __w_retcode ) } ; __w_retcode as u64 } ) ; __bindgen_bitfield_unit } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct wait__bindgen_ty_2 { pub _bitfield_1 : __BindgenBitfieldUnit < [ u8 ; 4usize ] , u8 > , pub __bindgen_align : [ u32 ; 0usize ] , } # [ test ] fn bindgen_test_layout_wait__bindgen_ty_2 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < wait__bindgen_ty_2 > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( wait__bindgen_ty_2 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < wait__bindgen_ty_2 > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( wait__bindgen_ty_2 ) ) ) ; } impl wait__bindgen_ty_2 { # [ inline ] pub fn __w_stopval ( & self ) -> :: std :: os :: raw :: c_uint { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 0usize , 8u8 ) as u32 ) } } # [ inline ] pub fn set___w_stopval ( & mut self , val : :: std :: os :: raw :: c_uint ) { unsafe { let val : u32 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 0usize , 8u8 , val as u64 ) } } # [ inline ] pub fn __w_stopsig ( & self ) -> :: std :: os :: raw :: c_uint { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 8usize , 8u8 ) as u32 ) } } # [ inline ] pub fn set___w_stopsig ( & mut self , val : :: std :: os :: raw :: c_uint ) { unsafe { let val : u32 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 8usize , 8u8 , val as u64 ) } } # [ inline ] pub fn new_bitfield_1 ( __w_stopval : :: std :: os :: raw :: c_uint , __w_stopsig : :: std :: os :: raw :: c_uint ) -> __BindgenBitfieldUnit < [ u8 ; 4usize ] , u8 > { let mut __bindgen_bitfield_unit : __BindgenBitfieldUnit < [ u8 ; 4usize ] , u8 > = Default :: default ( ) ; __bindgen_bitfield_unit . set ( 0usize , 8u8 , { let __w_stopval : u32 = unsafe { :: std :: mem :: transmute ( __w_stopval ) } ; __w_stopval as u64 } ) ; __bindgen_bitfield_unit . set ( 8usize , 8u8 , { let __w_stopsig : u32 = unsafe { :: std :: mem :: transmute ( __w_stopsig ) } ; __w_stopsig as u64 } ) ; __bindgen_bitfield_unit } } # [ test ] fn bindgen_test_layout_wait ( ) { assert_eq ! ( :: std :: mem :: size_of :: < wait > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( wait ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < wait > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( wait ) ) ) ; } impl Default for wait { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union __WAIT_STATUS { pub __uptr : * mut wait , pub __iptr : * mut :: std :: os :: raw :: c_int , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout___WAIT_STATUS ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __WAIT_STATUS > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( __WAIT_STATUS ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __WAIT_STATUS > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __WAIT_STATUS ) ) ) ; } impl Default for __WAIT_STATUS { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct div_t { pub quot : :: std :: os :: raw :: c_int , pub rem : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout_div_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < div_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( div_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < div_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( div_t ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct ldiv_t { pub quot : :: std :: os :: raw :: c_long , pub rem : :: std :: os :: raw :: c_long , } # [ test ] fn bindgen_test_layout_ldiv_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ldiv_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( ldiv_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ldiv_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ldiv_t ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct lldiv_t { pub quot : :: std :: os :: raw :: c_longlong , pub rem : :: std :: os :: raw :: c_longlong , } # [ test ] fn bindgen_test_layout_lldiv_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < lldiv_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( lldiv_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < lldiv_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( lldiv_t ) ) ) ; } extern "C" { # [ link_name = "\u{1}_Z22__ctype_get_mb_cur_max" ] pub fn __ctype_get_mb_cur_max ( ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z4atof" ] pub fn atof ( __nptr : * const :: std :: os :: raw :: c_char ) -> f64 ; } extern "C" { # [ link_name = "\u{1}_Z4atoi" ] pub fn atoi ( __nptr : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4atol" ] pub fn atol ( __nptr : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z5atoll" ] pub fn atoll ( __nptr : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_longlong ; } extern "C" { # [ link_name = "\u{1}_Z6strtod" ] pub fn strtod ( __nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char ) -> f64 ; } extern "C" { # [ link_name = "\u{1}_Z6strtof" ] pub fn strtof ( __nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char ) -> f32 ; } extern "C" { # [ link_name = "\u{1}_Z7strtold" ] pub fn strtold ( __nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char ) -> f64 ; } extern "C" { # [ link_name = "\u{1}_Z6strtol" ] pub fn strtol ( __nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z7strtoul" ] pub fn strtoul ( __nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_ulong ; } extern "C" { # [ link_name = "\u{1}_Z6strtoq" ] pub fn strtoq ( __nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_longlong ; } extern "C" { # [ link_name = "\u{1}_Z7strtouq" ] pub fn strtouq ( __nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_ulonglong ; } extern "C" { # [ link_name = "\u{1}_Z7strtoll" ] pub fn strtoll ( __nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_longlong ; } extern "C" { # [ link_name = "\u{1}_Z8strtoull" ] pub fn strtoull ( __nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_ulonglong ; } extern "C" { # [ link_name = "\u{1}_Z4l64a" ] pub fn l64a ( __n : :: std :: os :: raw :: c_long ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z4a64l" ] pub fn a64l ( __s : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_long ; } pub type u_char = __u_char ; pub type u_short = __u_short ; pub type u_int = __u_int ; pub type u_long = __u_long ; pub type quad_t = __quad_t ; pub type u_quad_t = __u_quad_t ; pub type fsid_t = __fsid_t ; pub type loff_t = __loff_t ; pub type ino_t = __ino_t ; pub type dev_t = __dev_t ; pub type gid_t = __gid_t ; pub type mode_t = __mode_t ; pub type nlink_t = __nlink_t ; pub type uid_t = __uid_t ; pub type pid_t = __pid_t ; pub type id_t = __id_t ; pub type daddr_t = __daddr_t ; pub type caddr_t = __caddr_t ; pub type key_t = __key_t ; pub type clock_t = __clock_t ; pub type time_t = __time_t ; pub type clockid_t = __clockid_t ; pub type timer_t = __timer_t ; pub type ulong = :: std :: os :: raw :: c_ulong ; pub type ushort = :: std :: os :: raw :: c_ushort ; pub type uint = :: std :: os :: raw :: c_uint ; pub type u_int8_t = :: std :: os :: raw :: c_uchar ; pub type u_int16_t = :: std :: os :: raw :: c_ushort ; pub type u_int32_t = :: std :: os :: raw :: c_uint ; pub type u_int64_t = :: std :: os :: raw :: c_ulong ; pub type register_t = :: std :: os :: raw :: c_long ; pub type __sig_atomic_t = :: std :: os :: raw :: c_int ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct __sigset_t { pub __val : [ :: std :: os :: raw :: c_ulong ; 16usize ] , } # [ test ] fn bindgen_test_layout___sigset_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __sigset_t > ( ) , 128usize , concat ! ( "Size of: " , stringify ! ( __sigset_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __sigset_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __sigset_t ) ) ) ; } pub type sigset_t = __sigset_t ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct timespec { pub tv_sec : __time_t , pub tv_nsec : __syscall_slong_t , } # [ test ] fn bindgen_test_layout_timespec ( ) { assert_eq ! ( :: std :: mem :: size_of :: < timespec > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( timespec ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < timespec > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( timespec ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct timeval { pub tv_sec : __time_t , pub tv_usec : __suseconds_t , } # [ test ] fn bindgen_test_layout_timeval ( ) { assert_eq ! ( :: std :: mem :: size_of :: < timeval > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( timeval ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < timeval > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( timeval ) ) ) ; } pub type suseconds_t = __suseconds_t ; pub type __fd_mask = :: std :: os :: raw :: c_long ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct fd_set { pub __fds_bits : [ __fd_mask ; 16usize ] , } # [ test ] fn bindgen_test_layout_fd_set ( ) { assert_eq ! ( :: std :: mem :: size_of :: < fd_set > ( ) , 128usize , concat ! ( "Size of: " , stringify ! ( fd_set ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < fd_set > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( fd_set ) ) ) ; } pub type fd_mask = __fd_mask ; extern "C" { # [ link_name = "\u{1}_Z6select" ] pub fn select ( __nfds : :: std :: os :: raw :: c_int , __readfds : * mut fd_set , __writefds : * mut fd_set , __exceptfds : * mut fd_set , __timeout : * mut timeval ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7pselect" ] pub fn pselect ( __nfds : :: std :: os :: raw :: c_int , __readfds : * mut fd_set , __writefds : * mut fd_set , __exceptfds : * mut fd_set , __timeout : * const timespec , __sigmask : * const __sigset_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13gnu_dev_major" ] pub fn gnu_dev_major ( __dev : :: std :: os :: raw :: c_ulonglong ) -> :: std :: os :: raw :: c_uint ; } extern "C" { # [ link_name = "\u{1}_Z13gnu_dev_minor" ] pub fn gnu_dev_minor ( __dev : :: std :: os :: raw :: c_ulonglong ) -> :: std :: os :: raw :: c_uint ; } extern "C" { # [ link_name = "\u{1}_Z15gnu_dev_makedev" ] pub fn gnu_dev_makedev ( __major : :: std :: os :: raw :: c_uint , __minor : :: std :: os :: raw :: c_uint ) -> :: std :: os :: raw :: c_ulonglong ; } pub type blksize_t = __blksize_t ; pub type blkcnt_t = __blkcnt_t ; pub type fsblkcnt_t = __fsblkcnt_t ; pub type fsfilcnt_t = __fsfilcnt_t ; pub type pthread_t = :: std :: os :: raw :: c_ulong ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_attr_t { pub __size : [ :: std :: os :: raw :: c_char ; 56usize ] , pub __align : :: std :: os :: raw :: c_long , _bindgen_union_align : [ u64 ; 7usize ] , } # [ test ] fn bindgen_test_layout_pthread_attr_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_attr_t > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( pthread_attr_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_attr_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_attr_t ) ) ) ; } impl Default for pthread_attr_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __pthread_internal_list { pub __prev : * mut __pthread_internal_list , pub __next : * mut __pthread_internal_list , } # [ test ] fn bindgen_test_layout___pthread_internal_list ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_internal_list > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( __pthread_internal_list ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_internal_list > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __pthread_internal_list ) ) ) ; } impl Default for __pthread_internal_list { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub type __pthread_list_t = __pthread_internal_list ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_mutex_t { pub __data : pthread_mutex_t___pthread_mutex_s , pub __size : [ :: std :: os :: raw :: c_char ; 40usize ] , pub __align : :: std :: os :: raw :: c_long , _bindgen_union_align : [ u64 ; 5usize ] , } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct pthread_mutex_t___pthread_mutex_s { pub __lock : :: std :: os :: raw :: c_int , pub __count : :: std :: os :: raw :: c_uint , pub __owner : :: std :: os :: raw :: c_int , pub __nusers : :: std :: os :: raw :: c_uint , pub __kind : :: std :: os :: raw :: c_int , pub __spins : :: std :: os :: raw :: c_short , pub __elision : :: std :: os :: raw :: c_short , pub __list : __pthread_list_t , } # [ test ] fn bindgen_test_layout_pthread_mutex_t___pthread_mutex_s ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_mutex_t___pthread_mutex_s > ( ) , 40usize , concat ! ( "Size of: " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_mutex_t___pthread_mutex_s > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_mutex_t___pthread_mutex_s ) ) ) ; } impl Default for pthread_mutex_t___pthread_mutex_s { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_pthread_mutex_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_mutex_t > ( ) , 40usize , concat ! ( "Size of: " , stringify ! ( pthread_mutex_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_mutex_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_mutex_t ) ) ) ; } impl Default for pthread_mutex_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_mutexattr_t { pub __size : [ :: std :: os :: raw :: c_char ; 4usize ] , pub __align : :: std :: os :: raw :: c_int , _bindgen_union_align : u32 , } # [ test ] fn bindgen_test_layout_pthread_mutexattr_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_mutexattr_t > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( pthread_mutexattr_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_mutexattr_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( pthread_mutexattr_t ) ) ) ; } impl Default for pthread_mutexattr_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_cond_t { pub __data : pthread_cond_t__bindgen_ty_1 , pub __size : [ :: std :: os :: raw :: c_char ; 48usize ] , pub __align : :: std :: os :: raw :: c_longlong , _bindgen_union_align : [ u64 ; 6usize ] , } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct pthread_cond_t__bindgen_ty_1 { pub __lock : :: std :: os :: raw :: c_int , pub __futex : :: std :: os :: raw :: c_uint , pub __total_seq : :: std :: os :: raw :: c_ulonglong , pub __wakeup_seq : :: std :: os :: raw :: c_ulonglong , pub __woken_seq : :: std :: os :: raw :: c_ulonglong , pub __mutex : * mut :: std :: os :: raw :: c_void , pub __nwaiters : :: std :: os :: raw :: c_uint , pub __broadcast_seq : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_cond_t__bindgen_ty_1 > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_cond_t__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) ) ) ; } impl Default for pthread_cond_t__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_pthread_cond_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_cond_t > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( pthread_cond_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_cond_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_cond_t ) ) ) ; } impl Default for pthread_cond_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_condattr_t { pub __size : [ :: std :: os :: raw :: c_char ; 4usize ] , pub __align : :: std :: os :: raw :: c_int , _bindgen_union_align : u32 , } # [ test ] fn bindgen_test_layout_pthread_condattr_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_condattr_t > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( pthread_condattr_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_condattr_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( pthread_condattr_t ) ) ) ; } impl Default for pthread_condattr_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub type pthread_key_t = :: std :: os :: raw :: c_uint ; pub type pthread_once_t = :: std :: os :: raw :: c_int ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_rwlock_t { pub __data : pthread_rwlock_t__bindgen_ty_1 , pub __size : [ :: std :: os :: raw :: c_char ; 56usize ] , pub __align : :: std :: os :: raw :: c_long , _bindgen_union_align : [ u64 ; 7usize ] , } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct pthread_rwlock_t__bindgen_ty_1 { pub __lock : :: std :: os :: raw :: c_int , pub __nr_readers : :: std :: os :: raw :: c_uint , pub __readers_wakeup : :: std :: os :: raw :: c_uint , pub __writer_wakeup : :: std :: os :: raw :: c_uint , pub __nr_readers_queued : :: std :: os :: raw :: c_uint , pub __nr_writers_queued : :: std :: os :: raw :: c_uint , pub __writer : :: std :: os :: raw :: c_int , pub __shared : :: std :: os :: raw :: c_int , pub __pad1 : :: std :: os :: raw :: c_ulong , pub __pad2 : :: std :: os :: raw :: c_ulong , pub __flags : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_pthread_rwlock_t__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_rwlock_t__bindgen_ty_1 > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_rwlock_t__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 ) ) ) ; } # [ test ] fn bindgen_test_layout_pthread_rwlock_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_rwlock_t > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( pthread_rwlock_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_rwlock_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_rwlock_t ) ) ) ; } impl Default for pthread_rwlock_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_rwlockattr_t { pub __size : [ :: std :: os :: raw :: c_char ; 8usize ] , pub __align : :: std :: os :: raw :: c_long , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_pthread_rwlockattr_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_rwlockattr_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( pthread_rwlockattr_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_rwlockattr_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_rwlockattr_t ) ) ) ; } impl Default for pthread_rwlockattr_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub type pthread_spinlock_t = :: std :: os :: raw :: c_int ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_barrier_t { pub __size : [ :: std :: os :: raw :: c_char ; 32usize ] , pub __align : :: std :: os :: raw :: c_long , _bindgen_union_align : [ u64 ; 4usize ] , } # [ test ] fn bindgen_test_layout_pthread_barrier_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_barrier_t > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( pthread_barrier_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_barrier_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_barrier_t ) ) ) ; } impl Default for pthread_barrier_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_barrierattr_t { pub __size : [ :: std :: os :: raw :: c_char ; 4usize ] , pub __align : :: std :: os :: raw :: c_int , _bindgen_union_align : u32 , } # [ test ] fn bindgen_test_layout_pthread_barrierattr_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_barrierattr_t > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( pthread_barrierattr_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_barrierattr_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( pthread_barrierattr_t ) ) ) ; } impl Default for pthread_barrierattr_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z6random" ] pub fn random ( ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z7srandom" ] pub fn srandom ( __seed : :: std :: os :: raw :: c_uint ) ; } extern "C" { # [ link_name = "\u{1}_Z9initstate" ] pub fn initstate ( __seed : :: std :: os :: raw :: c_uint , __statebuf : * mut :: std :: os :: raw :: c_char , __statelen : usize ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z8setstate" ] pub fn setstate ( __statebuf : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct random_data { pub fptr : * mut i32 , pub rptr : * mut i32 , pub state : * mut i32 , pub rand_type : :: std :: os :: raw :: c_int , pub rand_deg : :: std :: os :: raw :: c_int , pub rand_sep : :: std :: os :: raw :: c_int , pub end_ptr : * mut i32 , } # [ test ] fn bindgen_test_layout_random_data ( ) { assert_eq ! ( :: std :: mem :: size_of :: < random_data > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( random_data ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < random_data > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( random_data ) ) ) ; } impl Default for random_data { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z8random_r" ] pub fn random_r ( __buf : * mut random_data , __result : * mut i32 ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9srandom_r" ] pub fn srandom_r ( __seed : :: std :: os :: raw :: c_uint , __buf : * mut random_data ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11initstate_r" ] pub fn initstate_r ( __seed : :: std :: os :: raw :: c_uint , __statebuf : * mut :: std :: os :: raw :: c_char , __statelen : usize , __buf : * mut random_data ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10setstate_r" ] pub fn setstate_r ( __statebuf : * mut :: std :: os :: raw :: c_char , __buf : * mut random_data ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4rand" ] pub fn rand ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5srand" ] pub fn srand ( __seed : :: std :: os :: raw :: c_uint ) ; } extern "C" { # [ link_name = "\u{1}_Z6rand_r" ] pub fn rand_r ( __seed : * mut :: std :: os :: raw :: c_uint ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7drand48" ] pub fn drand48 ( ) -> f64 ; } extern "C" { # [ link_name = "\u{1}_Z7erand48" ] pub fn erand48 ( __xsubi : * mut :: std :: os :: raw :: c_ushort ) -> f64 ; } extern "C" { # [ link_name = "\u{1}_Z7lrand48" ] pub fn lrand48 ( ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z7nrand48" ] pub fn nrand48 ( __xsubi : * mut :: std :: os :: raw :: c_ushort ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z7mrand48" ] pub fn mrand48 ( ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z7jrand48" ] pub fn jrand48 ( __xsubi : * mut :: std :: os :: raw :: c_ushort ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z7srand48" ] pub fn srand48 ( __seedval : :: std :: os :: raw :: c_long ) ; } extern "C" { # [ link_name = "\u{1}_Z6seed48" ] pub fn seed48 ( __seed16v : * mut :: std :: os :: raw :: c_ushort ) -> * mut :: std :: os :: raw :: c_ushort ; } extern "C" { # [ link_name = "\u{1}_Z7lcong48" ] pub fn lcong48 ( __param : * mut :: std :: os :: raw :: c_ushort ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct drand48_data { pub __x : [ :: std :: os :: raw :: c_ushort ; 3usize ] , pub __old_x : [ :: std :: os :: raw :: c_ushort ; 3usize ] , pub __c : :: std :: os :: raw :: c_ushort , pub __init : :: std :: os :: raw :: c_ushort , pub __a : :: std :: os :: raw :: c_ulonglong , } # [ test ] fn bindgen_test_layout_drand48_data ( ) { assert_eq ! ( :: std :: mem :: size_of :: < drand48_data > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( drand48_data ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < drand48_data > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( drand48_data ) ) ) ; } extern "C" { # [ link_name = "\u{1}_Z9drand48_r" ] pub fn drand48_r ( __buffer : * mut drand48_data , __result : * mut f64 ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9erand48_r" ] pub fn erand48_r ( __xsubi : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data , __result : * mut f64 ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9lrand48_r" ] pub fn lrand48_r ( __buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9nrand48_r" ] pub fn nrand48_r ( __xsubi : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9mrand48_r" ] pub fn mrand48_r ( __buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9jrand48_r" ] pub fn jrand48_r ( __xsubi : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9srand48_r" ] pub fn srand48_r ( __seedval : :: std :: os :: raw :: c_long , __buffer : * mut drand48_data ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8seed48_r" ] pub fn seed48_r ( __seed16v : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9lcong48_r" ] pub fn lcong48_r ( __param : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6malloc" ] pub fn malloc ( __size : usize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z6calloc" ] pub fn calloc ( __nmemb : usize , __size : usize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z7realloc" ] pub fn realloc ( __ptr : * mut :: std :: os :: raw :: c_void , __size : usize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z4free" ] pub fn free ( __ptr : * mut :: std :: os :: raw :: c_void ) ; } extern "C" { # [ link_name = "\u{1}_Z5cfree" ] pub fn cfree ( __ptr : * mut :: std :: os :: raw :: c_void ) ; } extern "C" { # [ link_name = "\u{1}_Z6alloca" ] pub fn alloca ( __size : usize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z6valloc" ] pub fn valloc ( __size : usize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z14posix_memalign" ] pub fn posix_memalign ( __memptr : * mut * mut :: std :: os :: raw :: c_void , __alignment : usize , __size : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13aligned_alloc" ] pub fn aligned_alloc ( __alignment : usize , __size : usize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z5abort" ] pub fn abort ( ) ; } extern "C" { # [ link_name = "\u{1}_Z6atexit" ] pub fn atexit ( __func : :: std :: option :: Option < unsafe extern "C" fn ( ) > ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13at_quick_exit" ] pub fn at_quick_exit ( __func : :: std :: option :: Option < unsafe extern "C" fn ( ) > ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7on_exit" ] pub fn on_exit ( __func : :: std :: option :: Option < unsafe extern "C" fn ( __status : :: std :: os :: raw :: c_int , __arg : * mut :: std :: os :: raw :: c_void ) > , __arg : * mut :: std :: os :: raw :: c_void ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4exit" ] pub fn exit ( __status : :: std :: os :: raw :: c_int ) ; } extern "C" { # [ link_name = "\u{1}_Z10quick_exit" ] pub fn quick_exit ( __status : :: std :: os :: raw :: c_int ) ; } extern "C" { # [ link_name = "\u{1}_Z5_Exit" ] pub fn _Exit ( __status : :: std :: os :: raw :: c_int ) ; } extern "C" { # [ link_name = "\u{1}_Z6getenv" ] pub fn getenv ( __name : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6putenv" ] pub fn putenv ( __string : * mut :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6setenv" ] pub fn setenv ( __name : * const :: std :: os :: raw :: c_char , __value : * const :: std :: os :: raw :: c_char , __replace : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8unsetenv" ] pub fn unsetenv ( __name : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8clearenv" ] pub fn clearenv ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6mktemp" ] pub fn mktemp ( __template : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z7mkstemp" ] pub fn mkstemp ( __template : * mut :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8mkstemps" ] pub fn mkstemps ( __template : * mut :: std :: os :: raw :: c_char , __suffixlen : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7mkdtemp" ] pub fn mkdtemp ( __template : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6system" ] pub fn system ( __command : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8realpath" ] pub fn realpath ( __name : * const :: std :: os :: raw :: c_char , __resolved : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } pub type __compar_fn_t = :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * const :: std :: os :: raw :: c_void , arg2 : * const :: std :: os :: raw :: c_void ) -> :: std :: os :: raw :: c_int > ; extern "C" { # [ link_name = "\u{1}_Z7bsearch" ] pub fn bsearch ( __key : * const :: std :: os :: raw :: c_void , __base : * const :: std :: os :: raw :: c_void , __nmemb : usize , __size : usize , __compar : __compar_fn_t ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z5qsort" ] pub fn qsort ( __base : * mut :: std :: os :: raw :: c_void , __nmemb : usize , __size : usize , __compar : __compar_fn_t ) ; } extern "C" { # [ link_name = "\u{1}_Z3abs" ] pub fn abs ( __x : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4labs" ] pub fn labs ( __x : :: std :: os :: raw :: c_long ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z5llabs" ] pub fn llabs ( __x : :: std :: os :: raw :: c_longlong ) -> :: std :: os :: raw :: c_longlong ; } extern "C" { # [ link_name = "\u{1}_Z3div" ] pub fn div ( __numer : :: std :: os :: raw :: c_int , __denom : :: std :: os :: raw :: c_int ) -> div_t ; } extern "C" { # [ link_name = "\u{1}_Z4ldiv" ] pub fn ldiv ( __numer : :: std :: os :: raw :: c_long , __denom : :: std :: os :: raw :: c_long ) -> ldiv_t ; } extern "C" { # [ link_name = "\u{1}_Z5lldiv" ] pub fn lldiv ( __numer : :: std :: os :: raw :: c_longlong , __denom : :: std :: os :: raw :: c_longlong ) -> lldiv_t ; } extern "C" { # [ link_name = "\u{1}_Z4ecvt" ] pub fn ecvt ( __value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z4fcvt" ] pub fn fcvt ( __value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z4gcvt" ] pub fn gcvt ( __value : f64 , __ndigit : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z5qecvt" ] pub fn qecvt ( __value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z5qfcvt" ] pub fn qfcvt ( __value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z5qgcvt" ] pub fn qgcvt ( __value : f64 , __ndigit : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6ecvt_r" ] pub fn ecvt_r ( __value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6fcvt_r" ] pub fn fcvt_r ( __value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7qecvt_r" ] pub fn qecvt_r ( __value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7qfcvt_r" ] pub fn qfcvt_r ( __value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5mblen" ] pub fn mblen ( __s : * const :: std :: os :: raw :: c_char , __n : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6mbtowc" ] pub fn mbtowc ( __pwc : * mut wchar_t , __s : * const :: std :: os :: raw :: c_char , __n : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6wctomb" ] pub fn wctomb ( __s : * mut :: std :: os :: raw :: c_char , __wchar : wchar_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8mbstowcs" ] pub fn mbstowcs ( __pwcs : * mut wchar_t , __s : * const :: std :: os :: raw :: c_char , __n : usize ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z8wcstombs" ] pub fn wcstombs ( __s : * mut :: std :: os :: raw :: c_char , __pwcs : * const wchar_t , __n : usize ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z7rpmatch" ] pub fn rpmatch ( __response : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9getsubopt" ] pub fn getsubopt ( __optionp : * mut * mut :: std :: os :: raw :: c_char , __tokens : * const * mut :: std :: os :: raw :: c_char , __valuep : * mut * mut :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10getloadavg" ] pub fn getloadavg ( __loadavg : * mut f64 , __nelem : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6memcpy" ] pub fn memcpy ( __dest : * mut :: std :: os :: raw :: c_void , __src : * const :: std :: os :: raw :: c_void , __n : usize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z7memmove" ] pub fn memmove ( __dest : * mut :: std :: os :: raw :: c_void , __src : * const :: std :: os :: raw :: c_void , __n : usize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z7memccpy" ] pub fn memccpy ( __dest : * mut :: std :: os :: raw :: c_void , __src : * const :: std :: os :: raw :: c_void , __c : :: std :: os :: raw :: c_int , __n : usize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z6memset" ] pub fn memset ( __s : * mut :: std :: os :: raw :: c_void , __c : :: std :: os :: raw :: c_int , __n : usize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z6memcmp" ] pub fn memcmp ( __s1 : * const :: std :: os :: raw :: c_void , __s2 : * const :: std :: os :: raw :: c_void , __n : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6memchr" ] pub fn memchr ( __s : * const :: std :: os :: raw :: c_void , __c : :: std :: os :: raw :: c_int , __n : usize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z6strcpy" ] pub fn strcpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z7strncpy" ] pub fn strncpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6strcat" ] pub fn strcat ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z7strncat" ] pub fn strncat ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6strcmp" ] pub fn strcmp ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7strncmp" ] pub fn strncmp ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __n : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7strcoll" ] pub fn strcoll ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7strxfrm" ] pub fn strxfrm ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z9strcoll_l" ] pub fn strcoll_l ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __l : __locale_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9strxfrm_l" ] pub fn strxfrm_l ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize , __l : __locale_t ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z6strdup" ] pub fn strdup ( __s : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z7strndup" ] pub fn strndup ( __string : * const :: std :: os :: raw :: c_char , __n : usize ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6strchr" ] pub fn strchr ( __s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z7strrchr" ] pub fn strrchr ( __s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z7strcspn" ] pub fn strcspn ( __s : * const :: std :: os :: raw :: c_char , __reject : * const :: std :: os :: raw :: c_char ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z6strspn" ] pub fn strspn ( __s : * const :: std :: os :: raw :: c_char , __accept : * const :: std :: os :: raw :: c_char ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z7strpbrk" ] pub fn strpbrk ( __s : * const :: std :: os :: raw :: c_char , __accept : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6strstr" ] pub fn strstr ( __haystack : * const :: std :: os :: raw :: c_char , __needle : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6strtok" ] pub fn strtok ( __s : * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z10__strtok_r" ] pub fn __strtok_r ( __s : * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char , __save_ptr : * mut * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z8strtok_r" ] pub fn strtok_r ( __s : * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char , __save_ptr : * mut * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6strlen" ] pub fn strlen ( __s : * const :: std :: os :: raw :: c_char ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z7strnlen" ] pub fn strnlen ( __string : * const :: std :: os :: raw :: c_char , __maxlen : usize ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z8strerror" ] pub fn strerror ( __errnum : :: std :: os :: raw :: c_int ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}__xpg_strerror_r" ] pub fn strerror_r ( __errnum : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10strerror_l" ] pub fn strerror_l ( __errnum : :: std :: os :: raw :: c_int , __l : __locale_t ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z7__bzero" ] pub fn __bzero ( __s : * mut :: std :: os :: raw :: c_void , __n : usize ) ; } extern "C" { # [ link_name = "\u{1}_Z5bcopy" ] pub fn bcopy ( __src : * const :: std :: os :: raw :: c_void , __dest : * mut :: std :: os :: raw :: c_void , __n : usize ) ; } extern "C" { # [ link_name = "\u{1}_Z5bzero" ] pub fn bzero ( __s : * mut :: std :: os :: raw :: c_void , __n : usize ) ; } extern "C" { # [ link_name = "\u{1}_Z4bcmp" ] pub fn bcmp ( __s1 : * const :: std :: os :: raw :: c_void , __s2 : * const :: std :: os :: raw :: c_void , __n : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5index" ] pub fn index ( __s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6rindex" ] pub fn rindex ( __s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z3ffs" ] pub fn ffs ( __i : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10strcasecmp" ] pub fn strcasecmp ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11strncasecmp" ] pub fn strncasecmp ( __s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __n : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6strsep" ] pub fn strsep ( __stringp : * mut * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z9strsignal" ] pub fn strsignal ( __sig : :: std :: os :: raw :: c_int ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z8__stpcpy" ] pub fn __stpcpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z6stpcpy" ] pub fn stpcpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z9__stpncpy" ] pub fn __stpncpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z7stpncpy" ] pub fn stpncpy ( __dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize ) -> * mut :: std :: os :: raw :: c_char ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct tm { pub tm_sec : :: std :: os :: raw :: c_int , pub tm_min : :: std :: os :: raw :: c_int , pub tm_hour : :: std :: os :: raw :: c_int , pub tm_mday : :: std :: os :: raw :: c_int , pub tm_mon : :: std :: os :: raw :: c_int , pub tm_year : :: std :: os :: raw :: c_int , pub tm_wday : :: std :: os :: raw :: c_int , pub tm_yday : :: std :: os :: raw :: c_int , pub tm_isdst : :: std :: os :: raw :: c_int , pub tm_gmtoff : :: std :: os :: raw :: c_long , pub tm_zone : * const :: std :: os :: raw :: c_char , } # [ test ] fn bindgen_test_layout_tm ( ) { assert_eq ! ( :: std :: mem :: size_of :: < tm > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( tm ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < tm > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( tm ) ) ) ; } impl Default for tm { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct itimerspec { pub it_interval : timespec , pub it_value : timespec , } # [ test ] fn bindgen_test_layout_itimerspec ( ) { assert_eq ! ( :: std :: mem :: size_of :: < itimerspec > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( itimerspec ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < itimerspec > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( itimerspec ) ) ) ; } extern "C" { # [ link_name = "\u{1}_Z5clock" ] pub fn clock ( ) -> clock_t ; } extern "C" { # [ link_name = "\u{1}_Z4time" ] pub fn time ( __timer : * mut time_t ) -> time_t ; } extern "C" { # [ link_name = "\u{1}_Z8difftime" ] pub fn difftime ( __time1 : time_t , __time0 : time_t ) -> f64 ; } extern "C" { # [ link_name = "\u{1}_Z6mktime" ] pub fn mktime ( __tp : * mut tm ) -> time_t ; } extern "C" { # [ link_name = "\u{1}_Z8strftime" ] pub fn strftime ( __s : * mut :: std :: os :: raw :: c_char , __maxsize : usize , __format : * const :: std :: os :: raw :: c_char , __tp : * const tm ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z10strftime_l" ] pub fn strftime_l ( __s : * mut :: std :: os :: raw :: c_char , __maxsize : usize , __format : * const :: std :: os :: raw :: c_char , __tp : * const tm , __loc : __locale_t ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z6gmtime" ] pub fn gmtime ( __timer : * const time_t ) -> * mut tm ; } extern "C" { # [ link_name = "\u{1}_Z9localtime" ] pub fn localtime ( __timer : * const time_t ) -> * mut tm ; } extern "C" { # [ link_name = "\u{1}_Z8gmtime_r" ] pub fn gmtime_r ( __timer : * const time_t , __tp : * mut tm ) -> * mut tm ; } extern "C" { # [ link_name = "\u{1}_Z11localtime_r" ] pub fn localtime_r ( __timer : * const time_t , __tp : * mut tm ) -> * mut tm ; } extern "C" { # [ link_name = "\u{1}_Z7asctime" ] pub fn asctime ( __tp : * const tm ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z5ctime" ] pub fn ctime ( __timer : * const time_t ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z9asctime_r" ] pub fn asctime_r ( __tp : * const tm , __buf : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z7ctime_r" ] pub fn ctime_r ( __timer : * const time_t , __buf : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z5tzset" ] pub fn tzset ( ) ; } extern "C" { # [ link_name = "\u{1}_Z5stime" ] pub fn stime ( __when : * const time_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6timegm" ] pub fn timegm ( __tp : * mut tm ) -> time_t ; } extern "C" { # [ link_name = "\u{1}_Z9timelocal" ] pub fn timelocal ( __tp : * mut tm ) -> time_t ; } extern "C" { # [ link_name = "\u{1}_Z6dysize" ] pub fn dysize ( __year : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9nanosleep" ] pub fn nanosleep ( __requested_time : * const timespec , __remaining : * mut timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12clock_getres" ] pub fn clock_getres ( __clock_id : clockid_t , __res : * mut timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13clock_gettime" ] pub fn clock_gettime ( __clock_id : clockid_t , __tp : * mut timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13clock_settime" ] pub fn clock_settime ( __clock_id : clockid_t , __tp : * const timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z15clock_nanosleep" ] pub fn clock_nanosleep ( __clock_id : clockid_t , __flags : :: std :: os :: raw :: c_int , __req : * const timespec , __rem : * mut timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z19clock_getcpuclockid" ] pub fn clock_getcpuclockid ( __pid : pid_t , __clock_id : * mut clockid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12timer_create" ] pub fn timer_create ( __clock_id : clockid_t , __evp : * mut sigevent , __timerid : * mut timer_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12timer_delete" ] pub fn timer_delete ( __timerid : timer_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13timer_settime" ] pub fn timer_settime ( __timerid : timer_t , __flags : :: std :: os :: raw :: c_int , __value : * const itimerspec , __ovalue : * mut itimerspec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13timer_gettime" ] pub fn timer_gettime ( __timerid : timer_t , __value : * mut itimerspec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z16timer_getoverrun" ] pub fn timer_getoverrun ( __timerid : timer_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12timespec_get" ] pub fn timespec_get ( __ts : * mut timespec , __base : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct iovec { pub iov_base : * mut :: std :: os :: raw :: c_void , pub iov_len : usize , } # [ test ] fn bindgen_test_layout_iovec ( ) { assert_eq ! ( :: std :: mem :: size_of :: < iovec > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( iovec ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < iovec > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( iovec ) ) ) ; } impl Default for iovec { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z5readv" ] pub fn readv ( __fd : :: std :: os :: raw :: c_int , __iovec : * const iovec , __count : :: std :: os :: raw :: c_int ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z6writev" ] pub fn writev ( __fd : :: std :: os :: raw :: c_int , __iovec : * const iovec , __count : :: std :: os :: raw :: c_int ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z6preadv" ] pub fn preadv ( __fd : :: std :: os :: raw :: c_int , __iovec : * const iovec , __count : :: std :: os :: raw :: c_int , __offset : __off_t ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z7pwritev" ] pub fn pwritev ( __fd : :: std :: os :: raw :: c_int , __iovec : * const iovec , __count : :: std :: os :: raw :: c_int , __offset : __off_t ) -> isize ; } pub type socklen_t = __socklen_t ; pub const __socket_type_SOCK_STREAM : __socket_type = 1 ; pub const __socket_type_SOCK_DGRAM : __socket_type = 2 ; pub const __socket_type_SOCK_RAW : __socket_type = 3 ; pub const __socket_type_SOCK_RDM : __socket_type = 4 ; pub const __socket_type_SOCK_SEQPACKET : __socket_type = 5 ; pub const __socket_type_SOCK_DCCP : __socket_type = 6 ; pub const __socket_type_SOCK_PACKET : __socket_type = 10 ; pub const __socket_type_SOCK_CLOEXEC : __socket_type = 524288 ; pub const __socket_type_SOCK_NONBLOCK : __socket_type = 2048 ; pub type __socket_type = u32 ; pub type sa_family_t = :: std :: os :: raw :: c_ushort ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct sockaddr { pub sa_family : sa_family_t , pub sa_data : [ :: std :: os :: raw :: c_char ; 14usize ] , } # [ test ] fn bindgen_test_layout_sockaddr ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sockaddr > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( sockaddr ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sockaddr > ( ) , 2usize , concat ! ( "Alignment of " , stringify ! ( sockaddr ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct sockaddr_storage { pub ss_family : sa_family_t , pub __ss_padding : [ :: std :: os :: raw :: c_char ; 118usize ] , pub __ss_align : :: std :: os :: raw :: c_ulong , } # [ test ] fn bindgen_test_layout_sockaddr_storage ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sockaddr_storage > ( ) , 128usize , concat ! ( "Size of: " , stringify ! ( sockaddr_storage ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sockaddr_storage > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sockaddr_storage ) ) ) ; } impl Default for sockaddr_storage { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub const MSG_OOB : _bindgen_ty_2 = 1 ; pub const MSG_PEEK : _bindgen_ty_2 = 2 ; pub const MSG_DONTROUTE : _bindgen_ty_2 = 4 ; pub const MSG_CTRUNC : _bindgen_ty_2 = 8 ; pub const MSG_PROXY : _bindgen_ty_2 = 16 ; pub const MSG_TRUNC : _bindgen_ty_2 = 32 ; pub const MSG_DONTWAIT : _bindgen_ty_2 = 64 ; pub const MSG_EOR : _bindgen_ty_2 = 128 ; pub const MSG_WAITALL : _bindgen_ty_2 = 256 ; pub const MSG_FIN : _bindgen_ty_2 = 512 ; pub const MSG_SYN : _bindgen_ty_2 = 1024 ; pub const MSG_CONFIRM : _bindgen_ty_2 = 2048 ; pub const MSG_RST : _bindgen_ty_2 = 4096 ; pub const MSG_ERRQUEUE : _bindgen_ty_2 = 8192 ; pub const MSG_NOSIGNAL : _bindgen_ty_2 = 16384 ; pub const MSG_MORE : _bindgen_ty_2 = 32768 ; pub const MSG_WAITFORONE : _bindgen_ty_2 = 65536 ; pub const MSG_FASTOPEN : _bindgen_ty_2 = 536870912 ; pub const MSG_CMSG_CLOEXEC : _bindgen_ty_2 = 1073741824 ; pub type _bindgen_ty_2 = u32 ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct msghdr { pub msg_name : * mut :: std :: os :: raw :: c_void , pub msg_namelen : socklen_t , pub msg_iov : * mut iovec , pub msg_iovlen : usize , pub msg_control : * mut :: std :: os :: raw :: c_void , pub msg_controllen : usize , pub msg_flags : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout_msghdr ( ) { assert_eq ! ( :: std :: mem :: size_of :: < msghdr > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( msghdr ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < msghdr > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( msghdr ) ) ) ; } impl Default for msghdr { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default ) ] pub struct cmsghdr { pub cmsg_len : usize , pub cmsg_level : :: std :: os :: raw :: c_int , pub cmsg_type : :: std :: os :: raw :: c_int , pub __cmsg_data : __IncompleteArrayField < :: std :: os :: raw :: c_uchar > , } # [ test ] fn bindgen_test_layout_cmsghdr ( ) { assert_eq ! ( :: std :: mem :: size_of :: < cmsghdr > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( cmsghdr ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < cmsghdr > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( cmsghdr ) ) ) ; } extern "C" { # [ link_name = "\u{1}_Z13__cmsg_nxthdr" ] pub fn __cmsg_nxthdr ( __mhdr : * mut msghdr , __cmsg : * mut cmsghdr ) -> * mut cmsghdr ; } pub const SCM_RIGHTS : _bindgen_ty_3 = 1 ; pub type _bindgen_ty_3 = u32 ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct linger { pub l_onoff : :: std :: os :: raw :: c_int , pub l_linger : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout_linger ( ) { assert_eq ! ( :: std :: mem :: size_of :: < linger > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( linger ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < linger > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( linger ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct osockaddr { pub sa_family : :: std :: os :: raw :: c_ushort , pub sa_data : [ :: std :: os :: raw :: c_uchar ; 14usize ] , } # [ test ] fn bindgen_test_layout_osockaddr ( ) { assert_eq ! ( :: std :: mem :: size_of :: < osockaddr > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( osockaddr ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < osockaddr > ( ) , 2usize , concat ! ( "Alignment of " , stringify ! ( osockaddr ) ) ) ; } pub const SHUT_RD : _bindgen_ty_4 = 0 ; pub const SHUT_WR : _bindgen_ty_4 = 1 ; pub const SHUT_RDWR : _bindgen_ty_4 = 2 ; pub type _bindgen_ty_4 = u32 ; extern "C" { # [ link_name = "\u{1}_Z6socket" ] pub fn socket ( __domain : :: std :: os :: raw :: c_int , __type : :: std :: os :: raw :: c_int , __protocol : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10socketpair" ] pub fn socketpair ( __domain : :: std :: os :: raw :: c_int , __type : :: std :: os :: raw :: c_int , __protocol : :: std :: os :: raw :: c_int , __fds : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4bind" ] pub fn bind ( __fd : :: std :: os :: raw :: c_int , __addr : * const sockaddr , __len : socklen_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11getsockname" ] pub fn getsockname ( __fd : :: std :: os :: raw :: c_int , __addr : * mut sockaddr , __len : * mut socklen_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7connect" ] pub fn connect ( __fd : :: std :: os :: raw :: c_int , __addr : * const sockaddr , __len : socklen_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11getpeername" ] pub fn getpeername ( __fd : :: std :: os :: raw :: c_int , __addr : * mut sockaddr , __len : * mut socklen_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4send" ] pub fn send ( __fd : :: std :: os :: raw :: c_int , __buf : * const :: std :: os :: raw :: c_void , __n : usize , __flags : :: std :: os :: raw :: c_int ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z4recv" ] pub fn recv ( __fd : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_void , __n : usize , __flags : :: std :: os :: raw :: c_int ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z6sendto" ] pub fn sendto ( __fd : :: std :: os :: raw :: c_int , __buf : * const :: std :: os :: raw :: c_void , __n : usize , __flags : :: std :: os :: raw :: c_int , __addr : * const sockaddr , __addr_len : socklen_t ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z8recvfrom" ] pub fn recvfrom ( __fd : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_void , __n : usize , __flags : :: std :: os :: raw :: c_int , __addr : * mut sockaddr , __addr_len : * mut socklen_t ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z7sendmsg" ] pub fn sendmsg ( __fd : :: std :: os :: raw :: c_int , __message : * const msghdr , __flags : :: std :: os :: raw :: c_int ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z7recvmsg" ] pub fn recvmsg ( __fd : :: std :: os :: raw :: c_int , __message : * mut msghdr , __flags : :: std :: os :: raw :: c_int ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z10getsockopt" ] pub fn getsockopt ( __fd : :: std :: os :: raw :: c_int , __level : :: std :: os :: raw :: c_int , __optname : :: std :: os :: raw :: c_int , __optval : * mut :: std :: os :: raw :: c_void , __optlen : * mut socklen_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10setsockopt" ] pub fn setsockopt ( __fd : :: std :: os :: raw :: c_int , __level : :: std :: os :: raw :: c_int , __optname : :: std :: os :: raw :: c_int , __optval : * const :: std :: os :: raw :: c_void , __optlen : socklen_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6listen" ] pub fn listen ( __fd : :: std :: os :: raw :: c_int , __n : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6accept" ] pub fn accept ( __fd : :: std :: os :: raw :: c_int , __addr : * mut sockaddr , __addr_len : * mut socklen_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8shutdown" ] pub fn shutdown ( __fd : :: std :: os :: raw :: c_int , __how : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10sockatmark" ] pub fn sockatmark ( __fd : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8isfdtype" ] pub fn isfdtype ( __fd : :: std :: os :: raw :: c_int , __fdtype : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } pub type in_addr_t = u32 ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct in_addr { pub s_addr : in_addr_t , } # [ test ] fn bindgen_test_layout_in_addr ( ) { assert_eq ! ( :: std :: mem :: size_of :: < in_addr > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( in_addr ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < in_addr > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( in_addr ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct ip_opts { pub ip_dst : in_addr , pub ip_opts : [ :: std :: os :: raw :: c_char ; 40usize ] , } # [ test ] fn bindgen_test_layout_ip_opts ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ip_opts > ( ) , 44usize , concat ! ( "Size of: " , stringify ! ( ip_opts ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ip_opts > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( ip_opts ) ) ) ; } impl Default for ip_opts { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct ip_mreqn { pub imr_multiaddr : in_addr , pub imr_address : in_addr , pub imr_ifindex : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout_ip_mreqn ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ip_mreqn > ( ) , 12usize , concat ! ( "Size of: " , stringify ! ( ip_mreqn ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ip_mreqn > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( ip_mreqn ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct in_pktinfo { pub ipi_ifindex : :: std :: os :: raw :: c_int , pub ipi_spec_dst : in_addr , pub ipi_addr : in_addr , } # [ test ] fn bindgen_test_layout_in_pktinfo ( ) { assert_eq ! ( :: std :: mem :: size_of :: < in_pktinfo > ( ) , 12usize , concat ! ( "Size of: " , stringify ! ( in_pktinfo ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < in_pktinfo > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( in_pktinfo ) ) ) ; } pub const IPPROTO_IP : _bindgen_ty_5 = 0 ; pub const IPPROTO_ICMP : _bindgen_ty_5 = 1 ; pub const IPPROTO_IGMP : _bindgen_ty_5 = 2 ; pub const IPPROTO_IPIP : _bindgen_ty_5 = 4 ; pub const IPPROTO_TCP : _bindgen_ty_5 = 6 ; pub const IPPROTO_EGP : _bindgen_ty_5 = 8 ; pub const IPPROTO_PUP : _bindgen_ty_5 = 12 ; pub const IPPROTO_UDP : _bindgen_ty_5 = 17 ; pub const IPPROTO_IDP : _bindgen_ty_5 = 22 ; pub const IPPROTO_TP : _bindgen_ty_5 = 29 ; pub const IPPROTO_DCCP : _bindgen_ty_5 = 33 ; pub const IPPROTO_IPV6 : _bindgen_ty_5 = 41 ; pub const IPPROTO_RSVP : _bindgen_ty_5 = 46 ; pub const IPPROTO_GRE : _bindgen_ty_5 = 47 ; pub const IPPROTO_ESP : _bindgen_ty_5 = 50 ; pub const IPPROTO_AH : _bindgen_ty_5 = 51 ; pub const IPPROTO_MTP : _bindgen_ty_5 = 92 ; pub const IPPROTO_BEETPH : _bindgen_ty_5 = 94 ; pub const IPPROTO_ENCAP : _bindgen_ty_5 = 98 ; pub const IPPROTO_PIM : _bindgen_ty_5 = 103 ; pub const IPPROTO_COMP : _bindgen_ty_5 = 108 ; pub const IPPROTO_SCTP : _bindgen_ty_5 = 132 ; pub const IPPROTO_UDPLITE : _bindgen_ty_5 = 136 ; pub const IPPROTO_RAW : _bindgen_ty_5 = 255 ; pub const IPPROTO_MAX : _bindgen_ty_5 = 256 ; pub type _bindgen_ty_5 = u32 ; pub const IPPROTO_HOPOPTS : _bindgen_ty_6 = 0 ; pub const IPPROTO_ROUTING : _bindgen_ty_6 = 43 ; pub const IPPROTO_FRAGMENT : _bindgen_ty_6 = 44 ; pub const IPPROTO_ICMPV6 : _bindgen_ty_6 = 58 ; pub const IPPROTO_NONE : _bindgen_ty_6 = 59 ; pub const IPPROTO_DSTOPTS : _bindgen_ty_6 = 60 ; pub const IPPROTO_MH : _bindgen_ty_6 = 135 ; pub type _bindgen_ty_6 = u32 ; pub type in_port_t = u16 ; pub const IPPORT_ECHO : _bindgen_ty_7 = 7 ; pub const IPPORT_DISCARD : _bindgen_ty_7 = 9 ; pub const IPPORT_SYSTAT : _bindgen_ty_7 = 11 ; pub const IPPORT_DAYTIME : _bindgen_ty_7 = 13 ; pub const IPPORT_NETSTAT : _bindgen_ty_7 = 15 ; pub const IPPORT_FTP : _bindgen_ty_7 = 21 ; pub const IPPORT_TELNET : _bindgen_ty_7 = 23 ; pub const IPPORT_SMTP : _bindgen_ty_7 = 25 ; pub const IPPORT_TIMESERVER : _bindgen_ty_7 = 37 ; pub const IPPORT_NAMESERVER : _bindgen_ty_7 = 42 ; pub const IPPORT_WHOIS : _bindgen_ty_7 = 43 ; pub const IPPORT_MTP : _bindgen_ty_7 = 57 ; pub const IPPORT_TFTP : _bindgen_ty_7 = 69 ; pub const IPPORT_RJE : _bindgen_ty_7 = 77 ; pub const IPPORT_FINGER : _bindgen_ty_7 = 79 ; pub const IPPORT_TTYLINK : _bindgen_ty_7 = 87 ; pub const IPPORT_SUPDUP : _bindgen_ty_7 = 95 ; pub const IPPORT_EXECSERVER : _bindgen_ty_7 = 512 ; pub const IPPORT_LOGINSERVER : _bindgen_ty_7 = 513 ; pub const IPPORT_CMDSERVER : _bindgen_ty_7 = 514 ; pub const IPPORT_EFSSERVER : _bindgen_ty_7 = 520 ; pub const IPPORT_BIFFUDP : _bindgen_ty_7 = 512 ; pub const IPPORT_WHOSERVER : _bindgen_ty_7 = 513 ; pub const IPPORT_ROUTESERVER : _bindgen_ty_7 = 520 ; pub const IPPORT_RESERVED : _bindgen_ty_7 = 1024 ; pub const IPPORT_USERRESERVED : _bindgen_ty_7 = 5000 ; pub type _bindgen_ty_7 = u32 ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct in6_addr { pub __in6_u : in6_addr__bindgen_ty_1 , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union in6_addr__bindgen_ty_1 { pub __u6_addr8 : [ u8 ; 16usize ] , pub __u6_addr16 : [ u16 ; 8usize ] , pub __u6_addr32 : [ u32 ; 4usize ] , _bindgen_union_align : [ u32 ; 4usize ] , } # [ test ] fn bindgen_test_layout_in6_addr__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < in6_addr__bindgen_ty_1 > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( in6_addr__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < in6_addr__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( in6_addr__bindgen_ty_1 ) ) ) ; } impl Default for in6_addr__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_in6_addr ( ) { assert_eq ! ( :: std :: mem :: size_of :: < in6_addr > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( in6_addr ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < in6_addr > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( in6_addr ) ) ) ; } impl Default for in6_addr { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct sockaddr_in { pub sin_family : sa_family_t , pub sin_port : in_port_t , pub sin_addr : in_addr , pub sin_zero : [ :: std :: os :: raw :: c_uchar ; 8usize ] , } # [ test ] fn bindgen_test_layout_sockaddr_in ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sockaddr_in > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( sockaddr_in ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sockaddr_in > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( sockaddr_in ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct sockaddr_in6 { pub sin6_family : sa_family_t , pub sin6_port : in_port_t , pub sin6_flowinfo : u32 , pub sin6_addr : in6_addr , pub sin6_scope_id : u32 , } # [ test ] fn bindgen_test_layout_sockaddr_in6 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sockaddr_in6 > ( ) , 28usize , concat ! ( "Size of: " , stringify ! ( sockaddr_in6 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sockaddr_in6 > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( sockaddr_in6 ) ) ) ; } impl Default for sockaddr_in6 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct ip_mreq { pub imr_multiaddr : in_addr , pub imr_interface : in_addr , } # [ test ] fn bindgen_test_layout_ip_mreq ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ip_mreq > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( ip_mreq ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ip_mreq > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( ip_mreq ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct ip_mreq_source { pub imr_multiaddr : in_addr , pub imr_interface : in_addr , pub imr_sourceaddr : in_addr , } # [ test ] fn bindgen_test_layout_ip_mreq_source ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ip_mreq_source > ( ) , 12usize , concat ! ( "Size of: " , stringify ! ( ip_mreq_source ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ip_mreq_source > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( ip_mreq_source ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct ipv6_mreq { pub ipv6mr_multiaddr : in6_addr , pub ipv6mr_interface : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_ipv6_mreq ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ipv6_mreq > ( ) , 20usize , concat ! ( "Size of: " , stringify ! ( ipv6_mreq ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ipv6_mreq > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( ipv6_mreq ) ) ) ; } impl Default for ipv6_mreq { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct group_req { pub gr_interface : u32 , pub gr_group : sockaddr_storage , } # [ test ] fn bindgen_test_layout_group_req ( ) { assert_eq ! ( :: std :: mem :: size_of :: < group_req > ( ) , 136usize , concat ! ( "Size of: " , stringify ! ( group_req ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < group_req > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( group_req ) ) ) ; } impl Default for group_req { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct group_source_req { pub gsr_interface : u32 , pub gsr_group : sockaddr_storage , pub gsr_source : sockaddr_storage , } # [ test ] fn bindgen_test_layout_group_source_req ( ) { assert_eq ! ( :: std :: mem :: size_of :: < group_source_req > ( ) , 264usize , concat ! ( "Size of: " , stringify ! ( group_source_req ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < group_source_req > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( group_source_req ) ) ) ; } impl Default for group_source_req { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct ip_msfilter { pub imsf_multiaddr : in_addr , pub imsf_interface : in_addr , pub imsf_fmode : u32 , pub imsf_numsrc : u32 , pub imsf_slist : [ in_addr ; 1usize ] , } # [ test ] fn bindgen_test_layout_ip_msfilter ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ip_msfilter > ( ) , 20usize , concat ! ( "Size of: " , stringify ! ( ip_msfilter ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ip_msfilter > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( ip_msfilter ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct group_filter { pub gf_interface : u32 , pub gf_group : sockaddr_storage , pub gf_fmode : u32 , pub gf_numsrc : u32 , pub gf_slist : [ sockaddr_storage ; 1usize ] , } # [ test ] fn bindgen_test_layout_group_filter ( ) { assert_eq ! ( :: std :: mem :: size_of :: < group_filter > ( ) , 272usize , concat ! ( "Size of: " , stringify ! ( group_filter ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < group_filter > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( group_filter ) ) ) ; } impl Default for group_filter { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z5ntohl" ] pub fn ntohl ( __netlong : u32 ) -> u32 ; } extern "C" { # [ link_name = "\u{1}_Z5ntohs" ] pub fn ntohs ( __netshort : u16 ) -> u16 ; } extern "C" { # [ link_name = "\u{1}_Z5htonl" ] pub fn htonl ( __hostlong : u32 ) -> u32 ; } extern "C" { # [ link_name = "\u{1}_Z5htons" ] pub fn htons ( __hostshort : u16 ) -> u16 ; } extern "C" { # [ link_name = "\u{1}_Z12bindresvport" ] pub fn bindresvport ( __sockfd : :: std :: os :: raw :: c_int , __sock_in : * mut sockaddr_in ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13bindresvport6" ] pub fn bindresvport6 ( __sockfd : :: std :: os :: raw :: c_int , __sock_in : * mut sockaddr_in6 ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9inet_addr" ] pub fn inet_addr ( __cp : * const :: std :: os :: raw :: c_char ) -> in_addr_t ; } extern "C" { # [ link_name = "\u{1}_Z10inet_lnaof" ] pub fn inet_lnaof ( __in : in_addr ) -> in_addr_t ; } extern "C" { # [ link_name = "\u{1}_Z13inet_makeaddr" ] pub fn inet_makeaddr ( __net : in_addr_t , __host : in_addr_t ) -> in_addr ; } extern "C" { # [ link_name = "\u{1}_Z10inet_netof" ] pub fn inet_netof ( __in : in_addr ) -> in_addr_t ; } extern "C" { # [ link_name = "\u{1}_Z12inet_network" ] pub fn inet_network ( __cp : * const :: std :: os :: raw :: c_char ) -> in_addr_t ; } extern "C" { # [ link_name = "\u{1}_Z9inet_ntoa" ] pub fn inet_ntoa ( __in : in_addr ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z9inet_pton" ] pub fn inet_pton ( __af : :: std :: os :: raw :: c_int , __cp : * const :: std :: os :: raw :: c_char , __buf : * mut :: std :: os :: raw :: c_void ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9inet_ntop" ] pub fn inet_ntop ( __af : :: std :: os :: raw :: c_int , __cp : * const :: std :: os :: raw :: c_void , __buf : * mut :: std :: os :: raw :: c_char , __len : socklen_t ) -> * const :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z9inet_aton" ] pub fn inet_aton ( __cp : * const :: std :: os :: raw :: c_char , __inp : * mut in_addr ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9inet_neta" ] pub fn inet_neta ( __net : in_addr_t , __buf : * mut :: std :: os :: raw :: c_char , __len : usize ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z13inet_net_ntop" ] pub fn inet_net_ntop ( __af : :: std :: os :: raw :: c_int , __cp : * const :: std :: os :: raw :: c_void , __bits : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : usize ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z13inet_net_pton" ] pub fn inet_net_pton ( __af : :: std :: os :: raw :: c_int , __cp : * const :: std :: os :: raw :: c_char , __buf : * mut :: std :: os :: raw :: c_void , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z14inet_nsap_addr" ] pub fn inet_nsap_addr ( __cp : * const :: std :: os :: raw :: c_char , __buf : * mut :: std :: os :: raw :: c_uchar , __len : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_uint ; } extern "C" { # [ link_name = "\u{1}_Z14inet_nsap_ntoa" ] pub fn inet_nsap_ntoa ( __len : :: std :: os :: raw :: c_int , __cp : * const :: std :: os :: raw :: c_uchar , __buf : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct dirent { pub d_ino : __ino_t , pub d_off : __off_t , pub d_reclen : :: std :: os :: raw :: c_ushort , pub d_type : :: std :: os :: raw :: c_uchar , pub d_name : [ :: std :: os :: raw :: c_char ; 256usize ] , } # [ test ] fn bindgen_test_layout_dirent ( ) { assert_eq ! ( :: std :: mem :: size_of :: < dirent > ( ) , 280usize , concat ! ( "Size of: " , stringify ! ( dirent ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < dirent > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( dirent ) ) ) ; } impl Default for dirent { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub const DT_UNKNOWN : _bindgen_ty_8 = 0 ; pub const DT_FIFO : _bindgen_ty_8 = 1 ; pub const DT_CHR : _bindgen_ty_8 = 2 ; pub const DT_DIR : _bindgen_ty_8 = 4 ; pub const DT_BLK : _bindgen_ty_8 = 6 ; pub const DT_REG : _bindgen_ty_8 = 8 ; pub const DT_LNK : _bindgen_ty_8 = 10 ; pub const DT_SOCK : _bindgen_ty_8 = 12 ; pub const DT_WHT : _bindgen_ty_8 = 14 ; pub type _bindgen_ty_8 = u32 ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __dirstream { _unused : [ u8 ; 0 ] , } pub type DIR = __dirstream ; extern "C" { # [ link_name = "\u{1}_Z7opendir" ] pub fn opendir ( __name : * const :: std :: os :: raw :: c_char ) -> * mut DIR ; } extern "C" { # [ link_name = "\u{1}_Z9fdopendir" ] pub fn fdopendir ( __fd : :: std :: os :: raw :: c_int ) -> * mut DIR ; } extern "C" { # [ link_name = "\u{1}_Z8closedir" ] pub fn closedir ( __dirp : * mut DIR ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7readdir" ] pub fn readdir ( __dirp : * mut DIR ) -> * mut dirent ; } extern "C" { # [ link_name = "\u{1}_Z9readdir_r" ] pub fn readdir_r ( __dirp : * mut DIR , __entry : * mut dirent , __result : * mut * mut dirent ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9rewinddir" ] pub fn rewinddir ( __dirp : * mut DIR ) ; } extern "C" { # [ link_name = "\u{1}_Z7seekdir" ] pub fn seekdir ( __dirp : * mut DIR , __pos : :: std :: os :: raw :: c_long ) ; } extern "C" { # [ link_name = "\u{1}_Z7telldir" ] pub fn telldir ( __dirp : * mut DIR ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z5dirfd" ] pub fn dirfd ( __dirp : * mut DIR ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7scandir" ] pub fn scandir ( __dir : * const :: std :: os :: raw :: c_char , __namelist : * mut * mut * mut dirent , __selector : :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * const dirent ) -> :: std :: os :: raw :: c_int > , __cmp : :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * mut * const dirent , arg2 : * mut * const dirent ) -> :: std :: os :: raw :: c_int > ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9alphasort" ] pub fn alphasort ( __e1 : * mut * const dirent , __e2 : * mut * const dirent ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13getdirentries" ] pub fn getdirentries ( __fd : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __nbytes : usize , __basep : * mut __off_t ) -> __ssize_t ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct flock { pub l_type : :: std :: os :: raw :: c_short , pub l_whence : :: std :: os :: raw :: c_short , pub l_start : __off_t , pub l_len : __off_t , pub l_pid : __pid_t , } # [ test ] fn bindgen_test_layout_flock ( ) { assert_eq ! ( :: std :: mem :: size_of :: < flock > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( flock ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < flock > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( flock ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct stat { pub st_dev : __dev_t , pub st_ino : __ino_t , pub st_nlink : __nlink_t , pub st_mode : __mode_t , pub st_uid : __uid_t , pub st_gid : __gid_t , pub __pad0 : :: std :: os :: raw :: c_int , pub st_rdev : __dev_t , pub st_size : __off_t , pub st_blksize : __blksize_t , pub st_blocks : __blkcnt_t , pub st_atim : timespec , pub st_mtim : timespec , pub st_ctim : timespec , pub __unused : [ __syscall_slong_t ; 3usize ] , } # [ test ] fn bindgen_test_layout_stat ( ) { assert_eq ! ( :: std :: mem :: size_of :: < stat > ( ) , 144usize , concat ! ( "Size of: " , stringify ! ( stat ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < stat > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( stat ) ) ) ; } extern "C" { # [ link_name = "\u{1}_Z5fcntl" ] pub fn fcntl ( __fd : :: std :: os :: raw :: c_int , __cmd : :: std :: os :: raw :: c_int , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4open" ] pub fn open ( __file : * const :: std :: os :: raw :: c_char , __oflag : :: std :: os :: raw :: c_int , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6openat" ] pub fn openat ( __fd : :: std :: os :: raw :: c_int , __file : * const :: std :: os :: raw :: c_char , __oflag : :: std :: os :: raw :: c_int , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5creat" ] pub fn creat ( __file : * const :: std :: os :: raw :: c_char , __mode : mode_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5lockf" ] pub fn lockf ( __fd : :: std :: os :: raw :: c_int , __cmd : :: std :: os :: raw :: c_int , __len : off_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13posix_fadvise" ] pub fn posix_fadvise ( __fd : :: std :: os :: raw :: c_int , __offset : off_t , __len : off_t , __advise : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z15posix_fallocate" ] pub fn posix_fallocate ( __fd : :: std :: os :: raw :: c_int , __offset : off_t , __len : off_t ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct ifaddrs { pub ifa_next : * mut ifaddrs , pub ifa_name : * mut :: std :: os :: raw :: c_char , pub ifa_flags : :: std :: os :: raw :: c_uint , pub ifa_addr : * mut sockaddr , pub ifa_netmask : * mut sockaddr , pub ifa_ifu : ifaddrs__bindgen_ty_1 , pub ifa_data : * mut :: std :: os :: raw :: c_void , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union ifaddrs__bindgen_ty_1 { pub ifu_broadaddr : * mut sockaddr , pub ifu_dstaddr : * mut sockaddr , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_ifaddrs__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ifaddrs__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( ifaddrs__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ifaddrs__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ifaddrs__bindgen_ty_1 ) ) ) ; } impl Default for ifaddrs__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_ifaddrs ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ifaddrs > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( ifaddrs ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ifaddrs > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ifaddrs ) ) ) ; } impl Default for ifaddrs { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z10getifaddrs" ] pub fn getifaddrs ( __ifap : * mut * mut ifaddrs ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11freeifaddrs" ] pub fn freeifaddrs ( __ifa : * mut ifaddrs ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct rpcent { pub r_name : * mut :: std :: os :: raw :: c_char , pub r_aliases : * mut * mut :: std :: os :: raw :: c_char , pub r_number : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout_rpcent ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rpcent > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( rpcent ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rpcent > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rpcent ) ) ) ; } impl Default for rpcent { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z9setrpcent" ] pub fn setrpcent ( __stayopen : :: std :: os :: raw :: c_int ) ; } extern "C" { # [ link_name = "\u{1}_Z9endrpcent" ] pub fn endrpcent ( ) ; } extern "C" { # [ link_name = "\u{1}_Z12getrpcbyname" ] pub fn getrpcbyname ( __name : * const :: std :: os :: raw :: c_char ) -> * mut rpcent ; } extern "C" { # [ link_name = "\u{1}_Z14getrpcbynumber" ] pub fn getrpcbynumber ( __number : :: std :: os :: raw :: c_int ) -> * mut rpcent ; } extern "C" { # [ link_name = "\u{1}_Z9getrpcent" ] pub fn getrpcent ( ) -> * mut rpcent ; } extern "C" { # [ link_name = "\u{1}_Z14getrpcbyname_r" ] pub fn getrpcbyname_r ( __name : * const :: std :: os :: raw :: c_char , __result_buf : * mut rpcent , __buffer : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut rpcent ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z16getrpcbynumber_r" ] pub fn getrpcbynumber_r ( __number : :: std :: os :: raw :: c_int , __result_buf : * mut rpcent , __buffer : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut rpcent ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11getrpcent_r" ] pub fn getrpcent_r ( __result_buf : * mut rpcent , __buffer : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut rpcent ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct netent { pub n_name : * mut :: std :: os :: raw :: c_char , pub n_aliases : * mut * mut :: std :: os :: raw :: c_char , pub n_addrtype : :: std :: os :: raw :: c_int , pub n_net : u32 , } # [ test ] fn bindgen_test_layout_netent ( ) { assert_eq ! ( :: std :: mem :: size_of :: < netent > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( netent ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < netent > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( netent ) ) ) ; } impl Default for netent { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z18__h_errno_location" ] pub fn __h_errno_location ( ) -> * mut :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6herror" ] pub fn herror ( __str : * const :: std :: os :: raw :: c_char ) ; } extern "C" { # [ link_name = "\u{1}_Z9hstrerror" ] pub fn hstrerror ( __err_num : :: std :: os :: raw :: c_int ) -> * const :: std :: os :: raw :: c_char ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct hostent { pub h_name : * mut :: std :: os :: raw :: c_char , pub h_aliases : * mut * mut :: std :: os :: raw :: c_char , pub h_addrtype : :: std :: os :: raw :: c_int , pub h_length : :: std :: os :: raw :: c_int , pub h_addr_list : * mut * mut :: std :: os :: raw :: c_char , } # [ test ] fn bindgen_test_layout_hostent ( ) { assert_eq ! ( :: std :: mem :: size_of :: < hostent > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( hostent ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < hostent > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( hostent ) ) ) ; } impl Default for hostent { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z10sethostent" ] pub fn sethostent ( __stay_open : :: std :: os :: raw :: c_int ) ; } extern "C" { # [ link_name = "\u{1}_Z10endhostent" ] pub fn endhostent ( ) ; } extern "C" { # [ link_name = "\u{1}_Z10gethostent" ] pub fn gethostent ( ) -> * mut hostent ; } extern "C" { # [ link_name = "\u{1}_Z13gethostbyaddr" ] pub fn gethostbyaddr ( __addr : * const :: std :: os :: raw :: c_void , __len : __socklen_t , __type : :: std :: os :: raw :: c_int ) -> * mut hostent ; } extern "C" { # [ link_name = "\u{1}_Z13gethostbyname" ] pub fn gethostbyname ( __name : * const :: std :: os :: raw :: c_char ) -> * mut hostent ; } extern "C" { # [ link_name = "\u{1}_Z14gethostbyname2" ] pub fn gethostbyname2 ( __name : * const :: std :: os :: raw :: c_char , __af : :: std :: os :: raw :: c_int ) -> * mut hostent ; } extern "C" { # [ link_name = "\u{1}_Z12gethostent_r" ] pub fn gethostent_r ( __result_buf : * mut hostent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut hostent , __h_errnop : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z15gethostbyaddr_r" ] pub fn gethostbyaddr_r ( __addr : * const :: std :: os :: raw :: c_void , __len : __socklen_t , __type : :: std :: os :: raw :: c_int , __result_buf : * mut hostent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut hostent , __h_errnop : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z15gethostbyname_r" ] pub fn gethostbyname_r ( __name : * const :: std :: os :: raw :: c_char , __result_buf : * mut hostent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut hostent , __h_errnop : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z16gethostbyname2_r" ] pub fn gethostbyname2_r ( __name : * const :: std :: os :: raw :: c_char , __af : :: std :: os :: raw :: c_int , __result_buf : * mut hostent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut hostent , __h_errnop : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9setnetent" ] pub fn setnetent ( __stay_open : :: std :: os :: raw :: c_int ) ; } extern "C" { # [ link_name = "\u{1}_Z9endnetent" ] pub fn endnetent ( ) ; } extern "C" { # [ link_name = "\u{1}_Z9getnetent" ] pub fn getnetent ( ) -> * mut netent ; } extern "C" { # [ link_name = "\u{1}_Z12getnetbyaddr" ] pub fn getnetbyaddr ( __net : u32 , __type : :: std :: os :: raw :: c_int ) -> * mut netent ; } extern "C" { # [ link_name = "\u{1}_Z12getnetbyname" ] pub fn getnetbyname ( __name : * const :: std :: os :: raw :: c_char ) -> * mut netent ; } extern "C" { # [ link_name = "\u{1}_Z11getnetent_r" ] pub fn getnetent_r ( __result_buf : * mut netent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut netent , __h_errnop : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z14getnetbyaddr_r" ] pub fn getnetbyaddr_r ( __net : u32 , __type : :: std :: os :: raw :: c_int , __result_buf : * mut netent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut netent , __h_errnop : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z14getnetbyname_r" ] pub fn getnetbyname_r ( __name : * const :: std :: os :: raw :: c_char , __result_buf : * mut netent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut netent , __h_errnop : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct servent { pub s_name : * mut :: std :: os :: raw :: c_char , pub s_aliases : * mut * mut :: std :: os :: raw :: c_char , pub s_port : :: std :: os :: raw :: c_int , pub s_proto : * mut :: std :: os :: raw :: c_char , } # [ test ] fn bindgen_test_layout_servent ( ) { assert_eq ! ( :: std :: mem :: size_of :: < servent > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( servent ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < servent > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( servent ) ) ) ; } impl Default for servent { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z10setservent" ] pub fn setservent ( __stay_open : :: std :: os :: raw :: c_int ) ; } extern "C" { # [ link_name = "\u{1}_Z10endservent" ] pub fn endservent ( ) ; } extern "C" { # [ link_name = "\u{1}_Z10getservent" ] pub fn getservent ( ) -> * mut servent ; } extern "C" { # [ link_name = "\u{1}_Z13getservbyname" ] pub fn getservbyname ( __name : * const :: std :: os :: raw :: c_char , __proto : * const :: std :: os :: raw :: c_char ) -> * mut servent ; } extern "C" { # [ link_name = "\u{1}_Z13getservbyport" ] pub fn getservbyport ( __port : :: std :: os :: raw :: c_int , __proto : * const :: std :: os :: raw :: c_char ) -> * mut servent ; } extern "C" { # [ link_name = "\u{1}_Z12getservent_r" ] pub fn getservent_r ( __result_buf : * mut servent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut servent ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z15getservbyname_r" ] pub fn getservbyname_r ( __name : * const :: std :: os :: raw :: c_char , __proto : * const :: std :: os :: raw :: c_char , __result_buf : * mut servent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut servent ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z15getservbyport_r" ] pub fn getservbyport_r ( __port : :: std :: os :: raw :: c_int , __proto : * const :: std :: os :: raw :: c_char , __result_buf : * mut servent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut servent ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct protoent { pub p_name : * mut :: std :: os :: raw :: c_char , pub p_aliases : * mut * mut :: std :: os :: raw :: c_char , pub p_proto : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout_protoent ( ) { assert_eq ! ( :: std :: mem :: size_of :: < protoent > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( protoent ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < protoent > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( protoent ) ) ) ; } impl Default for protoent { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z11setprotoent" ] pub fn setprotoent ( __stay_open : :: std :: os :: raw :: c_int ) ; } extern "C" { # [ link_name = "\u{1}_Z11endprotoent" ] pub fn endprotoent ( ) ; } extern "C" { # [ link_name = "\u{1}_Z11getprotoent" ] pub fn getprotoent ( ) -> * mut protoent ; } extern "C" { # [ link_name = "\u{1}_Z14getprotobyname" ] pub fn getprotobyname ( __name : * const :: std :: os :: raw :: c_char ) -> * mut protoent ; } extern "C" { # [ link_name = "\u{1}_Z16getprotobynumber" ] pub fn getprotobynumber ( __proto : :: std :: os :: raw :: c_int ) -> * mut protoent ; } extern "C" { # [ link_name = "\u{1}_Z13getprotoent_r" ] pub fn getprotoent_r ( __result_buf : * mut protoent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut protoent ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z16getprotobyname_r" ] pub fn getprotobyname_r ( __name : * const :: std :: os :: raw :: c_char , __result_buf : * mut protoent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut protoent ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z18getprotobynumber_r" ] pub fn getprotobynumber_r ( __proto : :: std :: os :: raw :: c_int , __result_buf : * mut protoent , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize , __result : * mut * mut protoent ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11setnetgrent" ] pub fn setnetgrent ( __netgroup : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11endnetgrent" ] pub fn endnetgrent ( ) ; } extern "C" { # [ link_name = "\u{1}_Z11getnetgrent" ] pub fn getnetgrent ( __hostp : * mut * mut :: std :: os :: raw :: c_char , __userp : * mut * mut :: std :: os :: raw :: c_char , __domainp : * mut * mut :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7innetgr" ] pub fn innetgr ( __netgroup : * const :: std :: os :: raw :: c_char , __host : * const :: std :: os :: raw :: c_char , __user : * const :: std :: os :: raw :: c_char , __domain : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13getnetgrent_r" ] pub fn getnetgrent_r ( __hostp : * mut * mut :: std :: os :: raw :: c_char , __userp : * mut * mut :: std :: os :: raw :: c_char , __domainp : * mut * mut :: std :: os :: raw :: c_char , __buffer : * mut :: std :: os :: raw :: c_char , __buflen : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4rcmd" ] pub fn rcmd ( __ahost : * mut * mut :: std :: os :: raw :: c_char , __rport : :: std :: os :: raw :: c_ushort , __locuser : * const :: std :: os :: raw :: c_char , __remuser : * const :: std :: os :: raw :: c_char , __cmd : * const :: std :: os :: raw :: c_char , __fd2p : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7rcmd_af" ] pub fn rcmd_af ( __ahost : * mut * mut :: std :: os :: raw :: c_char , __rport : :: std :: os :: raw :: c_ushort , __locuser : * const :: std :: os :: raw :: c_char , __remuser : * const :: std :: os :: raw :: c_char , __cmd : * const :: std :: os :: raw :: c_char , __fd2p : * mut :: std :: os :: raw :: c_int , __af : sa_family_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5rexec" ] pub fn rexec ( __ahost : * mut * mut :: std :: os :: raw :: c_char , __rport : :: std :: os :: raw :: c_int , __name : * const :: std :: os :: raw :: c_char , __pass : * const :: std :: os :: raw :: c_char , __cmd : * const :: std :: os :: raw :: c_char , __fd2p : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8rexec_af" ] pub fn rexec_af ( __ahost : * mut * mut :: std :: os :: raw :: c_char , __rport : :: std :: os :: raw :: c_int , __name : * const :: std :: os :: raw :: c_char , __pass : * const :: std :: os :: raw :: c_char , __cmd : * const :: std :: os :: raw :: c_char , __fd2p : * mut :: std :: os :: raw :: c_int , __af : sa_family_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7ruserok" ] pub fn ruserok ( __rhost : * const :: std :: os :: raw :: c_char , __suser : :: std :: os :: raw :: c_int , __remuser : * const :: std :: os :: raw :: c_char , __locuser : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10ruserok_af" ] pub fn ruserok_af ( __rhost : * const :: std :: os :: raw :: c_char , __suser : :: std :: os :: raw :: c_int , __remuser : * const :: std :: os :: raw :: c_char , __locuser : * const :: std :: os :: raw :: c_char , __af : sa_family_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8iruserok" ] pub fn iruserok ( __raddr : u32 , __suser : :: std :: os :: raw :: c_int , __remuser : * const :: std :: os :: raw :: c_char , __locuser : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11iruserok_af" ] pub fn iruserok_af ( __raddr : * const :: std :: os :: raw :: c_void , __suser : :: std :: os :: raw :: c_int , __remuser : * const :: std :: os :: raw :: c_char , __locuser : * const :: std :: os :: raw :: c_char , __af : sa_family_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9rresvport" ] pub fn rresvport ( __alport : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12rresvport_af" ] pub fn rresvport_af ( __alport : * mut :: std :: os :: raw :: c_int , __af : sa_family_t ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct addrinfo { pub ai_flags : :: std :: os :: raw :: c_int , pub ai_family : :: std :: os :: raw :: c_int , pub ai_socktype : :: std :: os :: raw :: c_int , pub ai_protocol : :: std :: os :: raw :: c_int , pub ai_addrlen : socklen_t , pub ai_addr : * mut sockaddr , pub ai_canonname : * mut :: std :: os :: raw :: c_char , pub ai_next : * mut addrinfo , } # [ test ] fn bindgen_test_layout_addrinfo ( ) { assert_eq ! ( :: std :: mem :: size_of :: < addrinfo > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( addrinfo ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < addrinfo > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( addrinfo ) ) ) ; } impl Default for addrinfo { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z11getaddrinfo" ] pub fn getaddrinfo ( __name : * const :: std :: os :: raw :: c_char , __service : * const :: std :: os :: raw :: c_char , __req : * const addrinfo , __pai : * mut * mut addrinfo ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12freeaddrinfo" ] pub fn freeaddrinfo ( __ai : * mut addrinfo ) ; } extern "C" { # [ link_name = "\u{1}_Z12gai_strerror" ] pub fn gai_strerror ( __ecode : :: std :: os :: raw :: c_int ) -> * const :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z11getnameinfo" ] pub fn getnameinfo ( __sa : * const sockaddr , __salen : socklen_t , __host : * mut :: std :: os :: raw :: c_char , __hostlen : socklen_t , __serv : * mut :: std :: os :: raw :: c_char , __servlen : socklen_t , __flags : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } pub type nfds_t = :: std :: os :: raw :: c_ulong ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct pollfd { pub fd : :: std :: os :: raw :: c_int , pub events : :: std :: os :: raw :: c_short , pub revents : :: std :: os :: raw :: c_short , } # [ test ] fn bindgen_test_layout_pollfd ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pollfd > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( pollfd ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pollfd > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( pollfd ) ) ) ; } extern "C" { # [ link_name = "\u{1}_Z4poll" ] pub fn poll ( __fds : * mut pollfd , __nfds : nfds_t , __timeout : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct sched_param { pub __sched_priority : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout_sched_param ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sched_param > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( sched_param ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sched_param > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( sched_param ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct __sched_param { pub __sched_priority : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout___sched_param ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __sched_param > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( __sched_param ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __sched_param > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __sched_param ) ) ) ; } pub type __cpu_mask = :: std :: os :: raw :: c_ulong ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct cpu_set_t { pub __bits : [ __cpu_mask ; 16usize ] , } # [ test ] fn bindgen_test_layout_cpu_set_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < cpu_set_t > ( ) , 128usize , concat ! ( "Size of: " , stringify ! ( cpu_set_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < cpu_set_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( cpu_set_t ) ) ) ; } extern "C" { # [ link_name = "\u{1}_Z16__sched_cpucount" ] pub fn __sched_cpucount ( __setsize : usize , __setp : * const cpu_set_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z16__sched_cpualloc" ] pub fn __sched_cpualloc ( __count : usize ) -> * mut cpu_set_t ; } extern "C" { # [ link_name = "\u{1}_Z15__sched_cpufree" ] pub fn __sched_cpufree ( __set : * mut cpu_set_t ) ; } extern "C" { # [ link_name = "\u{1}_Z14sched_setparam" ] pub fn sched_setparam ( __pid : __pid_t , __param : * const sched_param ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z14sched_getparam" ] pub fn sched_getparam ( __pid : __pid_t , __param : * mut sched_param ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z18sched_setscheduler" ] pub fn sched_setscheduler ( __pid : __pid_t , __policy : :: std :: os :: raw :: c_int , __param : * const sched_param ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z18sched_getscheduler" ] pub fn sched_getscheduler ( __pid : __pid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11sched_yield" ] pub fn sched_yield ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z22sched_get_priority_max" ] pub fn sched_get_priority_max ( __algorithm : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z22sched_get_priority_min" ] pub fn sched_get_priority_min ( __algorithm : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21sched_rr_get_interval" ] pub fn sched_rr_get_interval ( __pid : __pid_t , __t : * mut timespec ) -> :: std :: os :: raw :: c_int ; } pub type __jmp_buf = [ :: std :: os :: raw :: c_long ; 8usize ] ; pub const PTHREAD_CREATE_JOINABLE : _bindgen_ty_9 = 0 ; pub const PTHREAD_CREATE_DETACHED : _bindgen_ty_9 = 1 ; pub type _bindgen_ty_9 = u32 ; pub const PTHREAD_MUTEX_TIMED_NP : _bindgen_ty_10 = 0 ; pub const PTHREAD_MUTEX_RECURSIVE_NP : _bindgen_ty_10 = 1 ; pub const PTHREAD_MUTEX_ERRORCHECK_NP : _bindgen_ty_10 = 2 ; pub const PTHREAD_MUTEX_ADAPTIVE_NP : _bindgen_ty_10 = 3 ; pub const PTHREAD_MUTEX_NORMAL : _bindgen_ty_10 = 0 ; pub const PTHREAD_MUTEX_RECURSIVE : _bindgen_ty_10 = 1 ; pub const PTHREAD_MUTEX_ERRORCHECK : _bindgen_ty_10 = 2 ; pub const PTHREAD_MUTEX_DEFAULT : _bindgen_ty_10 = 0 ; pub type _bindgen_ty_10 = u32 ; pub const PTHREAD_MUTEX_STALLED : _bindgen_ty_11 = 0 ; pub const PTHREAD_MUTEX_STALLED_NP : _bindgen_ty_11 = 0 ; pub const PTHREAD_MUTEX_ROBUST : _bindgen_ty_11 = 1 ; pub const PTHREAD_MUTEX_ROBUST_NP : _bindgen_ty_11 = 1 ; pub type _bindgen_ty_11 = u32 ; pub const PTHREAD_PRIO_NONE : _bindgen_ty_12 = 0 ; pub const PTHREAD_PRIO_INHERIT : _bindgen_ty_12 = 1 ; pub const PTHREAD_PRIO_PROTECT : _bindgen_ty_12 = 2 ; pub type _bindgen_ty_12 = u32 ; pub const PTHREAD_RWLOCK_PREFER_READER_NP : _bindgen_ty_13 = 0 ; pub const PTHREAD_RWLOCK_PREFER_WRITER_NP : _bindgen_ty_13 = 1 ; pub const PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP : _bindgen_ty_13 = 2 ; pub const PTHREAD_RWLOCK_DEFAULT_NP : _bindgen_ty_13 = 0 ; pub type _bindgen_ty_13 = u32 ; pub const PTHREAD_INHERIT_SCHED : _bindgen_ty_14 = 0 ; pub const PTHREAD_EXPLICIT_SCHED : _bindgen_ty_14 = 1 ; pub type _bindgen_ty_14 = u32 ; pub const PTHREAD_SCOPE_SYSTEM : _bindgen_ty_15 = 0 ; pub const PTHREAD_SCOPE_PROCESS : _bindgen_ty_15 = 1 ; pub type _bindgen_ty_15 = u32 ; pub const PTHREAD_PROCESS_PRIVATE : _bindgen_ty_16 = 0 ; pub const PTHREAD_PROCESS_SHARED : _bindgen_ty_16 = 1 ; pub type _bindgen_ty_16 = u32 ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _pthread_cleanup_buffer { pub __routine : :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * mut :: std :: os :: raw :: c_void ) > , pub __arg : * mut :: std :: os :: raw :: c_void , pub __canceltype : :: std :: os :: raw :: c_int , pub __prev : * mut _pthread_cleanup_buffer , } # [ test ] fn bindgen_test_layout__pthread_cleanup_buffer ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _pthread_cleanup_buffer > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( _pthread_cleanup_buffer ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _pthread_cleanup_buffer > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _pthread_cleanup_buffer ) ) ) ; } impl Default for _pthread_cleanup_buffer { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub const PTHREAD_CANCEL_ENABLE : _bindgen_ty_17 = 0 ; pub const PTHREAD_CANCEL_DISABLE : _bindgen_ty_17 = 1 ; pub type _bindgen_ty_17 = u32 ; pub const PTHREAD_CANCEL_DEFERRED : _bindgen_ty_18 = 0 ; pub const PTHREAD_CANCEL_ASYNCHRONOUS : _bindgen_ty_18 = 1 ; pub type _bindgen_ty_18 = u32 ; extern "C" { # [ link_name = "\u{1}_Z14pthread_create" ] pub fn pthread_create ( __newthread : * mut pthread_t , __attr : * const pthread_attr_t , __start_routine : :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * mut :: std :: os :: raw :: c_void ) -> * mut :: std :: os :: raw :: c_void > , __arg : * mut :: std :: os :: raw :: c_void ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12pthread_exit" ] pub fn pthread_exit ( __retval : * mut :: std :: os :: raw :: c_void ) ; } extern "C" { # [ link_name = "\u{1}_Z12pthread_join" ] pub fn pthread_join ( __th : pthread_t , __thread_return : * mut * mut :: std :: os :: raw :: c_void ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z14pthread_detach" ] pub fn pthread_detach ( __th : pthread_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12pthread_self" ] pub fn pthread_self ( ) -> pthread_t ; } extern "C" { # [ link_name = "\u{1}_Z13pthread_equal" ] pub fn pthread_equal ( __thread1 : pthread_t , __thread2 : pthread_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z17pthread_attr_init" ] pub fn pthread_attr_init ( __attr : * mut pthread_attr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z20pthread_attr_destroy" ] pub fn pthread_attr_destroy ( __attr : * mut pthread_attr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z27pthread_attr_getdetachstate" ] pub fn pthread_attr_getdetachstate ( __attr : * const pthread_attr_t , __detachstate : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z27pthread_attr_setdetachstate" ] pub fn pthread_attr_setdetachstate ( __attr : * mut pthread_attr_t , __detachstate : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z25pthread_attr_getguardsize" ] pub fn pthread_attr_getguardsize ( __attr : * const pthread_attr_t , __guardsize : * mut usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z25pthread_attr_setguardsize" ] pub fn pthread_attr_setguardsize ( __attr : * mut pthread_attr_t , __guardsize : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z26pthread_attr_getschedparam" ] pub fn pthread_attr_getschedparam ( __attr : * const pthread_attr_t , __param : * mut sched_param ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z26pthread_attr_setschedparam" ] pub fn pthread_attr_setschedparam ( __attr : * mut pthread_attr_t , __param : * const sched_param ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z27pthread_attr_getschedpolicy" ] pub fn pthread_attr_getschedpolicy ( __attr : * const pthread_attr_t , __policy : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z27pthread_attr_setschedpolicy" ] pub fn pthread_attr_setschedpolicy ( __attr : * mut pthread_attr_t , __policy : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z28pthread_attr_getinheritsched" ] pub fn pthread_attr_getinheritsched ( __attr : * const pthread_attr_t , __inherit : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z28pthread_attr_setinheritsched" ] pub fn pthread_attr_setinheritsched ( __attr : * mut pthread_attr_t , __inherit : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_attr_getscope" ] pub fn pthread_attr_getscope ( __attr : * const pthread_attr_t , __scope : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_attr_setscope" ] pub fn pthread_attr_setscope ( __attr : * mut pthread_attr_t , __scope : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z25pthread_attr_getstackaddr" ] pub fn pthread_attr_getstackaddr ( __attr : * const pthread_attr_t , __stackaddr : * mut * mut :: std :: os :: raw :: c_void ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z25pthread_attr_setstackaddr" ] pub fn pthread_attr_setstackaddr ( __attr : * mut pthread_attr_t , __stackaddr : * mut :: std :: os :: raw :: c_void ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z25pthread_attr_getstacksize" ] pub fn pthread_attr_getstacksize ( __attr : * const pthread_attr_t , __stacksize : * mut usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z25pthread_attr_setstacksize" ] pub fn pthread_attr_setstacksize ( __attr : * mut pthread_attr_t , __stacksize : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_attr_getstack" ] pub fn pthread_attr_getstack ( __attr : * const pthread_attr_t , __stackaddr : * mut * mut :: std :: os :: raw :: c_void , __stacksize : * mut usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_attr_setstack" ] pub fn pthread_attr_setstack ( __attr : * mut pthread_attr_t , __stackaddr : * mut :: std :: os :: raw :: c_void , __stacksize : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_setschedparam" ] pub fn pthread_setschedparam ( __target_thread : pthread_t , __policy : :: std :: os :: raw :: c_int , __param : * const sched_param ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_getschedparam" ] pub fn pthread_getschedparam ( __target_thread : pthread_t , __policy : * mut :: std :: os :: raw :: c_int , __param : * mut sched_param ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z20pthread_setschedprio" ] pub fn pthread_setschedprio ( __target_thread : pthread_t , __prio : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12pthread_once" ] pub fn pthread_once ( __once_control : * mut pthread_once_t , __init_routine : :: std :: option :: Option < unsafe extern "C" fn ( ) > ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z22pthread_setcancelstate" ] pub fn pthread_setcancelstate ( __state : :: std :: os :: raw :: c_int , __oldstate : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_setcanceltype" ] pub fn pthread_setcanceltype ( __type : :: std :: os :: raw :: c_int , __oldtype : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z14pthread_cancel" ] pub fn pthread_cancel ( __th : pthread_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z18pthread_testcancel" ] pub fn pthread_testcancel ( ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __pthread_unwind_buf_t { pub __cancel_jmp_buf : [ __pthread_unwind_buf_t__bindgen_ty_1 ; 1usize ] , pub __pad : [ * mut :: std :: os :: raw :: c_void ; 4usize ] , } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct __pthread_unwind_buf_t__bindgen_ty_1 { pub __cancel_jmp_buf : __jmp_buf , pub __mask_was_saved : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout___pthread_unwind_buf_t__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_unwind_buf_t__bindgen_ty_1 > ( ) , 72usize , concat ! ( "Size of: " , stringify ! ( __pthread_unwind_buf_t__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_unwind_buf_t__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __pthread_unwind_buf_t__bindgen_ty_1 ) ) ) ; } # [ test ] fn bindgen_test_layout___pthread_unwind_buf_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_unwind_buf_t > ( ) , 104usize , concat ! ( "Size of: " , stringify ! ( __pthread_unwind_buf_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_unwind_buf_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __pthread_unwind_buf_t ) ) ) ; } impl Default for __pthread_unwind_buf_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __pthread_cleanup_frame { pub __cancel_routine : :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * mut :: std :: os :: raw :: c_void ) > , pub __cancel_arg : * mut :: std :: os :: raw :: c_void , pub __do_it : :: std :: os :: raw :: c_int , pub __cancel_type : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout___pthread_cleanup_frame ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_cleanup_frame > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( __pthread_cleanup_frame ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_cleanup_frame > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __pthread_cleanup_frame ) ) ) ; } impl Default for __pthread_cleanup_frame { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z25__pthread_register_cancel" ] pub fn __pthread_register_cancel ( __buf : * mut __pthread_unwind_buf_t ) ; } extern "C" { # [ link_name = "\u{1}_Z27__pthread_unregister_cancel" ] pub fn __pthread_unregister_cancel ( __buf : * mut __pthread_unwind_buf_t ) ; } extern "C" { # [ link_name = "\u{1}_Z21__pthread_unwind_next" ] pub fn __pthread_unwind_next ( __buf : * mut __pthread_unwind_buf_t ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __jmp_buf_tag { _unused : [ u8 ; 0 ] , } extern "C" { # [ link_name = "\u{1}_Z11__sigsetjmp" ] pub fn __sigsetjmp ( __env : * mut __jmp_buf_tag , __savemask : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z18pthread_mutex_init" ] pub fn pthread_mutex_init ( __mutex : * mut pthread_mutex_t , __mutexattr : * const pthread_mutexattr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_mutex_destroy" ] pub fn pthread_mutex_destroy ( __mutex : * mut pthread_mutex_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_mutex_trylock" ] pub fn pthread_mutex_trylock ( __mutex : * mut pthread_mutex_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z18pthread_mutex_lock" ] pub fn pthread_mutex_lock ( __mutex : * mut pthread_mutex_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z23pthread_mutex_timedlock" ] pub fn pthread_mutex_timedlock ( __mutex : * mut pthread_mutex_t , __abstime : * const timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z20pthread_mutex_unlock" ] pub fn pthread_mutex_unlock ( __mutex : * mut pthread_mutex_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z28pthread_mutex_getprioceiling" ] pub fn pthread_mutex_getprioceiling ( __mutex : * const pthread_mutex_t , __prioceiling : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z28pthread_mutex_setprioceiling" ] pub fn pthread_mutex_setprioceiling ( __mutex : * mut pthread_mutex_t , __prioceiling : :: std :: os :: raw :: c_int , __old_ceiling : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z24pthread_mutex_consistent" ] pub fn pthread_mutex_consistent ( __mutex : * mut pthread_mutex_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z22pthread_mutexattr_init" ] pub fn pthread_mutexattr_init ( __attr : * mut pthread_mutexattr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z25pthread_mutexattr_destroy" ] pub fn pthread_mutexattr_destroy ( __attr : * mut pthread_mutexattr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z28pthread_mutexattr_getpshared" ] pub fn pthread_mutexattr_getpshared ( __attr : * const pthread_mutexattr_t , __pshared : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z28pthread_mutexattr_setpshared" ] pub fn pthread_mutexattr_setpshared ( __attr : * mut pthread_mutexattr_t , __pshared : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z25pthread_mutexattr_gettype" ] pub fn pthread_mutexattr_gettype ( __attr : * const pthread_mutexattr_t , __kind : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z25pthread_mutexattr_settype" ] pub fn pthread_mutexattr_settype ( __attr : * mut pthread_mutexattr_t , __kind : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z29pthread_mutexattr_getprotocol" ] pub fn pthread_mutexattr_getprotocol ( __attr : * const pthread_mutexattr_t , __protocol : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z29pthread_mutexattr_setprotocol" ] pub fn pthread_mutexattr_setprotocol ( __attr : * mut pthread_mutexattr_t , __protocol : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z32pthread_mutexattr_getprioceiling" ] pub fn pthread_mutexattr_getprioceiling ( __attr : * const pthread_mutexattr_t , __prioceiling : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z32pthread_mutexattr_setprioceiling" ] pub fn pthread_mutexattr_setprioceiling ( __attr : * mut pthread_mutexattr_t , __prioceiling : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z27pthread_mutexattr_getrobust" ] pub fn pthread_mutexattr_getrobust ( __attr : * const pthread_mutexattr_t , __robustness : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z27pthread_mutexattr_setrobust" ] pub fn pthread_mutexattr_setrobust ( __attr : * mut pthread_mutexattr_t , __robustness : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z19pthread_rwlock_init" ] pub fn pthread_rwlock_init ( __rwlock : * mut pthread_rwlock_t , __attr : * const pthread_rwlockattr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z22pthread_rwlock_destroy" ] pub fn pthread_rwlock_destroy ( __rwlock : * mut pthread_rwlock_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_rwlock_rdlock" ] pub fn pthread_rwlock_rdlock ( __rwlock : * mut pthread_rwlock_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z24pthread_rwlock_tryrdlock" ] pub fn pthread_rwlock_tryrdlock ( __rwlock : * mut pthread_rwlock_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z26pthread_rwlock_timedrdlock" ] pub fn pthread_rwlock_timedrdlock ( __rwlock : * mut pthread_rwlock_t , __abstime : * const timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_rwlock_wrlock" ] pub fn pthread_rwlock_wrlock ( __rwlock : * mut pthread_rwlock_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z24pthread_rwlock_trywrlock" ] pub fn pthread_rwlock_trywrlock ( __rwlock : * mut pthread_rwlock_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z26pthread_rwlock_timedwrlock" ] pub fn pthread_rwlock_timedwrlock ( __rwlock : * mut pthread_rwlock_t , __abstime : * const timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_rwlock_unlock" ] pub fn pthread_rwlock_unlock ( __rwlock : * mut pthread_rwlock_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z23pthread_rwlockattr_init" ] pub fn pthread_rwlockattr_init ( __attr : * mut pthread_rwlockattr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z26pthread_rwlockattr_destroy" ] pub fn pthread_rwlockattr_destroy ( __attr : * mut pthread_rwlockattr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z29pthread_rwlockattr_getpshared" ] pub fn pthread_rwlockattr_getpshared ( __attr : * const pthread_rwlockattr_t , __pshared : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z29pthread_rwlockattr_setpshared" ] pub fn pthread_rwlockattr_setpshared ( __attr : * mut pthread_rwlockattr_t , __pshared : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z29pthread_rwlockattr_getkind_np" ] pub fn pthread_rwlockattr_getkind_np ( __attr : * const pthread_rwlockattr_t , __pref : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z29pthread_rwlockattr_setkind_np" ] pub fn pthread_rwlockattr_setkind_np ( __attr : * mut pthread_rwlockattr_t , __pref : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z17pthread_cond_init" ] pub fn pthread_cond_init ( __cond : * mut pthread_cond_t , __cond_attr : * const pthread_condattr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z20pthread_cond_destroy" ] pub fn pthread_cond_destroy ( __cond : * mut pthread_cond_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z19pthread_cond_signal" ] pub fn pthread_cond_signal ( __cond : * mut pthread_cond_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z22pthread_cond_broadcast" ] pub fn pthread_cond_broadcast ( __cond : * mut pthread_cond_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z17pthread_cond_wait" ] pub fn pthread_cond_wait ( __cond : * mut pthread_cond_t , __mutex : * mut pthread_mutex_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z22pthread_cond_timedwait" ] pub fn pthread_cond_timedwait ( __cond : * mut pthread_cond_t , __mutex : * mut pthread_mutex_t , __abstime : * const timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_condattr_init" ] pub fn pthread_condattr_init ( __attr : * mut pthread_condattr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z24pthread_condattr_destroy" ] pub fn pthread_condattr_destroy ( __attr : * mut pthread_condattr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z27pthread_condattr_getpshared" ] pub fn pthread_condattr_getpshared ( __attr : * const pthread_condattr_t , __pshared : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z27pthread_condattr_setpshared" ] pub fn pthread_condattr_setpshared ( __attr : * mut pthread_condattr_t , __pshared : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z25pthread_condattr_getclock" ] pub fn pthread_condattr_getclock ( __attr : * const pthread_condattr_t , __clock_id : * mut __clockid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z25pthread_condattr_setclock" ] pub fn pthread_condattr_setclock ( __attr : * mut pthread_condattr_t , __clock_id : __clockid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z17pthread_spin_init" ] pub fn pthread_spin_init ( __lock : * mut pthread_spinlock_t , __pshared : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z20pthread_spin_destroy" ] pub fn pthread_spin_destroy ( __lock : * mut pthread_spinlock_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z17pthread_spin_lock" ] pub fn pthread_spin_lock ( __lock : * mut pthread_spinlock_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z20pthread_spin_trylock" ] pub fn pthread_spin_trylock ( __lock : * mut pthread_spinlock_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z19pthread_spin_unlock" ] pub fn pthread_spin_unlock ( __lock : * mut pthread_spinlock_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z20pthread_barrier_init" ] pub fn pthread_barrier_init ( __barrier : * mut pthread_barrier_t , __attr : * const pthread_barrierattr_t , __count : :: std :: os :: raw :: c_uint ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z23pthread_barrier_destroy" ] pub fn pthread_barrier_destroy ( __barrier : * mut pthread_barrier_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z20pthread_barrier_wait" ] pub fn pthread_barrier_wait ( __barrier : * mut pthread_barrier_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z24pthread_barrierattr_init" ] pub fn pthread_barrierattr_init ( __attr : * mut pthread_barrierattr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z27pthread_barrierattr_destroy" ] pub fn pthread_barrierattr_destroy ( __attr : * mut pthread_barrierattr_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z30pthread_barrierattr_getpshared" ] pub fn pthread_barrierattr_getpshared ( __attr : * const pthread_barrierattr_t , __pshared : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z30pthread_barrierattr_setpshared" ] pub fn pthread_barrierattr_setpshared ( __attr : * mut pthread_barrierattr_t , __pshared : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z18pthread_key_create" ] pub fn pthread_key_create ( __key : * mut pthread_key_t , __destr_function : :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * mut :: std :: os :: raw :: c_void ) > ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z18pthread_key_delete" ] pub fn pthread_key_delete ( __key : pthread_key_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z19pthread_getspecific" ] pub fn pthread_getspecific ( __key : pthread_key_t ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z19pthread_setspecific" ] pub fn pthread_setspecific ( __key : pthread_key_t , __pointer : * const :: std :: os :: raw :: c_void ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z21pthread_getcpuclockid" ] pub fn pthread_getcpuclockid ( __thread_id : pthread_t , __clock_id : * mut __clockid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z14pthread_atfork" ] pub fn pthread_atfork ( __prepare : :: std :: option :: Option < unsafe extern "C" fn ( ) > , __parent : :: std :: option :: Option < unsafe extern "C" fn ( ) > , __child : :: std :: option :: Option < unsafe extern "C" fn ( ) > ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union sem_t { pub __size : [ :: std :: os :: raw :: c_char ; 32usize ] , pub __align : :: std :: os :: raw :: c_long , _bindgen_union_align : [ u64 ; 4usize ] , } # [ test ] fn bindgen_test_layout_sem_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sem_t > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( sem_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sem_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sem_t ) ) ) ; } impl Default for sem_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z8sem_init" ] pub fn sem_init ( __sem : * mut sem_t , __pshared : :: std :: os :: raw :: c_int , __value : :: std :: os :: raw :: c_uint ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11sem_destroy" ] pub fn sem_destroy ( __sem : * mut sem_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8sem_open" ] pub fn sem_open ( __name : * const :: std :: os :: raw :: c_char , __oflag : :: std :: os :: raw :: c_int , ... ) -> * mut sem_t ; } extern "C" { # [ link_name = "\u{1}_Z9sem_close" ] pub fn sem_close ( __sem : * mut sem_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10sem_unlink" ] pub fn sem_unlink ( __name : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8sem_wait" ] pub fn sem_wait ( __sem : * mut sem_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13sem_timedwait" ] pub fn sem_timedwait ( __sem : * mut sem_t , __abstime : * const timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11sem_trywait" ] pub fn sem_trywait ( __sem : * mut sem_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8sem_post" ] pub fn sem_post ( __sem : * mut sem_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12sem_getvalue" ] pub fn sem_getvalue ( __sem : * mut sem_t , __sval : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13__sigismember" ] pub fn __sigismember ( arg1 : * const __sigset_t , arg2 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11__sigaddset" ] pub fn __sigaddset ( arg1 : * mut __sigset_t , arg2 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11__sigdelset" ] pub fn __sigdelset ( arg1 : * mut __sigset_t , arg2 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } pub type sig_atomic_t = __sig_atomic_t ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union sigval { pub sival_int : :: std :: os :: raw :: c_int , pub sival_ptr : * mut :: std :: os :: raw :: c_void , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_sigval ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sigval > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( sigval ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sigval > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sigval ) ) ) ; } impl Default for sigval { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub type sigval_t = sigval ; pub type __sigchld_clock_t = __clock_t ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct siginfo_t { pub si_signo : :: std :: os :: raw :: c_int , pub si_errno : :: std :: os :: raw :: c_int , pub si_code : :: std :: os :: raw :: c_int , pub _sifields : siginfo_t__bindgen_ty_1 , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union siginfo_t__bindgen_ty_1 { pub _pad : [ :: std :: os :: raw :: c_int ; 28usize ] , pub _kill : siginfo_t__bindgen_ty_1__bindgen_ty_1 , pub _timer : siginfo_t__bindgen_ty_1__bindgen_ty_2 , pub _rt : siginfo_t__bindgen_ty_1__bindgen_ty_3 , pub _sigchld : siginfo_t__bindgen_ty_1__bindgen_ty_4 , pub _sigfault : siginfo_t__bindgen_ty_1__bindgen_ty_5 , pub _sigpoll : siginfo_t__bindgen_ty_1__bindgen_ty_6 , pub _sigsys : siginfo_t__bindgen_ty_1__bindgen_ty_7 , _bindgen_union_align : [ u64 ; 14usize ] , } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct siginfo_t__bindgen_ty_1__bindgen_ty_1 { pub si_pid : __pid_t , pub si_uid : __uid_t , } # [ test ] fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_1 ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct siginfo_t__bindgen_ty_1__bindgen_ty_2 { pub si_tid : :: std :: os :: raw :: c_int , pub si_overrun : :: std :: os :: raw :: c_int , pub si_sigval : sigval_t , } # [ test ] fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_2 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_2 > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_2 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_2 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_2 ) ) ) ; } impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_2 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct siginfo_t__bindgen_ty_1__bindgen_ty_3 { pub si_pid : __pid_t , pub si_uid : __uid_t , pub si_sigval : sigval_t , } # [ test ] fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_3 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_3 > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_3 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_3 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_3 ) ) ) ; } impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_3 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct siginfo_t__bindgen_ty_1__bindgen_ty_4 { pub si_pid : __pid_t , pub si_uid : __uid_t , pub si_status : :: std :: os :: raw :: c_int , pub si_utime : __sigchld_clock_t , pub si_stime : __sigchld_clock_t , } # [ test ] fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_4 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_4 > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_4 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_4 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_4 ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct siginfo_t__bindgen_ty_1__bindgen_ty_5 { pub si_addr : * mut :: std :: os :: raw :: c_void , } # [ test ] fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_5 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_5 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_5 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_5 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_5 ) ) ) ; } impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_5 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct siginfo_t__bindgen_ty_1__bindgen_ty_6 { pub si_band : :: std :: os :: raw :: c_long , pub si_fd : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_6 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_6 > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_6 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_6 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_6 ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct siginfo_t__bindgen_ty_1__bindgen_ty_7 { pub _call_addr : * mut :: std :: os :: raw :: c_void , pub _syscall : :: std :: os :: raw :: c_int , pub _arch : :: std :: os :: raw :: c_uint , } # [ test ] fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_7 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_7 > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_7 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < siginfo_t__bindgen_ty_1__bindgen_ty_7 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1__bindgen_ty_7 ) ) ) ; } impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_7 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_siginfo_t__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < siginfo_t__bindgen_ty_1 > ( ) , 112usize , concat ! ( "Size of: " , stringify ! ( siginfo_t__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < siginfo_t__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( siginfo_t__bindgen_ty_1 ) ) ) ; } impl Default for siginfo_t__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_siginfo_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < siginfo_t > ( ) , 128usize , concat ! ( "Size of: " , stringify ! ( siginfo_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < siginfo_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( siginfo_t ) ) ) ; } impl Default for siginfo_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub const SI_ASYNCNL : _bindgen_ty_19 = -60 ; pub const SI_TKILL : _bindgen_ty_19 = -6 ; pub const SI_SIGIO : _bindgen_ty_19 = -5 ; pub const SI_ASYNCIO : _bindgen_ty_19 = -4 ; pub const SI_MESGQ : _bindgen_ty_19 = -3 ; pub const SI_TIMER : _bindgen_ty_19 = -2 ; pub const SI_QUEUE : _bindgen_ty_19 = -1 ; pub const SI_USER : _bindgen_ty_19 = 0 ; pub const SI_KERNEL : _bindgen_ty_19 = 128 ; pub type _bindgen_ty_19 = i32 ; pub const ILL_ILLOPC : _bindgen_ty_20 = 1 ; pub const ILL_ILLOPN : _bindgen_ty_20 = 2 ; pub const ILL_ILLADR : _bindgen_ty_20 = 3 ; pub const ILL_ILLTRP : _bindgen_ty_20 = 4 ; pub const ILL_PRVOPC : _bindgen_ty_20 = 5 ; pub const ILL_PRVREG : _bindgen_ty_20 = 6 ; pub const ILL_COPROC : _bindgen_ty_20 = 7 ; pub const ILL_BADSTK : _bindgen_ty_20 = 8 ; pub type _bindgen_ty_20 = u32 ; pub const FPE_INTDIV : _bindgen_ty_21 = 1 ; pub const FPE_INTOVF : _bindgen_ty_21 = 2 ; pub const FPE_FLTDIV : _bindgen_ty_21 = 3 ; pub const FPE_FLTOVF : _bindgen_ty_21 = 4 ; pub const FPE_FLTUND : _bindgen_ty_21 = 5 ; pub const FPE_FLTRES : _bindgen_ty_21 = 6 ; pub const FPE_FLTINV : _bindgen_ty_21 = 7 ; pub const FPE_FLTSUB : _bindgen_ty_21 = 8 ; pub type _bindgen_ty_21 = u32 ; pub const SEGV_MAPERR : _bindgen_ty_22 = 1 ; pub const SEGV_ACCERR : _bindgen_ty_22 = 2 ; pub type _bindgen_ty_22 = u32 ; pub const BUS_ADRALN : _bindgen_ty_23 = 1 ; pub const BUS_ADRERR : _bindgen_ty_23 = 2 ; pub const BUS_OBJERR : _bindgen_ty_23 = 3 ; pub type _bindgen_ty_23 = u32 ; pub const TRAP_BRKPT : _bindgen_ty_24 = 1 ; pub const TRAP_TRACE : _bindgen_ty_24 = 2 ; pub type _bindgen_ty_24 = u32 ; pub const CLD_EXITED : _bindgen_ty_25 = 1 ; pub const CLD_KILLED : _bindgen_ty_25 = 2 ; pub const CLD_DUMPED : _bindgen_ty_25 = 3 ; pub const CLD_TRAPPED : _bindgen_ty_25 = 4 ; pub const CLD_STOPPED : _bindgen_ty_25 = 5 ; pub const CLD_CONTINUED : _bindgen_ty_25 = 6 ; pub type _bindgen_ty_25 = u32 ; pub const POLL_IN : _bindgen_ty_26 = 1 ; pub const POLL_OUT : _bindgen_ty_26 = 2 ; pub const POLL_MSG : _bindgen_ty_26 = 3 ; pub const POLL_ERR : _bindgen_ty_26 = 4 ; pub const POLL_PRI : _bindgen_ty_26 = 5 ; pub const POLL_HUP : _bindgen_ty_26 = 6 ; pub type _bindgen_ty_26 = u32 ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct sigevent { pub sigev_value : sigval_t , pub sigev_signo : :: std :: os :: raw :: c_int , pub sigev_notify : :: std :: os :: raw :: c_int , pub _sigev_un : sigevent__bindgen_ty_1 , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union sigevent__bindgen_ty_1 { pub _pad : [ :: std :: os :: raw :: c_int ; 12usize ] , pub _tid : __pid_t , pub _sigev_thread : sigevent__bindgen_ty_1__bindgen_ty_1 , _bindgen_union_align : [ u64 ; 6usize ] , } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct sigevent__bindgen_ty_1__bindgen_ty_1 { pub _function : :: std :: option :: Option < unsafe extern "C" fn ( arg1 : sigval_t ) > , pub _attribute : * mut pthread_attr_t , } # [ test ] fn bindgen_test_layout_sigevent__bindgen_ty_1__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sigevent__bindgen_ty_1__bindgen_ty_1 > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( sigevent__bindgen_ty_1__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sigevent__bindgen_ty_1__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sigevent__bindgen_ty_1__bindgen_ty_1 ) ) ) ; } impl Default for sigevent__bindgen_ty_1__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_sigevent__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sigevent__bindgen_ty_1 > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( sigevent__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sigevent__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sigevent__bindgen_ty_1 ) ) ) ; } impl Default for sigevent__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_sigevent ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sigevent > ( ) , 64usize , concat ! ( "Size of: " , stringify ! ( sigevent ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sigevent > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sigevent ) ) ) ; } impl Default for sigevent { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub type sigevent_t = sigevent ; pub const SIGEV_SIGNAL : _bindgen_ty_27 = 0 ; pub const SIGEV_NONE : _bindgen_ty_27 = 1 ; pub const SIGEV_THREAD : _bindgen_ty_27 = 2 ; pub const SIGEV_THREAD_ID : _bindgen_ty_27 = 4 ; pub type _bindgen_ty_27 = u32 ; pub type __sighandler_t = :: std :: option :: Option < unsafe extern "C" fn ( arg1 : :: std :: os :: raw :: c_int ) > ; extern "C" { # [ link_name = "\u{1}_Z13__sysv_signal" ] pub fn __sysv_signal ( __sig : :: std :: os :: raw :: c_int , __handler : __sighandler_t ) -> __sighandler_t ; } extern "C" { # [ link_name = "\u{1}_Z6signal" ] pub fn signal ( __sig : :: std :: os :: raw :: c_int , __handler : __sighandler_t ) -> __sighandler_t ; } extern "C" { # [ link_name = "\u{1}_Z4kill" ] pub fn kill ( __pid : __pid_t , __sig : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6killpg" ] pub fn killpg ( __pgrp : __pid_t , __sig : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5raise" ] pub fn raise ( __sig : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7ssignal" ] pub fn ssignal ( __sig : :: std :: os :: raw :: c_int , __handler : __sighandler_t ) -> __sighandler_t ; } extern "C" { # [ link_name = "\u{1}_Z7gsignal" ] pub fn gsignal ( __sig : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7psignal" ] pub fn psignal ( __sig : :: std :: os :: raw :: c_int , __s : * const :: std :: os :: raw :: c_char ) ; } extern "C" { # [ link_name = "\u{1}_Z8psiginfo" ] pub fn psiginfo ( __pinfo : * const siginfo_t , __s : * const :: std :: os :: raw :: c_char ) ; } extern "C" { # [ link_name = "\u{1}_Z10__sigpause" ] pub fn __sigpause ( __sig_or_mask : :: std :: os :: raw :: c_int , __is_sig : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8sigblock" ] pub fn sigblock ( __mask : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10sigsetmask" ] pub fn sigsetmask ( __mask : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10siggetmask" ] pub fn siggetmask ( ) -> :: std :: os :: raw :: c_int ; } pub type sig_t = __sighandler_t ; extern "C" { # [ link_name = "\u{1}_Z11sigemptyset" ] pub fn sigemptyset ( __set : * mut sigset_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10sigfillset" ] pub fn sigfillset ( __set : * mut sigset_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9sigaddset" ] pub fn sigaddset ( __set : * mut sigset_t , __signo : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9sigdelset" ] pub fn sigdelset ( __set : * mut sigset_t , __signo : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11sigismember" ] pub fn sigismember ( __set : * const sigset_t , __signo : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct sigaction { pub __sigaction_handler : sigaction__bindgen_ty_1 , pub sa_mask : __sigset_t , pub sa_flags : :: std :: os :: raw :: c_int , pub sa_restorer : :: std :: option :: Option < unsafe extern "C" fn ( ) > , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union sigaction__bindgen_ty_1 { pub sa_handler : __sighandler_t , pub sa_sigaction : :: std :: option :: Option < unsafe extern "C" fn ( arg1 : :: std :: os :: raw :: c_int , arg2 : * mut siginfo_t , arg3 : * mut :: std :: os :: raw :: c_void ) > , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_sigaction__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sigaction__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( sigaction__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sigaction__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sigaction__bindgen_ty_1 ) ) ) ; } impl Default for sigaction__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_sigaction ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sigaction > ( ) , 152usize , concat ! ( "Size of: " , stringify ! ( sigaction ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sigaction > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sigaction ) ) ) ; } impl Default for sigaction { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z11sigprocmask" ] pub fn sigprocmask ( __how : :: std :: os :: raw :: c_int , __set : * const sigset_t , __oset : * mut sigset_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10sigsuspend" ] pub fn sigsuspend ( __set : * const sigset_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9sigaction" ] pub fn sigaction ( __sig : :: std :: os :: raw :: c_int , __act : * const sigaction , __oact : * mut sigaction ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10sigpending" ] pub fn sigpending ( __set : * mut sigset_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7sigwait" ] pub fn sigwait ( __set : * const sigset_t , __sig : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11sigwaitinfo" ] pub fn sigwaitinfo ( __set : * const sigset_t , __info : * mut siginfo_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12sigtimedwait" ] pub fn sigtimedwait ( __set : * const sigset_t , __info : * mut siginfo_t , __timeout : * const timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8sigqueue" ] pub fn sigqueue ( __pid : __pid_t , __sig : :: std :: os :: raw :: c_int , __val : sigval ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct sigvec { pub sv_handler : __sighandler_t , pub sv_mask : :: std :: os :: raw :: c_int , pub sv_flags : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout_sigvec ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sigvec > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( sigvec ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sigvec > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sigvec ) ) ) ; } impl Default for sigvec { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z6sigvec" ] pub fn sigvec ( __sig : :: std :: os :: raw :: c_int , __vec : * const sigvec , __ovec : * mut sigvec ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct _fpx_sw_bytes { pub magic1 : __uint32_t , pub extended_size : __uint32_t , pub xstate_bv : __uint64_t , pub xstate_size : __uint32_t , pub padding : [ __uint32_t ; 7usize ] , } # [ test ] fn bindgen_test_layout__fpx_sw_bytes ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _fpx_sw_bytes > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( _fpx_sw_bytes ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _fpx_sw_bytes > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _fpx_sw_bytes ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct _fpreg { pub significand : [ :: std :: os :: raw :: c_ushort ; 4usize ] , pub exponent : :: std :: os :: raw :: c_ushort , } # [ test ] fn bindgen_test_layout__fpreg ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _fpreg > ( ) , 10usize , concat ! ( "Size of: " , stringify ! ( _fpreg ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _fpreg > ( ) , 2usize , concat ! ( "Alignment of " , stringify ! ( _fpreg ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct _fpxreg { pub significand : [ :: std :: os :: raw :: c_ushort ; 4usize ] , pub exponent : :: std :: os :: raw :: c_ushort , pub padding : [ :: std :: os :: raw :: c_ushort ; 3usize ] , } # [ test ] fn bindgen_test_layout__fpxreg ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _fpxreg > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( _fpxreg ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _fpxreg > ( ) , 2usize , concat ! ( "Alignment of " , stringify ! ( _fpxreg ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct _xmmreg { pub element : [ __uint32_t ; 4usize ] , } # [ test ] fn bindgen_test_layout__xmmreg ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _xmmreg > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( _xmmreg ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _xmmreg > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( _xmmreg ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct _fpstate { pub cwd : __uint16_t , pub swd : __uint16_t , pub ftw : __uint16_t , pub fop : __uint16_t , pub rip : __uint64_t , pub rdp : __uint64_t , pub mxcsr : __uint32_t , pub mxcr_mask : __uint32_t , pub _st : [ _fpxreg ; 8usize ] , pub _xmm : [ _xmmreg ; 16usize ] , pub padding : [ __uint32_t ; 24usize ] , } # [ test ] fn bindgen_test_layout__fpstate ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _fpstate > ( ) , 512usize , concat ! ( "Size of: " , stringify ! ( _fpstate ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _fpstate > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _fpstate ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct sigcontext { pub r8 : __uint64_t , pub r9 : __uint64_t , pub r10 : __uint64_t , pub r11 : __uint64_t , pub r12 : __uint64_t , pub r13 : __uint64_t , pub r14 : __uint64_t , pub r15 : __uint64_t , pub rdi : __uint64_t , pub rsi : __uint64_t , pub rbp : __uint64_t , pub rbx : __uint64_t , pub rdx : __uint64_t , pub rax : __uint64_t , pub rcx : __uint64_t , pub rsp : __uint64_t , pub rip : __uint64_t , pub eflags : __uint64_t , pub cs : :: std :: os :: raw :: c_ushort , pub gs : :: std :: os :: raw :: c_ushort , pub fs : :: std :: os :: raw :: c_ushort , pub __pad0 : :: std :: os :: raw :: c_ushort , pub err : __uint64_t , pub trapno : __uint64_t , pub oldmask : __uint64_t , pub cr2 : __uint64_t , pub __bindgen_anon_1 : sigcontext__bindgen_ty_1 , pub __reserved1 : [ __uint64_t ; 8usize ] , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union sigcontext__bindgen_ty_1 { pub fpstate : * mut _fpstate , pub __fpstate_word : __uint64_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_sigcontext__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sigcontext__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( sigcontext__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sigcontext__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sigcontext__bindgen_ty_1 ) ) ) ; } impl Default for sigcontext__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_sigcontext ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sigcontext > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( sigcontext ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sigcontext > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sigcontext ) ) ) ; } impl Default for sigcontext { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct _xsave_hdr { pub xstate_bv : __uint64_t , pub reserved1 : [ __uint64_t ; 2usize ] , pub reserved2 : [ __uint64_t ; 5usize ] , } # [ test ] fn bindgen_test_layout__xsave_hdr ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _xsave_hdr > ( ) , 64usize , concat ! ( "Size of: " , stringify ! ( _xsave_hdr ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _xsave_hdr > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _xsave_hdr ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct _ymmh_state { pub ymmh_space : [ __uint32_t ; 64usize ] , } # [ test ] fn bindgen_test_layout__ymmh_state ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _ymmh_state > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( _ymmh_state ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _ymmh_state > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( _ymmh_state ) ) ) ; } impl Default for _ymmh_state { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct _xstate { pub fpstate : _fpstate , pub xstate_hdr : _xsave_hdr , pub ymmh : _ymmh_state , } # [ test ] fn bindgen_test_layout__xstate ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _xstate > ( ) , 832usize , concat ! ( "Size of: " , stringify ! ( _xstate ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _xstate > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _xstate ) ) ) ; } impl Default for _xstate { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z9sigreturn" ] pub fn sigreturn ( __scp : * mut sigcontext ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12siginterrupt" ] pub fn siginterrupt ( __sig : :: std :: os :: raw :: c_int , __interrupt : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct sigstack { pub ss_sp : * mut :: std :: os :: raw :: c_void , pub ss_onstack : :: std :: os :: raw :: c_int , } # [ test ] fn bindgen_test_layout_sigstack ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sigstack > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( sigstack ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sigstack > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sigstack ) ) ) ; } impl Default for sigstack { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub const SS_ONSTACK : _bindgen_ty_28 = 1 ; pub const SS_DISABLE : _bindgen_ty_28 = 2 ; pub type _bindgen_ty_28 = u32 ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct sigaltstack { pub ss_sp : * mut :: std :: os :: raw :: c_void , pub ss_flags : :: std :: os :: raw :: c_int , pub ss_size : usize , } # [ test ] fn bindgen_test_layout_sigaltstack ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sigaltstack > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( sigaltstack ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sigaltstack > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( sigaltstack ) ) ) ; } impl Default for sigaltstack { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub type stack_t = sigaltstack ; pub type greg_t = :: std :: os :: raw :: c_longlong ; pub type gregset_t = [ greg_t ; 23usize ] ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct _libc_fpxreg { pub significand : [ :: std :: os :: raw :: c_ushort ; 4usize ] , pub exponent : :: std :: os :: raw :: c_ushort , pub padding : [ :: std :: os :: raw :: c_ushort ; 3usize ] , } # [ test ] fn bindgen_test_layout__libc_fpxreg ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _libc_fpxreg > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( _libc_fpxreg ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _libc_fpxreg > ( ) , 2usize , concat ! ( "Alignment of " , stringify ! ( _libc_fpxreg ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct _libc_xmmreg { pub element : [ __uint32_t ; 4usize ] , } # [ test ] fn bindgen_test_layout__libc_xmmreg ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _libc_xmmreg > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( _libc_xmmreg ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _libc_xmmreg > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( _libc_xmmreg ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct _libc_fpstate { pub cwd : __uint16_t , pub swd : __uint16_t , pub ftw : __uint16_t , pub fop : __uint16_t , pub rip : __uint64_t , pub rdp : __uint64_t , pub mxcsr : __uint32_t , pub mxcr_mask : __uint32_t , pub _st : [ _libc_fpxreg ; 8usize ] , pub _xmm : [ _libc_xmmreg ; 16usize ] , pub padding : [ __uint32_t ; 24usize ] , } # [ test ] fn bindgen_test_layout__libc_fpstate ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _libc_fpstate > ( ) , 512usize , concat ! ( "Size of: " , stringify ! ( _libc_fpstate ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _libc_fpstate > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _libc_fpstate ) ) ) ; } pub type fpregset_t = * mut _libc_fpstate ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct mcontext_t { pub gregs : gregset_t , pub fpregs : fpregset_t , pub __reserved1 : [ :: std :: os :: raw :: c_ulonglong ; 8usize ] , } # [ test ] fn bindgen_test_layout_mcontext_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < mcontext_t > ( ) , 256usize , concat ! ( "Size of: " , stringify ! ( mcontext_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < mcontext_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( mcontext_t ) ) ) ; } impl Default for mcontext_t { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct ucontext { pub uc_flags : :: std :: os :: raw :: c_ulong , pub uc_link : * mut ucontext , pub uc_stack : stack_t , pub uc_mcontext : mcontext_t , pub uc_sigmask : __sigset_t , pub __fpregs_mem : _libc_fpstate , } # [ test ] fn bindgen_test_layout_ucontext ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ucontext > ( ) , 936usize , concat ! ( "Size of: " , stringify ! ( ucontext ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ucontext > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ucontext ) ) ) ; } impl Default for ucontext { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub type ucontext_t = ucontext ; extern "C" { # [ link_name = "\u{1}_Z8sigstack" ] pub fn sigstack ( __ss : * mut sigstack , __oss : * mut sigstack ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11sigaltstack" ] pub fn sigaltstack ( __ss : * const sigaltstack , __oss : * mut sigaltstack ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z15pthread_sigmask" ] pub fn pthread_sigmask ( __how : :: std :: os :: raw :: c_int , __newmask : * const __sigset_t , __oldmask : * mut __sigset_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12pthread_kill" ] pub fn pthread_kill ( __threadid : pthread_t , __signo : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z23__libc_current_sigrtmin" ] pub fn __libc_current_sigrtmin ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z23__libc_current_sigrtmax" ] pub fn __libc_current_sigrtmax ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8closelog" ] pub fn closelog ( ) ; } extern "C" { # [ link_name = "\u{1}_Z7openlog" ] pub fn openlog ( __ident : * const :: std :: os :: raw :: c_char , __option : :: std :: os :: raw :: c_int , __facility : :: std :: os :: raw :: c_int ) ; } extern "C" { # [ link_name = "\u{1}_Z10setlogmask" ] pub fn setlogmask ( __mask : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6syslog" ] pub fn syslog ( __pri : :: std :: os :: raw :: c_int , __fmt : * const :: std :: os :: raw :: c_char , ... ) ; } extern "C" { # [ link_name = "\u{1}_Z7vsyslog" ] pub fn vsyslog ( __pri : :: std :: os :: raw :: c_int , __fmt : * const :: std :: os :: raw :: c_char , __ap : * mut __va_list_tag ) ; } pub type cc_t = :: std :: os :: raw :: c_uchar ; pub type speed_t = :: std :: os :: raw :: c_uint ; pub type tcflag_t = :: std :: os :: raw :: c_uint ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct termios { pub c_iflag : tcflag_t , pub c_oflag : tcflag_t , pub c_cflag : tcflag_t , pub c_lflag : tcflag_t , pub c_line : cc_t , pub c_cc : [ cc_t ; 32usize ] , pub c_ispeed : speed_t , pub c_ospeed : speed_t , } # [ test ] fn bindgen_test_layout_termios ( ) { assert_eq ! ( :: std :: mem :: size_of :: < termios > ( ) , 60usize , concat ! ( "Size of: " , stringify ! ( termios ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < termios > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( termios ) ) ) ; } extern "C" { # [ link_name = "\u{1}_Z11cfgetospeed" ] pub fn cfgetospeed ( __termios_p : * const termios ) -> speed_t ; } extern "C" { # [ link_name = "\u{1}_Z11cfgetispeed" ] pub fn cfgetispeed ( __termios_p : * const termios ) -> speed_t ; } extern "C" { # [ link_name = "\u{1}_Z11cfsetospeed" ] pub fn cfsetospeed ( __termios_p : * mut termios , __speed : speed_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11cfsetispeed" ] pub fn cfsetispeed ( __termios_p : * mut termios , __speed : speed_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10cfsetspeed" ] pub fn cfsetspeed ( __termios_p : * mut termios , __speed : speed_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9tcgetattr" ] pub fn tcgetattr ( __fd : :: std :: os :: raw :: c_int , __termios_p : * mut termios ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9tcsetattr" ] pub fn tcsetattr ( __fd : :: std :: os :: raw :: c_int , __optional_actions : :: std :: os :: raw :: c_int , __termios_p : * const termios ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9cfmakeraw" ] pub fn cfmakeraw ( __termios_p : * mut termios ) ; } extern "C" { # [ link_name = "\u{1}_Z11tcsendbreak" ] pub fn tcsendbreak ( __fd : :: std :: os :: raw :: c_int , __duration : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7tcdrain" ] pub fn tcdrain ( __fd : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7tcflush" ] pub fn tcflush ( __fd : :: std :: os :: raw :: c_int , __queue_selector : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6tcflow" ] pub fn tcflow ( __fd : :: std :: os :: raw :: c_int , __action : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8tcgetsid" ] pub fn tcgetsid ( __fd : :: std :: os :: raw :: c_int ) -> __pid_t ; } pub type useconds_t = __useconds_t ; extern "C" { # [ link_name = "\u{1}_Z6access" ] pub fn access ( __name : * const :: std :: os :: raw :: c_char , __type : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9faccessat" ] pub fn faccessat ( __fd : :: std :: os :: raw :: c_int , __file : * const :: std :: os :: raw :: c_char , __type : :: std :: os :: raw :: c_int , __flag : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5lseek" ] pub fn lseek ( __fd : :: std :: os :: raw :: c_int , __offset : __off_t , __whence : :: std :: os :: raw :: c_int ) -> __off_t ; } extern "C" { # [ link_name = "\u{1}_Z5close" ] pub fn close ( __fd : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4read" ] pub fn read ( __fd : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_void , __nbytes : usize ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z5write" ] pub fn write ( __fd : :: std :: os :: raw :: c_int , __buf : * const :: std :: os :: raw :: c_void , __n : usize ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z5pread" ] pub fn pread ( __fd : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_void , __nbytes : usize , __offset : __off_t ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z6pwrite" ] pub fn pwrite ( __fd : :: std :: os :: raw :: c_int , __buf : * const :: std :: os :: raw :: c_void , __n : usize , __offset : __off_t ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z4pipe" ] pub fn pipe ( __pipedes : * mut :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5alarm" ] pub fn alarm ( __seconds : :: std :: os :: raw :: c_uint ) -> :: std :: os :: raw :: c_uint ; } extern "C" { # [ link_name = "\u{1}_Z5sleep" ] pub fn sleep ( __seconds : :: std :: os :: raw :: c_uint ) -> :: std :: os :: raw :: c_uint ; } extern "C" { # [ link_name = "\u{1}_Z6ualarm" ] pub fn ualarm ( __value : __useconds_t , __interval : __useconds_t ) -> __useconds_t ; } extern "C" { # [ link_name = "\u{1}_Z6usleep" ] pub fn usleep ( __useconds : __useconds_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5pause" ] pub fn pause ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5chown" ] pub fn chown ( __file : * const :: std :: os :: raw :: c_char , __owner : __uid_t , __group : __gid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6fchown" ] pub fn fchown ( __fd : :: std :: os :: raw :: c_int , __owner : __uid_t , __group : __gid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6lchown" ] pub fn lchown ( __file : * const :: std :: os :: raw :: c_char , __owner : __uid_t , __group : __gid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8fchownat" ] pub fn fchownat ( __fd : :: std :: os :: raw :: c_int , __file : * const :: std :: os :: raw :: c_char , __owner : __uid_t , __group : __gid_t , __flag : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5chdir" ] pub fn chdir ( __path : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6fchdir" ] pub fn fchdir ( __fd : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6getcwd" ] pub fn getcwd ( __buf : * mut :: std :: os :: raw :: c_char , __size : usize ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z5getwd" ] pub fn getwd ( __buf : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z3dup" ] pub fn dup ( __fd : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4dup2" ] pub fn dup2 ( __fd : :: std :: os :: raw :: c_int , __fd2 : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6execve" ] pub fn execve ( __path : * const :: std :: os :: raw :: c_char , __argv : * const * mut :: std :: os :: raw :: c_char , __envp : * const * mut :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7fexecve" ] pub fn fexecve ( __fd : :: std :: os :: raw :: c_int , __argv : * const * mut :: std :: os :: raw :: c_char , __envp : * const * mut :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5execv" ] pub fn execv ( __path : * const :: std :: os :: raw :: c_char , __argv : * const * mut :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6execle" ] pub fn execle ( __path : * const :: std :: os :: raw :: c_char , __arg : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5execl" ] pub fn execl ( __path : * const :: std :: os :: raw :: c_char , __arg : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6execvp" ] pub fn execvp ( __file : * const :: std :: os :: raw :: c_char , __argv : * const * mut :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6execlp" ] pub fn execlp ( __file : * const :: std :: os :: raw :: c_char , __arg : * const :: std :: os :: raw :: c_char , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4nice" ] pub fn nice ( __inc : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5_exit" ] pub fn _exit ( __status : :: std :: os :: raw :: c_int ) ; } pub const _PC_LINK_MAX : _bindgen_ty_29 = 0 ; pub const _PC_MAX_CANON : _bindgen_ty_29 = 1 ; pub const _PC_MAX_INPUT : _bindgen_ty_29 = 2 ; pub const _PC_NAME_MAX : _bindgen_ty_29 = 3 ; pub const _PC_PATH_MAX : _bindgen_ty_29 = 4 ; pub const _PC_PIPE_BUF : _bindgen_ty_29 = 5 ; pub const _PC_CHOWN_RESTRICTED : _bindgen_ty_29 = 6 ; pub const _PC_NO_TRUNC : _bindgen_ty_29 = 7 ; pub const _PC_VDISABLE : _bindgen_ty_29 = 8 ; pub const _PC_SYNC_IO : _bindgen_ty_29 = 9 ; pub const _PC_ASYNC_IO : _bindgen_ty_29 = 10 ; pub const _PC_PRIO_IO : _bindgen_ty_29 = 11 ; pub const _PC_SOCK_MAXBUF : _bindgen_ty_29 = 12 ; pub const _PC_FILESIZEBITS : _bindgen_ty_29 = 13 ; pub const _PC_REC_INCR_XFER_SIZE : _bindgen_ty_29 = 14 ; pub const _PC_REC_MAX_XFER_SIZE : _bindgen_ty_29 = 15 ; pub const _PC_REC_MIN_XFER_SIZE : _bindgen_ty_29 = 16 ; pub const _PC_REC_XFER_ALIGN : _bindgen_ty_29 = 17 ; pub const _PC_ALLOC_SIZE_MIN : _bindgen_ty_29 = 18 ; pub const _PC_SYMLINK_MAX : _bindgen_ty_29 = 19 ; pub const _PC_2_SYMLINKS : _bindgen_ty_29 = 20 ; pub type _bindgen_ty_29 = u32 ; pub const _SC_ARG_MAX : _bindgen_ty_30 = 0 ; pub const _SC_CHILD_MAX : _bindgen_ty_30 = 1 ; pub const _SC_CLK_TCK : _bindgen_ty_30 = 2 ; pub const _SC_NGROUPS_MAX : _bindgen_ty_30 = 3 ; pub const _SC_OPEN_MAX : _bindgen_ty_30 = 4 ; pub const _SC_STREAM_MAX : _bindgen_ty_30 = 5 ; pub const _SC_TZNAME_MAX : _bindgen_ty_30 = 6 ; pub const _SC_JOB_CONTROL : _bindgen_ty_30 = 7 ; pub const _SC_SAVED_IDS : _bindgen_ty_30 = 8 ; pub const _SC_REALTIME_SIGNALS : _bindgen_ty_30 = 9 ; pub const _SC_PRIORITY_SCHEDULING : _bindgen_ty_30 = 10 ; pub const _SC_TIMERS : _bindgen_ty_30 = 11 ; pub const _SC_ASYNCHRONOUS_IO : _bindgen_ty_30 = 12 ; pub const _SC_PRIORITIZED_IO : _bindgen_ty_30 = 13 ; pub const _SC_SYNCHRONIZED_IO : _bindgen_ty_30 = 14 ; pub const _SC_FSYNC : _bindgen_ty_30 = 15 ; pub const _SC_MAPPED_FILES : _bindgen_ty_30 = 16 ; pub const _SC_MEMLOCK : _bindgen_ty_30 = 17 ; pub const _SC_MEMLOCK_RANGE : _bindgen_ty_30 = 18 ; pub const _SC_MEMORY_PROTECTION : _bindgen_ty_30 = 19 ; pub const _SC_MESSAGE_PASSING : _bindgen_ty_30 = 20 ; pub const _SC_SEMAPHORES : _bindgen_ty_30 = 21 ; pub const _SC_SHARED_MEMORY_OBJECTS : _bindgen_ty_30 = 22 ; pub const _SC_AIO_LISTIO_MAX : _bindgen_ty_30 = 23 ; pub const _SC_AIO_MAX : _bindgen_ty_30 = 24 ; pub const _SC_AIO_PRIO_DELTA_MAX : _bindgen_ty_30 = 25 ; pub const _SC_DELAYTIMER_MAX : _bindgen_ty_30 = 26 ; pub const _SC_MQ_OPEN_MAX : _bindgen_ty_30 = 27 ; pub const _SC_MQ_PRIO_MAX : _bindgen_ty_30 = 28 ; pub const _SC_VERSION : _bindgen_ty_30 = 29 ; pub const _SC_PAGESIZE : _bindgen_ty_30 = 30 ; pub const _SC_RTSIG_MAX : _bindgen_ty_30 = 31 ; pub const _SC_SEM_NSEMS_MAX : _bindgen_ty_30 = 32 ; pub const _SC_SEM_VALUE_MAX : _bindgen_ty_30 = 33 ; pub const _SC_SIGQUEUE_MAX : _bindgen_ty_30 = 34 ; pub const _SC_TIMER_MAX : _bindgen_ty_30 = 35 ; pub const _SC_BC_BASE_MAX : _bindgen_ty_30 = 36 ; pub const _SC_BC_DIM_MAX : _bindgen_ty_30 = 37 ; pub const _SC_BC_SCALE_MAX : _bindgen_ty_30 = 38 ; pub const _SC_BC_STRING_MAX : _bindgen_ty_30 = 39 ; pub const _SC_COLL_WEIGHTS_MAX : _bindgen_ty_30 = 40 ; pub const _SC_EQUIV_CLASS_MAX : _bindgen_ty_30 = 41 ; pub const _SC_EXPR_NEST_MAX : _bindgen_ty_30 = 42 ; pub const _SC_LINE_MAX : _bindgen_ty_30 = 43 ; pub const _SC_RE_DUP_MAX : _bindgen_ty_30 = 44 ; pub const _SC_CHARCLASS_NAME_MAX : _bindgen_ty_30 = 45 ; pub const _SC_2_VERSION : _bindgen_ty_30 = 46 ; pub const _SC_2_C_BIND : _bindgen_ty_30 = 47 ; pub const _SC_2_C_DEV : _bindgen_ty_30 = 48 ; pub const _SC_2_FORT_DEV : _bindgen_ty_30 = 49 ; pub const _SC_2_FORT_RUN : _bindgen_ty_30 = 50 ; pub const _SC_2_SW_DEV : _bindgen_ty_30 = 51 ; pub const _SC_2_LOCALEDEF : _bindgen_ty_30 = 52 ; pub const _SC_PII : _bindgen_ty_30 = 53 ; pub const _SC_PII_XTI : _bindgen_ty_30 = 54 ; pub const _SC_PII_SOCKET : _bindgen_ty_30 = 55 ; pub const _SC_PII_INTERNET : _bindgen_ty_30 = 56 ; pub const _SC_PII_OSI : _bindgen_ty_30 = 57 ; pub const _SC_POLL : _bindgen_ty_30 = 58 ; pub const _SC_SELECT : _bindgen_ty_30 = 59 ; pub const _SC_UIO_MAXIOV : _bindgen_ty_30 = 60 ; pub const _SC_IOV_MAX : _bindgen_ty_30 = 60 ; pub const _SC_PII_INTERNET_STREAM : _bindgen_ty_30 = 61 ; pub const _SC_PII_INTERNET_DGRAM : _bindgen_ty_30 = 62 ; pub const _SC_PII_OSI_COTS : _bindgen_ty_30 = 63 ; pub const _SC_PII_OSI_CLTS : _bindgen_ty_30 = 64 ; pub const _SC_PII_OSI_M : _bindgen_ty_30 = 65 ; pub const _SC_T_IOV_MAX : _bindgen_ty_30 = 66 ; pub const _SC_THREADS : _bindgen_ty_30 = 67 ; pub const _SC_THREAD_SAFE_FUNCTIONS : _bindgen_ty_30 = 68 ; pub const _SC_GETGR_R_SIZE_MAX : _bindgen_ty_30 = 69 ; pub const _SC_GETPW_R_SIZE_MAX : _bindgen_ty_30 = 70 ; pub const _SC_LOGIN_NAME_MAX : _bindgen_ty_30 = 71 ; pub const _SC_TTY_NAME_MAX : _bindgen_ty_30 = 72 ; pub const _SC_THREAD_DESTRUCTOR_ITERATIONS : _bindgen_ty_30 = 73 ; pub const _SC_THREAD_KEYS_MAX : _bindgen_ty_30 = 74 ; pub const _SC_THREAD_STACK_MIN : _bindgen_ty_30 = 75 ; pub const _SC_THREAD_THREADS_MAX : _bindgen_ty_30 = 76 ; pub const _SC_THREAD_ATTR_STACKADDR : _bindgen_ty_30 = 77 ; pub const _SC_THREAD_ATTR_STACKSIZE : _bindgen_ty_30 = 78 ; pub const _SC_THREAD_PRIORITY_SCHEDULING : _bindgen_ty_30 = 79 ; pub const _SC_THREAD_PRIO_INHERIT : _bindgen_ty_30 = 80 ; pub const _SC_THREAD_PRIO_PROTECT : _bindgen_ty_30 = 81 ; pub const _SC_THREAD_PROCESS_SHARED : _bindgen_ty_30 = 82 ; pub const _SC_NPROCESSORS_CONF : _bindgen_ty_30 = 83 ; pub const _SC_NPROCESSORS_ONLN : _bindgen_ty_30 = 84 ; pub const _SC_PHYS_PAGES : _bindgen_ty_30 = 85 ; pub const _SC_AVPHYS_PAGES : _bindgen_ty_30 = 86 ; pub const _SC_ATEXIT_MAX : _bindgen_ty_30 = 87 ; pub const _SC_PASS_MAX : _bindgen_ty_30 = 88 ; pub const _SC_XOPEN_VERSION : _bindgen_ty_30 = 89 ; pub const _SC_XOPEN_XCU_VERSION : _bindgen_ty_30 = 90 ; pub const _SC_XOPEN_UNIX : _bindgen_ty_30 = 91 ; pub const _SC_XOPEN_CRYPT : _bindgen_ty_30 = 92 ; pub const _SC_XOPEN_ENH_I18N : _bindgen_ty_30 = 93 ; pub const _SC_XOPEN_SHM : _bindgen_ty_30 = 94 ; pub const _SC_2_CHAR_TERM : _bindgen_ty_30 = 95 ; pub const _SC_2_C_VERSION : _bindgen_ty_30 = 96 ; pub const _SC_2_UPE : _bindgen_ty_30 = 97 ; pub const _SC_XOPEN_XPG2 : _bindgen_ty_30 = 98 ; pub const _SC_XOPEN_XPG3 : _bindgen_ty_30 = 99 ; pub const _SC_XOPEN_XPG4 : _bindgen_ty_30 = 100 ; pub const _SC_CHAR_BIT : _bindgen_ty_30 = 101 ; pub const _SC_CHAR_MAX : _bindgen_ty_30 = 102 ; pub const _SC_CHAR_MIN : _bindgen_ty_30 = 103 ; pub const _SC_INT_MAX : _bindgen_ty_30 = 104 ; pub const _SC_INT_MIN : _bindgen_ty_30 = 105 ; pub const _SC_LONG_BIT : _bindgen_ty_30 = 106 ; pub const _SC_WORD_BIT : _bindgen_ty_30 = 107 ; pub const _SC_MB_LEN_MAX : _bindgen_ty_30 = 108 ; pub const _SC_NZERO : _bindgen_ty_30 = 109 ; pub const _SC_SSIZE_MAX : _bindgen_ty_30 = 110 ; pub const _SC_SCHAR_MAX : _bindgen_ty_30 = 111 ; pub const _SC_SCHAR_MIN : _bindgen_ty_30 = 112 ; pub const _SC_SHRT_MAX : _bindgen_ty_30 = 113 ; pub const _SC_SHRT_MIN : _bindgen_ty_30 = 114 ; pub const _SC_UCHAR_MAX : _bindgen_ty_30 = 115 ; pub const _SC_UINT_MAX : _bindgen_ty_30 = 116 ; pub const _SC_ULONG_MAX : _bindgen_ty_30 = 117 ; pub const _SC_USHRT_MAX : _bindgen_ty_30 = 118 ; pub const _SC_NL_ARGMAX : _bindgen_ty_30 = 119 ; pub const _SC_NL_LANGMAX : _bindgen_ty_30 = 120 ; pub const _SC_NL_MSGMAX : _bindgen_ty_30 = 121 ; pub const _SC_NL_NMAX : _bindgen_ty_30 = 122 ; pub const _SC_NL_SETMAX : _bindgen_ty_30 = 123 ; pub const _SC_NL_TEXTMAX : _bindgen_ty_30 = 124 ; pub const _SC_XBS5_ILP32_OFF32 : _bindgen_ty_30 = 125 ; pub const _SC_XBS5_ILP32_OFFBIG : _bindgen_ty_30 = 126 ; pub const _SC_XBS5_LP64_OFF64 : _bindgen_ty_30 = 127 ; pub const _SC_XBS5_LPBIG_OFFBIG : _bindgen_ty_30 = 128 ; pub const _SC_XOPEN_LEGACY : _bindgen_ty_30 = 129 ; pub const _SC_XOPEN_REALTIME : _bindgen_ty_30 = 130 ; pub const _SC_XOPEN_REALTIME_THREADS : _bindgen_ty_30 = 131 ; pub const _SC_ADVISORY_INFO : _bindgen_ty_30 = 132 ; pub const _SC_BARRIERS : _bindgen_ty_30 = 133 ; pub const _SC_BASE : _bindgen_ty_30 = 134 ; pub const _SC_C_LANG_SUPPORT : _bindgen_ty_30 = 135 ; pub const _SC_C_LANG_SUPPORT_R : _bindgen_ty_30 = 136 ; pub const _SC_CLOCK_SELECTION : _bindgen_ty_30 = 137 ; pub const _SC_CPUTIME : _bindgen_ty_30 = 138 ; pub const _SC_THREAD_CPUTIME : _bindgen_ty_30 = 139 ; pub const _SC_DEVICE_IO : _bindgen_ty_30 = 140 ; pub const _SC_DEVICE_SPECIFIC : _bindgen_ty_30 = 141 ; pub const _SC_DEVICE_SPECIFIC_R : _bindgen_ty_30 = 142 ; pub const _SC_FD_MGMT : _bindgen_ty_30 = 143 ; pub const _SC_FIFO : _bindgen_ty_30 = 144 ; pub const _SC_PIPE : _bindgen_ty_30 = 145 ; pub const _SC_FILE_ATTRIBUTES : _bindgen_ty_30 = 146 ; pub const _SC_FILE_LOCKING : _bindgen_ty_30 = 147 ; pub const _SC_FILE_SYSTEM : _bindgen_ty_30 = 148 ; pub const _SC_MONOTONIC_CLOCK : _bindgen_ty_30 = 149 ; pub const _SC_MULTI_PROCESS : _bindgen_ty_30 = 150 ; pub const _SC_SINGLE_PROCESS : _bindgen_ty_30 = 151 ; pub const _SC_NETWORKING : _bindgen_ty_30 = 152 ; pub const _SC_READER_WRITER_LOCKS : _bindgen_ty_30 = 153 ; pub const _SC_SPIN_LOCKS : _bindgen_ty_30 = 154 ; pub const _SC_REGEXP : _bindgen_ty_30 = 155 ; pub const _SC_REGEX_VERSION : _bindgen_ty_30 = 156 ; pub const _SC_SHELL : _bindgen_ty_30 = 157 ; pub const _SC_SIGNALS : _bindgen_ty_30 = 158 ; pub const _SC_SPAWN : _bindgen_ty_30 = 159 ; pub const _SC_SPORADIC_SERVER : _bindgen_ty_30 = 160 ; pub const _SC_THREAD_SPORADIC_SERVER : _bindgen_ty_30 = 161 ; pub const _SC_SYSTEM_DATABASE : _bindgen_ty_30 = 162 ; pub const _SC_SYSTEM_DATABASE_R : _bindgen_ty_30 = 163 ; pub const _SC_TIMEOUTS : _bindgen_ty_30 = 164 ; pub const _SC_TYPED_MEMORY_OBJECTS : _bindgen_ty_30 = 165 ; pub const _SC_USER_GROUPS : _bindgen_ty_30 = 166 ; pub const _SC_USER_GROUPS_R : _bindgen_ty_30 = 167 ; pub const _SC_2_PBS : _bindgen_ty_30 = 168 ; pub const _SC_2_PBS_ACCOUNTING : _bindgen_ty_30 = 169 ; pub const _SC_2_PBS_LOCATE : _bindgen_ty_30 = 170 ; pub const _SC_2_PBS_MESSAGE : _bindgen_ty_30 = 171 ; pub const _SC_2_PBS_TRACK : _bindgen_ty_30 = 172 ; pub const _SC_SYMLOOP_MAX : _bindgen_ty_30 = 173 ; pub const _SC_STREAMS : _bindgen_ty_30 = 174 ; pub const _SC_2_PBS_CHECKPOINT : _bindgen_ty_30 = 175 ; pub const _SC_V6_ILP32_OFF32 : _bindgen_ty_30 = 176 ; pub const _SC_V6_ILP32_OFFBIG : _bindgen_ty_30 = 177 ; pub const _SC_V6_LP64_OFF64 : _bindgen_ty_30 = 178 ; pub const _SC_V6_LPBIG_OFFBIG : _bindgen_ty_30 = 179 ; pub const _SC_HOST_NAME_MAX : _bindgen_ty_30 = 180 ; pub const _SC_TRACE : _bindgen_ty_30 = 181 ; pub const _SC_TRACE_EVENT_FILTER : _bindgen_ty_30 = 182 ; pub const _SC_TRACE_INHERIT : _bindgen_ty_30 = 183 ; pub const _SC_TRACE_LOG : _bindgen_ty_30 = 184 ; pub const _SC_LEVEL1_ICACHE_SIZE : _bindgen_ty_30 = 185 ; pub const _SC_LEVEL1_ICACHE_ASSOC : _bindgen_ty_30 = 186 ; pub const _SC_LEVEL1_ICACHE_LINESIZE : _bindgen_ty_30 = 187 ; pub const _SC_LEVEL1_DCACHE_SIZE : _bindgen_ty_30 = 188 ; pub const _SC_LEVEL1_DCACHE_ASSOC : _bindgen_ty_30 = 189 ; pub const _SC_LEVEL1_DCACHE_LINESIZE : _bindgen_ty_30 = 190 ; pub const _SC_LEVEL2_CACHE_SIZE : _bindgen_ty_30 = 191 ; pub const _SC_LEVEL2_CACHE_ASSOC : _bindgen_ty_30 = 192 ; pub const _SC_LEVEL2_CACHE_LINESIZE : _bindgen_ty_30 = 193 ; pub const _SC_LEVEL3_CACHE_SIZE : _bindgen_ty_30 = 194 ; pub const _SC_LEVEL3_CACHE_ASSOC : _bindgen_ty_30 = 195 ; pub const _SC_LEVEL3_CACHE_LINESIZE : _bindgen_ty_30 = 196 ; pub const _SC_LEVEL4_CACHE_SIZE : _bindgen_ty_30 = 197 ; pub const _SC_LEVEL4_CACHE_ASSOC : _bindgen_ty_30 = 198 ; pub const _SC_LEVEL4_CACHE_LINESIZE : _bindgen_ty_30 = 199 ; pub const _SC_IPV6 : _bindgen_ty_30 = 235 ; pub const _SC_RAW_SOCKETS : _bindgen_ty_30 = 236 ; pub const _SC_V7_ILP32_OFF32 : _bindgen_ty_30 = 237 ; pub const _SC_V7_ILP32_OFFBIG : _bindgen_ty_30 = 238 ; pub const _SC_V7_LP64_OFF64 : _bindgen_ty_30 = 239 ; pub const _SC_V7_LPBIG_OFFBIG : _bindgen_ty_30 = 240 ; pub const _SC_SS_REPL_MAX : _bindgen_ty_30 = 241 ; pub const _SC_TRACE_EVENT_NAME_MAX : _bindgen_ty_30 = 242 ; pub const _SC_TRACE_NAME_MAX : _bindgen_ty_30 = 243 ; pub const _SC_TRACE_SYS_MAX : _bindgen_ty_30 = 244 ; pub const _SC_TRACE_USER_EVENT_MAX : _bindgen_ty_30 = 245 ; pub const _SC_XOPEN_STREAMS : _bindgen_ty_30 = 246 ; pub const _SC_THREAD_ROBUST_PRIO_INHERIT : _bindgen_ty_30 = 247 ; pub const _SC_THREAD_ROBUST_PRIO_PROTECT : _bindgen_ty_30 = 248 ; pub type _bindgen_ty_30 = u32 ; pub const _CS_PATH : _bindgen_ty_31 = 0 ; pub const _CS_V6_WIDTH_RESTRICTED_ENVS : _bindgen_ty_31 = 1 ; pub const _CS_GNU_LIBC_VERSION : _bindgen_ty_31 = 2 ; pub const _CS_GNU_LIBPTHREAD_VERSION : _bindgen_ty_31 = 3 ; pub const _CS_V5_WIDTH_RESTRICTED_ENVS : _bindgen_ty_31 = 4 ; pub const _CS_V7_WIDTH_RESTRICTED_ENVS : _bindgen_ty_31 = 5 ; pub const _CS_LFS_CFLAGS : _bindgen_ty_31 = 1000 ; pub const _CS_LFS_LDFLAGS : _bindgen_ty_31 = 1001 ; pub const _CS_LFS_LIBS : _bindgen_ty_31 = 1002 ; pub const _CS_LFS_LINTFLAGS : _bindgen_ty_31 = 1003 ; pub const _CS_LFS64_CFLAGS : _bindgen_ty_31 = 1004 ; pub const _CS_LFS64_LDFLAGS : _bindgen_ty_31 = 1005 ; pub const _CS_LFS64_LIBS : _bindgen_ty_31 = 1006 ; pub const _CS_LFS64_LINTFLAGS : _bindgen_ty_31 = 1007 ; pub const _CS_XBS5_ILP32_OFF32_CFLAGS : _bindgen_ty_31 = 1100 ; pub const _CS_XBS5_ILP32_OFF32_LDFLAGS : _bindgen_ty_31 = 1101 ; pub const _CS_XBS5_ILP32_OFF32_LIBS : _bindgen_ty_31 = 1102 ; pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS : _bindgen_ty_31 = 1103 ; pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS : _bindgen_ty_31 = 1104 ; pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS : _bindgen_ty_31 = 1105 ; pub const _CS_XBS5_ILP32_OFFBIG_LIBS : _bindgen_ty_31 = 1106 ; pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS : _bindgen_ty_31 = 1107 ; pub const _CS_XBS5_LP64_OFF64_CFLAGS : _bindgen_ty_31 = 1108 ; pub const _CS_XBS5_LP64_OFF64_LDFLAGS : _bindgen_ty_31 = 1109 ; pub const _CS_XBS5_LP64_OFF64_LIBS : _bindgen_ty_31 = 1110 ; pub const _CS_XBS5_LP64_OFF64_LINTFLAGS : _bindgen_ty_31 = 1111 ; pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS : _bindgen_ty_31 = 1112 ; pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS : _bindgen_ty_31 = 1113 ; pub const _CS_XBS5_LPBIG_OFFBIG_LIBS : _bindgen_ty_31 = 1114 ; pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS : _bindgen_ty_31 = 1115 ; pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS : _bindgen_ty_31 = 1116 ; pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS : _bindgen_ty_31 = 1117 ; pub const _CS_POSIX_V6_ILP32_OFF32_LIBS : _bindgen_ty_31 = 1118 ; pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS : _bindgen_ty_31 = 1119 ; pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS : _bindgen_ty_31 = 1120 ; pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS : _bindgen_ty_31 = 1121 ; pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS : _bindgen_ty_31 = 1122 ; pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS : _bindgen_ty_31 = 1123 ; pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS : _bindgen_ty_31 = 1124 ; pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS : _bindgen_ty_31 = 1125 ; pub const _CS_POSIX_V6_LP64_OFF64_LIBS : _bindgen_ty_31 = 1126 ; pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS : _bindgen_ty_31 = 1127 ; pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS : _bindgen_ty_31 = 1128 ; pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS : _bindgen_ty_31 = 1129 ; pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS : _bindgen_ty_31 = 1130 ; pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS : _bindgen_ty_31 = 1131 ; pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS : _bindgen_ty_31 = 1132 ; pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS : _bindgen_ty_31 = 1133 ; pub const _CS_POSIX_V7_ILP32_OFF32_LIBS : _bindgen_ty_31 = 1134 ; pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS : _bindgen_ty_31 = 1135 ; pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS : _bindgen_ty_31 = 1136 ; pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS : _bindgen_ty_31 = 1137 ; pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS : _bindgen_ty_31 = 1138 ; pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS : _bindgen_ty_31 = 1139 ; pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS : _bindgen_ty_31 = 1140 ; pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS : _bindgen_ty_31 = 1141 ; pub const _CS_POSIX_V7_LP64_OFF64_LIBS : _bindgen_ty_31 = 1142 ; pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS : _bindgen_ty_31 = 1143 ; pub const _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS : _bindgen_ty_31 = 1144 ; pub const _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS : _bindgen_ty_31 = 1145 ; pub const _CS_POSIX_V7_LPBIG_OFFBIG_LIBS : _bindgen_ty_31 = 1146 ; pub const _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS : _bindgen_ty_31 = 1147 ; pub const _CS_V6_ENV : _bindgen_ty_31 = 1148 ; pub const _CS_V7_ENV : _bindgen_ty_31 = 1149 ; pub type _bindgen_ty_31 = u32 ; extern "C" { # [ link_name = "\u{1}_Z8pathconf" ] pub fn pathconf ( __path : * const :: std :: os :: raw :: c_char , __name : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z9fpathconf" ] pub fn fpathconf ( __fd : :: std :: os :: raw :: c_int , __name : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z7sysconf" ] pub fn sysconf ( __name : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z7confstr" ] pub fn confstr ( __name : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : usize ) -> usize ; } extern "C" { # [ link_name = "\u{1}_Z6getpid" ] pub fn getpid ( ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z7getppid" ] pub fn getppid ( ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z7getpgrp" ] pub fn getpgrp ( ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z9__getpgid" ] pub fn __getpgid ( __pid : __pid_t ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z7getpgid" ] pub fn getpgid ( __pid : __pid_t ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z7setpgid" ] pub fn setpgid ( __pid : __pid_t , __pgid : __pid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7setpgrp" ] pub fn setpgrp ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6setsid" ] pub fn setsid ( ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z6getsid" ] pub fn getsid ( __pid : __pid_t ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z6getuid" ] pub fn getuid ( ) -> __uid_t ; } extern "C" { # [ link_name = "\u{1}_Z7geteuid" ] pub fn geteuid ( ) -> __uid_t ; } extern "C" { # [ link_name = "\u{1}_Z6getgid" ] pub fn getgid ( ) -> __gid_t ; } extern "C" { # [ link_name = "\u{1}_Z7getegid" ] pub fn getegid ( ) -> __gid_t ; } extern "C" { # [ link_name = "\u{1}_Z9getgroups" ] pub fn getgroups ( __size : :: std :: os :: raw :: c_int , __list : * mut __gid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6setuid" ] pub fn setuid ( __uid : __uid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8setreuid" ] pub fn setreuid ( __ruid : __uid_t , __euid : __uid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7seteuid" ] pub fn seteuid ( __uid : __uid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6setgid" ] pub fn setgid ( __gid : __gid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8setregid" ] pub fn setregid ( __rgid : __gid_t , __egid : __gid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7setegid" ] pub fn setegid ( __gid : __gid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4fork" ] pub fn fork ( ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z5vfork" ] pub fn vfork ( ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z7ttyname" ] pub fn ttyname ( __fd : :: std :: os :: raw :: c_int ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z9ttyname_r" ] pub fn ttyname_r ( __fd : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6isatty" ] pub fn isatty ( __fd : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7ttyslot" ] pub fn ttyslot ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4link" ] pub fn link ( __from : * const :: std :: os :: raw :: c_char , __to : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6linkat" ] pub fn linkat ( __fromfd : :: std :: os :: raw :: c_int , __from : * const :: std :: os :: raw :: c_char , __tofd : :: std :: os :: raw :: c_int , __to : * const :: std :: os :: raw :: c_char , __flags : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7symlink" ] pub fn symlink ( __from : * const :: std :: os :: raw :: c_char , __to : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8readlink" ] pub fn readlink ( __path : * const :: std :: os :: raw :: c_char , __buf : * mut :: std :: os :: raw :: c_char , __len : usize ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z9symlinkat" ] pub fn symlinkat ( __from : * const :: std :: os :: raw :: c_char , __tofd : :: std :: os :: raw :: c_int , __to : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10readlinkat" ] pub fn readlinkat ( __fd : :: std :: os :: raw :: c_int , __path : * const :: std :: os :: raw :: c_char , __buf : * mut :: std :: os :: raw :: c_char , __len : usize ) -> isize ; } extern "C" { # [ link_name = "\u{1}_Z6unlink" ] pub fn unlink ( __name : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8unlinkat" ] pub fn unlinkat ( __fd : :: std :: os :: raw :: c_int , __name : * const :: std :: os :: raw :: c_char , __flag : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5rmdir" ] pub fn rmdir ( __path : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9tcgetpgrp" ] pub fn tcgetpgrp ( __fd : :: std :: os :: raw :: c_int ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z9tcsetpgrp" ] pub fn tcsetpgrp ( __fd : :: std :: os :: raw :: c_int , __pgrp_id : __pid_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8getlogin" ] pub fn getlogin ( ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z10getlogin_r" ] pub fn getlogin_r ( __name : * mut :: std :: os :: raw :: c_char , __name_len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8setlogin" ] pub fn setlogin ( __name : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6getopt" ] pub fn getopt ( ___argc : :: std :: os :: raw :: c_int , ___argv : * const * mut :: std :: os :: raw :: c_char , __shortopts : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11gethostname" ] pub fn gethostname ( __name : * mut :: std :: os :: raw :: c_char , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11sethostname" ] pub fn sethostname ( __name : * const :: std :: os :: raw :: c_char , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9sethostid" ] pub fn sethostid ( __id : :: std :: os :: raw :: c_long ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13getdomainname" ] pub fn getdomainname ( __name : * mut :: std :: os :: raw :: c_char , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13setdomainname" ] pub fn setdomainname ( __name : * const :: std :: os :: raw :: c_char , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7vhangup" ] pub fn vhangup ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6revoke" ] pub fn revoke ( __file : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6profil" ] pub fn profil ( __sample_buffer : * mut :: std :: os :: raw :: c_ushort , __size : usize , __offset : usize , __scale : :: std :: os :: raw :: c_uint ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4acct" ] pub fn acct ( __name : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z12getusershell" ] pub fn getusershell ( ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z12endusershell" ] pub fn endusershell ( ) ; } extern "C" { # [ link_name = "\u{1}_Z12setusershell" ] pub fn setusershell ( ) ; } extern "C" { # [ link_name = "\u{1}_Z6daemon" ] pub fn daemon ( __nochdir : :: std :: os :: raw :: c_int , __noclose : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6chroot" ] pub fn chroot ( __path : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7getpass" ] pub fn getpass ( __prompt : * const :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z5fsync" ] pub fn fsync ( __fd : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9gethostid" ] pub fn gethostid ( ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z4sync" ] pub fn sync ( ) ; } extern "C" { # [ link_name = "\u{1}_Z11getpagesize" ] pub fn getpagesize ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13getdtablesize" ] pub fn getdtablesize ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8truncate" ] pub fn truncate ( __file : * const :: std :: os :: raw :: c_char , __length : __off_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9ftruncate" ] pub fn ftruncate ( __fd : :: std :: os :: raw :: c_int , __length : __off_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z3brk" ] pub fn brk ( __addr : * mut :: std :: os :: raw :: c_void ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4sbrk" ] pub fn sbrk ( __delta : isize ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z7syscall" ] pub fn syscall ( __sysno : :: std :: os :: raw :: c_long , ... ) -> :: std :: os :: raw :: c_long ; } extern "C" { # [ link_name = "\u{1}_Z9fdatasync" ] pub fn fdatasync ( __fildes : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct if_nameindex { pub if_index : :: std :: os :: raw :: c_uint , pub if_name : * mut :: std :: os :: raw :: c_char , } # [ test ] fn bindgen_test_layout_if_nameindex ( ) { assert_eq ! ( :: std :: mem :: size_of :: < if_nameindex > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( if_nameindex ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < if_nameindex > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( if_nameindex ) ) ) ; } impl Default for if_nameindex { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub const IFF_UP : _bindgen_ty_32 = 1 ; pub const IFF_BROADCAST : _bindgen_ty_32 = 2 ; pub const IFF_DEBUG : _bindgen_ty_32 = 4 ; pub const IFF_LOOPBACK : _bindgen_ty_32 = 8 ; pub const IFF_POINTOPOINT : _bindgen_ty_32 = 16 ; pub const IFF_NOTRAILERS : _bindgen_ty_32 = 32 ; pub const IFF_RUNNING : _bindgen_ty_32 = 64 ; pub const IFF_NOARP : _bindgen_ty_32 = 128 ; pub const IFF_PROMISC : _bindgen_ty_32 = 256 ; pub const IFF_ALLMULTI : _bindgen_ty_32 = 512 ; pub const IFF_MASTER : _bindgen_ty_32 = 1024 ; pub const IFF_SLAVE : _bindgen_ty_32 = 2048 ; pub const IFF_MULTICAST : _bindgen_ty_32 = 4096 ; pub const IFF_PORTSEL : _bindgen_ty_32 = 8192 ; pub const IFF_AUTOMEDIA : _bindgen_ty_32 = 16384 ; pub const IFF_DYNAMIC : _bindgen_ty_32 = 32768 ; pub type _bindgen_ty_32 = u32 ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct ifaddr { pub ifa_addr : sockaddr , pub ifa_ifu : ifaddr__bindgen_ty_1 , pub ifa_ifp : * mut iface , pub ifa_next : * mut ifaddr , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union ifaddr__bindgen_ty_1 { pub ifu_broadaddr : sockaddr , pub ifu_dstaddr : sockaddr , _bindgen_union_align : [ u16 ; 8usize ] , } # [ test ] fn bindgen_test_layout_ifaddr__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ifaddr__bindgen_ty_1 > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( ifaddr__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ifaddr__bindgen_ty_1 > ( ) , 2usize , concat ! ( "Alignment of " , stringify ! ( ifaddr__bindgen_ty_1 ) ) ) ; } impl Default for ifaddr__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_ifaddr ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ifaddr > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( ifaddr ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ifaddr > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ifaddr ) ) ) ; } impl Default for ifaddr { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct ifmap { pub mem_start : :: std :: os :: raw :: c_ulong , pub mem_end : :: std :: os :: raw :: c_ulong , pub base_addr : :: std :: os :: raw :: c_ushort , pub irq : :: std :: os :: raw :: c_uchar , pub dma : :: std :: os :: raw :: c_uchar , pub port : :: std :: os :: raw :: c_uchar , } # [ test ] fn bindgen_test_layout_ifmap ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ifmap > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( ifmap ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ifmap > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ifmap ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct ifreq { pub ifr_ifrn : ifreq__bindgen_ty_1 , pub ifr_ifru : ifreq__bindgen_ty_2 , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union ifreq__bindgen_ty_1 { pub ifrn_name : [ :: std :: os :: raw :: c_char ; 16usize ] , _bindgen_union_align : [ u8 ; 16usize ] , } # [ test ] fn bindgen_test_layout_ifreq__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ifreq__bindgen_ty_1 > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( ifreq__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ifreq__bindgen_ty_1 > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( ifreq__bindgen_ty_1 ) ) ) ; } impl Default for ifreq__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union ifreq__bindgen_ty_2 { pub ifru_addr : sockaddr , pub ifru_dstaddr : sockaddr , pub ifru_broadaddr : sockaddr , pub ifru_netmask : sockaddr , pub ifru_hwaddr : sockaddr , pub ifru_flags : :: std :: os :: raw :: c_short , pub ifru_ivalue : :: std :: os :: raw :: c_int , pub ifru_mtu : :: std :: os :: raw :: c_int , pub ifru_map : ifmap , pub ifru_slave : [ :: std :: os :: raw :: c_char ; 16usize ] , pub ifru_newname : [ :: std :: os :: raw :: c_char ; 16usize ] , pub ifru_data : __caddr_t , _bindgen_union_align : [ u64 ; 3usize ] , } # [ test ] fn bindgen_test_layout_ifreq__bindgen_ty_2 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ifreq__bindgen_ty_2 > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( ifreq__bindgen_ty_2 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ifreq__bindgen_ty_2 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ifreq__bindgen_ty_2 ) ) ) ; } impl Default for ifreq__bindgen_ty_2 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_ifreq ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ifreq > ( ) , 40usize , concat ! ( "Size of: " , stringify ! ( ifreq ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ifreq > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ifreq ) ) ) ; } impl Default for ifreq { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct ifconf { pub ifc_len : :: std :: os :: raw :: c_int , pub ifc_ifcu : ifconf__bindgen_ty_1 , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union ifconf__bindgen_ty_1 { pub ifcu_buf : __caddr_t , pub ifcu_req : * mut ifreq , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_ifconf__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ifconf__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( ifconf__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ifconf__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ifconf__bindgen_ty_1 ) ) ) ; } impl Default for ifconf__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_ifconf ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ifconf > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( ifconf ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ifconf > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ifconf ) ) ) ; } impl Default for ifconf { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } extern "C" { # [ link_name = "\u{1}_Z14if_nametoindex" ] pub fn if_nametoindex ( __ifname : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_uint ; } extern "C" { # [ link_name = "\u{1}_Z14if_indextoname" ] pub fn if_indextoname ( __ifindex : :: std :: os :: raw :: c_uint , __ifname : * mut :: std :: os :: raw :: c_char ) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { # [ link_name = "\u{1}_Z12if_nameindex" ] pub fn if_nameindex ( ) -> * mut if_nameindex ; } extern "C" { # [ link_name = "\u{1}_Z16if_freenameindex" ] pub fn if_freenameindex ( __ptr : * mut if_nameindex ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct tcphdr { pub source : u_int16_t , pub dest : u_int16_t , pub seq : u_int32_t , pub ack_seq : u_int32_t , pub _bitfield_1 : __BindgenBitfieldUnit < [ u8 ; 2usize ] , u8 > , pub window : u_int16_t , pub check : u_int16_t , pub urg_ptr : u_int16_t , } # [ test ] fn bindgen_test_layout_tcphdr ( ) { assert_eq ! ( :: std :: mem :: size_of :: < tcphdr > ( ) , 20usize , concat ! ( "Size of: " , stringify ! ( tcphdr ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < tcphdr > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( tcphdr ) ) ) ; } impl tcphdr { # [ inline ] pub fn res1 ( & self ) -> u_int16_t { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 0usize , 4u8 ) as u16 ) } } # [ inline ] pub fn set_res1 ( & mut self , val : u_int16_t ) { unsafe { let val : u16 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 0usize , 4u8 , val as u64 ) } } # [ inline ] pub fn doff ( & self ) -> u_int16_t { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 4usize , 4u8 ) as u16 ) } } # [ inline ] pub fn set_doff ( & mut self , val : u_int16_t ) { unsafe { let val : u16 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 4usize , 4u8 , val as u64 ) } } # [ inline ] pub fn fin ( & self ) -> u_int16_t { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 8usize , 1u8 ) as u16 ) } } # [ inline ] pub fn set_fin ( & mut self , val : u_int16_t ) { unsafe { let val : u16 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 8usize , 1u8 , val as u64 ) } } # [ inline ] pub fn syn ( & self ) -> u_int16_t { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 9usize , 1u8 ) as u16 ) } } # [ inline ] pub fn set_syn ( & mut self , val : u_int16_t ) { unsafe { let val : u16 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 9usize , 1u8 , val as u64 ) } } # [ inline ] pub fn rst ( & self ) -> u_int16_t { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 10usize , 1u8 ) as u16 ) } } # [ inline ] pub fn set_rst ( & mut self , val : u_int16_t ) { unsafe { let val : u16 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 10usize , 1u8 , val as u64 ) } } # [ inline ] pub fn psh ( & self ) -> u_int16_t { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 11usize , 1u8 ) as u16 ) } } # [ inline ] pub fn set_psh ( & mut self , val : u_int16_t ) { unsafe { let val : u16 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 11usize , 1u8 , val as u64 ) } } # [ inline ] pub fn ack ( & self ) -> u_int16_t { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 12usize , 1u8 ) as u16 ) } } # [ inline ] pub fn set_ack ( & mut self , val : u_int16_t ) { unsafe { let val : u16 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 12usize , 1u8 , val as u64 ) } } # [ inline ] pub fn urg ( & self ) -> u_int16_t { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 13usize , 1u8 ) as u16 ) } } # [ inline ] pub fn set_urg ( & mut self , val : u_int16_t ) { unsafe { let val : u16 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 13usize , 1u8 , val as u64 ) } } # [ inline ] pub fn res2 ( & self ) -> u_int16_t { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 14usize , 2u8 ) as u16 ) } } # [ inline ] pub fn set_res2 ( & mut self , val : u_int16_t ) { unsafe { let val : u16 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 14usize , 2u8 , val as u64 ) } } # [ inline ] pub fn new_bitfield_1 ( res1 : u_int16_t , doff : u_int16_t , fin : u_int16_t , syn : u_int16_t , rst : u_int16_t , psh : u_int16_t , ack : u_int16_t , urg : u_int16_t , res2 : u_int16_t ) -> __BindgenBitfieldUnit < [ u8 ; 2usize ] , u8 > { let mut __bindgen_bitfield_unit : __BindgenBitfieldUnit < [ u8 ; 2usize ] , u8 > = Default :: default ( ) ; __bindgen_bitfield_unit . set ( 0usize , 4u8 , { let res1 : u16 = unsafe { :: std :: mem :: transmute ( res1 ) } ; res1 as u64 } ) ; __bindgen_bitfield_unit . set ( 4usize , 4u8 , { let doff : u16 = unsafe { :: std :: mem :: transmute ( doff ) } ; doff as u64 } ) ; __bindgen_bitfield_unit . set ( 8usize , 1u8 , { let fin : u16 = unsafe { :: std :: mem :: transmute ( fin ) } ; fin as u64 } ) ; __bindgen_bitfield_unit . set ( 9usize , 1u8 , { let syn : u16 = unsafe { :: std :: mem :: transmute ( syn ) } ; syn as u64 } ) ; __bindgen_bitfield_unit . set ( 10usize , 1u8 , { let rst : u16 = unsafe { :: std :: mem :: transmute ( rst ) } ; rst as u64 } ) ; __bindgen_bitfield_unit . set ( 11usize , 1u8 , { let psh : u16 = unsafe { :: std :: mem :: transmute ( psh ) } ; psh as u64 } ) ; __bindgen_bitfield_unit . set ( 12usize , 1u8 , { let ack : u16 = unsafe { :: std :: mem :: transmute ( ack ) } ; ack as u64 } ) ; __bindgen_bitfield_unit . set ( 13usize , 1u8 , { let urg : u16 = unsafe { :: std :: mem :: transmute ( urg ) } ; urg as u64 } ) ; __bindgen_bitfield_unit . set ( 14usize , 2u8 , { let res2 : u16 = unsafe { :: std :: mem :: transmute ( res2 ) } ; res2 as u64 } ) ; __bindgen_bitfield_unit } } pub const TCP_ESTABLISHED : _bindgen_ty_33 = 1 ; pub const TCP_SYN_SENT : _bindgen_ty_33 = 2 ; pub const TCP_SYN_RECV : _bindgen_ty_33 = 3 ; pub const TCP_FIN_WAIT1 : _bindgen_ty_33 = 4 ; pub const TCP_FIN_WAIT2 : _bindgen_ty_33 = 5 ; pub const TCP_TIME_WAIT : _bindgen_ty_33 = 6 ; pub const TCP_CLOSE : _bindgen_ty_33 = 7 ; pub const TCP_CLOSE_WAIT : _bindgen_ty_33 = 8 ; pub const TCP_LAST_ACK : _bindgen_ty_33 = 9 ; pub const TCP_LISTEN : _bindgen_ty_33 = 10 ; pub const TCP_CLOSING : _bindgen_ty_33 = 11 ; pub type _bindgen_ty_33 = u32 ; pub const tcp_ca_state_TCP_CA_Open : tcp_ca_state = 0 ; pub const tcp_ca_state_TCP_CA_Disorder : tcp_ca_state = 1 ; pub const tcp_ca_state_TCP_CA_CWR : tcp_ca_state = 2 ; pub const tcp_ca_state_TCP_CA_Recovery : tcp_ca_state = 3 ; pub const tcp_ca_state_TCP_CA_Loss : tcp_ca_state = 4 ; pub type tcp_ca_state = u32 ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct tcp_info { pub tcpi_state : u_int8_t , pub tcpi_ca_state : u_int8_t , pub tcpi_retransmits : u_int8_t , pub tcpi_probes : u_int8_t , pub tcpi_backoff : u_int8_t , pub tcpi_options : u_int8_t , pub _bitfield_1 : __BindgenBitfieldUnit < [ u8 ; 1usize ] , u8 > , pub tcpi_rto : u_int32_t , pub tcpi_ato : u_int32_t , pub tcpi_snd_mss : u_int32_t , pub tcpi_rcv_mss : u_int32_t , pub tcpi_unacked : u_int32_t , pub tcpi_sacked : u_int32_t , pub tcpi_lost : u_int32_t , pub tcpi_retrans : u_int32_t , pub tcpi_fackets : u_int32_t , pub tcpi_last_data_sent : u_int32_t , pub tcpi_last_ack_sent : u_int32_t , pub tcpi_last_data_recv : u_int32_t , pub tcpi_last_ack_recv : u_int32_t , pub tcpi_pmtu : u_int32_t , pub tcpi_rcv_ssthresh : u_int32_t , pub tcpi_rtt : u_int32_t , pub tcpi_rttvar : u_int32_t , pub tcpi_snd_ssthresh : u_int32_t , pub tcpi_snd_cwnd : u_int32_t , pub tcpi_advmss : u_int32_t , pub tcpi_reordering : u_int32_t , pub tcpi_rcv_rtt : u_int32_t , pub tcpi_rcv_space : u_int32_t , pub tcpi_total_retrans : u_int32_t , } # [ test ] fn bindgen_test_layout_tcp_info ( ) { assert_eq ! ( :: std :: mem :: size_of :: < tcp_info > ( ) , 104usize , concat ! ( "Size of: " , stringify ! ( tcp_info ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < tcp_info > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( tcp_info ) ) ) ; } impl tcp_info { # [ inline ] pub fn tcpi_snd_wscale ( & self ) -> u_int8_t { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 0usize , 4u8 ) as u8 ) } } # [ inline ] pub fn set_tcpi_snd_wscale ( & mut self , val : u_int8_t ) { unsafe { let val : u8 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 0usize , 4u8 , val as u64 ) } } # [ inline ] pub fn tcpi_rcv_wscale ( & self ) -> u_int8_t { unsafe { :: std :: mem :: transmute ( self . _bitfield_1 . get ( 4usize , 4u8 ) as u8 ) } } # [ inline ] pub fn set_tcpi_rcv_wscale ( & mut self , val : u_int8_t ) { unsafe { let val : u8 = :: std :: mem :: transmute ( val ) ; self . _bitfield_1 . set ( 4usize , 4u8 , val as u64 ) } } # [ inline ] pub fn new_bitfield_1 ( tcpi_snd_wscale : u_int8_t , tcpi_rcv_wscale : u_int8_t ) -> __BindgenBitfieldUnit < [ u8 ; 1usize ] , u8 > { let mut __bindgen_bitfield_unit : __BindgenBitfieldUnit < [ u8 ; 1usize ] , u8 > = Default :: default ( ) ; __bindgen_bitfield_unit . set ( 0usize , 4u8 , { let tcpi_snd_wscale : u8 = unsafe { :: std :: mem :: transmute ( tcpi_snd_wscale ) } ; tcpi_snd_wscale as u64 } ) ; __bindgen_bitfield_unit . set ( 4usize , 4u8 , { let tcpi_rcv_wscale : u8 = unsafe { :: std :: mem :: transmute ( tcpi_rcv_wscale ) } ; tcpi_rcv_wscale as u64 } ) ; __bindgen_bitfield_unit } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct tcp_md5sig { pub tcpm_addr : sockaddr_storage , pub __tcpm_pad1 : u_int16_t , pub tcpm_keylen : u_int16_t , pub __tcpm_pad2 : u_int32_t , pub tcpm_key : [ u_int8_t ; 80usize ] , } # [ test ] fn bindgen_test_layout_tcp_md5sig ( ) { assert_eq ! ( :: std :: mem :: size_of :: < tcp_md5sig > ( ) , 216usize , concat ! ( "Size of: " , stringify ! ( tcp_md5sig ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < tcp_md5sig > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( tcp_md5sig ) ) ) ; } impl Default for tcp_md5sig { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct tcp_repair_opt { pub opt_code : u_int32_t , pub opt_val : u_int32_t , } # [ test ] fn bindgen_test_layout_tcp_repair_opt ( ) { assert_eq ! ( :: std :: mem :: size_of :: < tcp_repair_opt > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( tcp_repair_opt ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < tcp_repair_opt > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( tcp_repair_opt ) ) ) ; } pub const TCP_NO_QUEUE : _bindgen_ty_34 = 0 ; pub const TCP_RECV_QUEUE : _bindgen_ty_34 = 1 ; pub const TCP_SEND_QUEUE : _bindgen_ty_34 = 2 ; pub const TCP_QUEUES_NR : _bindgen_ty_34 = 3 ; pub type _bindgen_ty_34 = u32 ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct tcp_cookie_transactions { pub tcpct_flags : u_int16_t , pub __tcpct_pad1 : u_int8_t , pub tcpct_cookie_desired : u_int8_t , pub tcpct_s_data_desired : u_int16_t , pub tcpct_used : u_int16_t , pub tcpct_value : [ u_int8_t ; 536usize ] , } # [ test ] fn bindgen_test_layout_tcp_cookie_transactions ( ) { assert_eq ! ( :: std :: mem :: size_of :: < tcp_cookie_transactions > ( ) , 544usize , concat ! ( "Size of: " , stringify ! ( tcp_cookie_transactions ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < tcp_cookie_transactions > ( ) , 2usize , concat ! ( "Alignment of " , stringify ! ( tcp_cookie_transactions ) ) ) ; } impl Default for tcp_cookie_transactions { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct winsize { pub ws_row : :: std :: os :: raw :: c_ushort , pub ws_col : :: std :: os :: raw :: c_ushort , pub ws_xpixel : :: std :: os :: raw :: c_ushort , pub ws_ypixel : :: std :: os :: raw :: c_ushort , } # [ test ] fn bindgen_test_layout_winsize ( ) { assert_eq ! ( :: std :: mem :: size_of :: < winsize > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( winsize ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < winsize > ( ) , 2usize , concat ! ( "Alignment of " , stringify ! ( winsize ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct termio { pub c_iflag : :: std :: os :: raw :: c_ushort , pub c_oflag : :: std :: os :: raw :: c_ushort , pub c_cflag : :: std :: os :: raw :: c_ushort , pub c_lflag : :: std :: os :: raw :: c_ushort , pub c_line : :: std :: os :: raw :: c_uchar , pub c_cc : [ :: std :: os :: raw :: c_uchar ; 8usize ] , } # [ test ] fn bindgen_test_layout_termio ( ) { assert_eq ! ( :: std :: mem :: size_of :: < termio > ( ) , 18usize , concat ! ( "Size of: " , stringify ! ( termio ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < termio > ( ) , 2usize , concat ! ( "Alignment of " , stringify ! ( termio ) ) ) ; } extern "C" { # [ link_name = "\u{1}_Z5ioctl" ] pub fn ioctl ( __fd : :: std :: os :: raw :: c_int , __request : :: std :: os :: raw :: c_ulong , ... ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4mmap" ] pub fn mmap ( __addr : * mut :: std :: os :: raw :: c_void , __len : usize , __prot : :: std :: os :: raw :: c_int , __flags : :: std :: os :: raw :: c_int , __fd : :: std :: os :: raw :: c_int , __offset : __off_t ) -> * mut :: std :: os :: raw :: c_void ; } extern "C" { # [ link_name = "\u{1}_Z6munmap" ] pub fn munmap ( __addr : * mut :: std :: os :: raw :: c_void , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8mprotect" ] pub fn mprotect ( __addr : * mut :: std :: os :: raw :: c_void , __len : usize , __prot : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5msync" ] pub fn msync ( __addr : * mut :: std :: os :: raw :: c_void , __len : usize , __flags : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7madvise" ] pub fn madvise ( __addr : * mut :: std :: os :: raw :: c_void , __len : usize , __advice : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z13posix_madvise" ] pub fn posix_madvise ( __addr : * mut :: std :: os :: raw :: c_void , __len : usize , __advice : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5mlock" ] pub fn mlock ( __addr : * const :: std :: os :: raw :: c_void , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7munlock" ] pub fn munlock ( __addr : * const :: std :: os :: raw :: c_void , __len : usize ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8mlockall" ] pub fn mlockall ( __flags : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10munlockall" ] pub fn munlockall ( ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7mincore" ] pub fn mincore ( __start : * mut :: std :: os :: raw :: c_void , __len : usize , __vec : * mut :: std :: os :: raw :: c_uchar ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8shm_open" ] pub fn shm_open ( __name : * const :: std :: os :: raw :: c_char , __oflag : :: std :: os :: raw :: c_int , __mode : mode_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10shm_unlink" ] pub fn shm_unlink ( __name : * const :: std :: os :: raw :: c_char ) -> :: std :: os :: raw :: c_int ; } pub const __rlimit_resource_RLIMIT_CPU : __rlimit_resource = 0 ; pub const __rlimit_resource_RLIMIT_FSIZE : __rlimit_resource = 1 ; pub const __rlimit_resource_RLIMIT_DATA : __rlimit_resource = 2 ; pub const __rlimit_resource_RLIMIT_STACK : __rlimit_resource = 3 ; pub const __rlimit_resource_RLIMIT_CORE : __rlimit_resource = 4 ; pub const __rlimit_resource___RLIMIT_RSS : __rlimit_resource = 5 ; pub const __rlimit_resource_RLIMIT_NOFILE : __rlimit_resource = 7 ; pub const __rlimit_resource___RLIMIT_OFILE : __rlimit_resource = 7 ; pub const __rlimit_resource_RLIMIT_AS : __rlimit_resource = 9 ; pub const __rlimit_resource___RLIMIT_NPROC : __rlimit_resource = 6 ; pub const __rlimit_resource___RLIMIT_MEMLOCK : __rlimit_resource = 8 ; pub const __rlimit_resource___RLIMIT_LOCKS : __rlimit_resource = 10 ; pub const __rlimit_resource___RLIMIT_SIGPENDING : __rlimit_resource = 11 ; pub const __rlimit_resource___RLIMIT_MSGQUEUE : __rlimit_resource = 12 ; pub const __rlimit_resource___RLIMIT_NICE : __rlimit_resource = 13 ; pub const __rlimit_resource___RLIMIT_RTPRIO : __rlimit_resource = 14 ; pub const __rlimit_resource___RLIMIT_RTTIME : __rlimit_resource = 15 ; pub const __rlimit_resource___RLIMIT_NLIMITS : __rlimit_resource = 16 ; pub const __rlimit_resource___RLIM_NLIMITS : __rlimit_resource = 16 ; pub type __rlimit_resource = u32 ; pub type rlim_t = __rlim_t ; # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct rlimit { pub rlim_cur : rlim_t , pub rlim_max : rlim_t , } # [ test ] fn bindgen_test_layout_rlimit ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rlimit > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( rlimit ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rlimit > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rlimit ) ) ) ; } pub const __rusage_who_RUSAGE_SELF : __rusage_who = 0 ; pub const __rusage_who_RUSAGE_CHILDREN : __rusage_who = -1 ; pub type __rusage_who = i32 ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct rusage { pub ru_utime : timeval , pub ru_stime : timeval , pub __bindgen_anon_1 : rusage__bindgen_ty_1 , pub __bindgen_anon_2 : rusage__bindgen_ty_2 , pub __bindgen_anon_3 : rusage__bindgen_ty_3 , pub __bindgen_anon_4 : rusage__bindgen_ty_4 , pub __bindgen_anon_5 : rusage__bindgen_ty_5 , pub __bindgen_anon_6 : rusage__bindgen_ty_6 , pub __bindgen_anon_7 : rusage__bindgen_ty_7 , pub __bindgen_anon_8 : rusage__bindgen_ty_8 , pub __bindgen_anon_9 : rusage__bindgen_ty_9 , pub __bindgen_anon_10 : rusage__bindgen_ty_10 , pub __bindgen_anon_11 : rusage__bindgen_ty_11 , pub __bindgen_anon_12 : rusage__bindgen_ty_12 , pub __bindgen_anon_13 : rusage__bindgen_ty_13 , pub __bindgen_anon_14 : rusage__bindgen_ty_14 , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_1 { pub ru_maxrss : :: std :: os :: raw :: c_long , pub __ru_maxrss_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_1 ) ) ) ; } impl Default for rusage__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_2 { pub ru_ixrss : :: std :: os :: raw :: c_long , pub __ru_ixrss_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_2 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_2 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_2 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_2 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_2 ) ) ) ; } impl Default for rusage__bindgen_ty_2 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_3 { pub ru_idrss : :: std :: os :: raw :: c_long , pub __ru_idrss_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_3 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_3 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_3 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_3 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_3 ) ) ) ; } impl Default for rusage__bindgen_ty_3 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_4 { pub ru_isrss : :: std :: os :: raw :: c_long , pub __ru_isrss_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_4 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_4 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_4 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_4 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_4 ) ) ) ; } impl Default for rusage__bindgen_ty_4 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_5 { pub ru_minflt : :: std :: os :: raw :: c_long , pub __ru_minflt_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_5 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_5 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_5 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_5 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_5 ) ) ) ; } impl Default for rusage__bindgen_ty_5 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_6 { pub ru_majflt : :: std :: os :: raw :: c_long , pub __ru_majflt_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_6 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_6 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_6 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_6 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_6 ) ) ) ; } impl Default for rusage__bindgen_ty_6 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_7 { pub ru_nswap : :: std :: os :: raw :: c_long , pub __ru_nswap_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_7 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_7 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_7 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_7 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_7 ) ) ) ; } impl Default for rusage__bindgen_ty_7 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_8 { pub ru_inblock : :: std :: os :: raw :: c_long , pub __ru_inblock_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_8 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_8 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_8 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_8 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_8 ) ) ) ; } impl Default for rusage__bindgen_ty_8 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_9 { pub ru_oublock : :: std :: os :: raw :: c_long , pub __ru_oublock_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_9 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_9 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_9 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_9 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_9 ) ) ) ; } impl Default for rusage__bindgen_ty_9 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_10 { pub ru_msgsnd : :: std :: os :: raw :: c_long , pub __ru_msgsnd_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_10 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_10 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_10 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_10 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_10 ) ) ) ; } impl Default for rusage__bindgen_ty_10 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_11 { pub ru_msgrcv : :: std :: os :: raw :: c_long , pub __ru_msgrcv_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_11 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_11 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_11 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_11 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_11 ) ) ) ; } impl Default for rusage__bindgen_ty_11 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_12 { pub ru_nsignals : :: std :: os :: raw :: c_long , pub __ru_nsignals_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_12 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_12 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_12 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_12 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_12 ) ) ) ; } impl Default for rusage__bindgen_ty_12 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_13 { pub ru_nvcsw : :: std :: os :: raw :: c_long , pub __ru_nvcsw_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_13 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_13 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_13 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_13 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_13 ) ) ) ; } impl Default for rusage__bindgen_ty_13 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union rusage__bindgen_ty_14 { pub ru_nivcsw : :: std :: os :: raw :: c_long , pub __ru_nivcsw_word : __syscall_slong_t , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_rusage__bindgen_ty_14 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage__bindgen_ty_14 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( rusage__bindgen_ty_14 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage__bindgen_ty_14 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage__bindgen_ty_14 ) ) ) ; } impl Default for rusage__bindgen_ty_14 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_rusage ( ) { assert_eq ! ( :: std :: mem :: size_of :: < rusage > ( ) , 144usize , concat ! ( "Size of: " , stringify ! ( rusage ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < rusage > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( rusage ) ) ) ; } impl Default for rusage { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub const __priority_which_PRIO_PROCESS : __priority_which = 0 ; pub const __priority_which_PRIO_PGRP : __priority_which = 1 ; pub const __priority_which_PRIO_USER : __priority_which = 2 ; pub type __priority_which = u32 ; pub type __rlimit_resource_t = :: std :: os :: raw :: c_int ; pub type __rusage_who_t = :: std :: os :: raw :: c_int ; pub type __priority_which_t = :: std :: os :: raw :: c_int ; extern "C" { # [ link_name = "\u{1}_Z9getrlimit" ] pub fn getrlimit ( __resource : __rlimit_resource_t , __rlimits : * mut rlimit ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9setrlimit" ] pub fn setrlimit ( __resource : __rlimit_resource_t , __rlimits : * const rlimit ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9getrusage" ] pub fn getrusage ( __who : __rusage_who_t , __usage : * mut rusage ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11getpriority" ] pub fn getpriority ( __which : __priority_which_t , __who : id_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z11setpriority" ] pub fn setpriority ( __which : __priority_which_t , __who : id_t , __prio : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z4stat" ] pub fn stat ( __file : * const :: std :: os :: raw :: c_char , __buf : * mut stat ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5fstat" ] pub fn fstat ( __fd : :: std :: os :: raw :: c_int , __buf : * mut stat ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7fstatat" ] pub fn fstatat ( __fd : :: std :: os :: raw :: c_int , __file : * const :: std :: os :: raw :: c_char , __buf : * mut stat , __flag : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5lstat" ] pub fn lstat ( __file : * const :: std :: os :: raw :: c_char , __buf : * mut stat ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5chmod" ] pub fn chmod ( __file : * const :: std :: os :: raw :: c_char , __mode : __mode_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6lchmod" ] pub fn lchmod ( __file : * const :: std :: os :: raw :: c_char , __mode : __mode_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6fchmod" ] pub fn fchmod ( __fd : :: std :: os :: raw :: c_int , __mode : __mode_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8fchmodat" ] pub fn fchmodat ( __fd : :: std :: os :: raw :: c_int , __file : * const :: std :: os :: raw :: c_char , __mode : __mode_t , __flag : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5umask" ] pub fn umask ( __mask : __mode_t ) -> __mode_t ; } extern "C" { # [ link_name = "\u{1}_Z5mkdir" ] pub fn mkdir ( __path : * const :: std :: os :: raw :: c_char , __mode : __mode_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7mkdirat" ] pub fn mkdirat ( __fd : :: std :: os :: raw :: c_int , __path : * const :: std :: os :: raw :: c_char , __mode : __mode_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5mknod" ] pub fn mknod ( __path : * const :: std :: os :: raw :: c_char , __mode : __mode_t , __dev : __dev_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7mknodat" ] pub fn mknodat ( __fd : :: std :: os :: raw :: c_int , __path : * const :: std :: os :: raw :: c_char , __mode : __mode_t , __dev : __dev_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z6mkfifo" ] pub fn mkfifo ( __path : * const :: std :: os :: raw :: c_char , __mode : __mode_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8mkfifoat" ] pub fn mkfifoat ( __fd : :: std :: os :: raw :: c_int , __path : * const :: std :: os :: raw :: c_char , __mode : __mode_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z9utimensat" ] pub fn utimensat ( __fd : :: std :: os :: raw :: c_int , __path : * const :: std :: os :: raw :: c_char , __times : * const timespec , __flags : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8futimens" ] pub fn futimens ( __fd : :: std :: os :: raw :: c_int , __times : * const timespec ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8__fxstat" ] pub fn __fxstat ( __ver : :: std :: os :: raw :: c_int , __fildes : :: std :: os :: raw :: c_int , __stat_buf : * mut stat ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z7__xstat" ] pub fn __xstat ( __ver : :: std :: os :: raw :: c_int , __filename : * const :: std :: os :: raw :: c_char , __stat_buf : * mut stat ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8__lxstat" ] pub fn __lxstat ( __ver : :: std :: os :: raw :: c_int , __filename : * const :: std :: os :: raw :: c_char , __stat_buf : * mut stat ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10__fxstatat" ] pub fn __fxstatat ( __ver : :: std :: os :: raw :: c_int , __fildes : :: std :: os :: raw :: c_int , __filename : * const :: std :: os :: raw :: c_char , __stat_buf : * mut stat , __flag : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z8__xmknod" ] pub fn __xmknod ( __ver : :: std :: os :: raw :: c_int , __path : * const :: std :: os :: raw :: c_char , __mode : __mode_t , __dev : * mut __dev_t ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z10__xmknodat" ] pub fn __xmknodat ( __ver : :: std :: os :: raw :: c_int , __fd : :: std :: os :: raw :: c_int , __path : * const :: std :: os :: raw :: c_char , __mode : __mode_t , __dev : * mut __dev_t ) -> :: std :: os :: raw :: c_int ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct sockaddr_un { pub sun_family : sa_family_t , pub sun_path : [ :: std :: os :: raw :: c_char ; 108usize ] , } # [ test ] fn bindgen_test_layout_sockaddr_un ( ) { assert_eq ! ( :: std :: mem :: size_of :: < sockaddr_un > ( ) , 110usize , concat ! ( "Size of: " , stringify ! ( sockaddr_un ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < sockaddr_un > ( ) , 2usize , concat ! ( "Alignment of " , stringify ! ( sockaddr_un ) ) ) ; } impl Default for sockaddr_un { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct user_fpregs_struct { pub cwd : :: std :: os :: raw :: c_ushort , pub swd : :: std :: os :: raw :: c_ushort , pub ftw : :: std :: os :: raw :: c_ushort , pub fop : :: std :: os :: raw :: c_ushort , pub rip : :: std :: os :: raw :: c_ulonglong , pub rdp : :: std :: os :: raw :: c_ulonglong , pub mxcsr : :: std :: os :: raw :: c_uint , pub mxcr_mask : :: std :: os :: raw :: c_uint , pub st_space : [ :: std :: os :: raw :: c_uint ; 32usize ] , pub xmm_space : [ :: std :: os :: raw :: c_uint ; 64usize ] , pub padding : [ :: std :: os :: raw :: c_uint ; 24usize ] , } # [ test ] fn bindgen_test_layout_user_fpregs_struct ( ) { assert_eq ! ( :: std :: mem :: size_of :: < user_fpregs_struct > ( ) , 512usize , concat ! ( "Size of: " , stringify ! ( user_fpregs_struct ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < user_fpregs_struct > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( user_fpregs_struct ) ) ) ; } impl Default for user_fpregs_struct { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Debug , Default , Copy , Clone ) ] pub struct user_regs_struct { pub r15 : :: std :: os :: raw :: c_ulonglong , pub r14 : :: std :: os :: raw :: c_ulonglong , pub r13 : :: std :: os :: raw :: c_ulonglong , pub r12 : :: std :: os :: raw :: c_ulonglong , pub rbp : :: std :: os :: raw :: c_ulonglong , pub rbx : :: std :: os :: raw :: c_ulonglong , pub r11 : :: std :: os :: raw :: c_ulonglong , pub r10 : :: std :: os :: raw :: c_ulonglong , pub r9 : :: std :: os :: raw :: c_ulonglong , pub r8 : :: std :: os :: raw :: c_ulonglong , pub rax : :: std :: os :: raw :: c_ulonglong , pub rcx : :: std :: os :: raw :: c_ulonglong , pub rdx : :: std :: os :: raw :: c_ulonglong , pub rsi : :: std :: os :: raw :: c_ulonglong , pub rdi : :: std :: os :: raw :: c_ulonglong , pub orig_rax : :: std :: os :: raw :: c_ulonglong , pub rip : :: std :: os :: raw :: c_ulonglong , pub cs : :: std :: os :: raw :: c_ulonglong , pub eflags : :: std :: os :: raw :: c_ulonglong , pub rsp : :: std :: os :: raw :: c_ulonglong , pub ss : :: std :: os :: raw :: c_ulonglong , pub fs_base : :: std :: os :: raw :: c_ulonglong , pub gs_base : :: std :: os :: raw :: c_ulonglong , pub ds : :: std :: os :: raw :: c_ulonglong , pub es : :: std :: os :: raw :: c_ulonglong , pub fs : :: std :: os :: raw :: c_ulonglong , pub gs : :: std :: os :: raw :: c_ulonglong , } # [ test ] fn bindgen_test_layout_user_regs_struct ( ) { assert_eq ! ( :: std :: mem :: size_of :: < user_regs_struct > ( ) , 216usize , concat ! ( "Size of: " , stringify ! ( user_regs_struct ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < user_regs_struct > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( user_regs_struct ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct user { pub regs : user_regs_struct , pub u_fpvalid : :: std :: os :: raw :: c_int , pub i387 : user_fpregs_struct , pub u_tsize : :: std :: os :: raw :: c_ulonglong , pub u_dsize : :: std :: os :: raw :: c_ulonglong , pub u_ssize : :: std :: os :: raw :: c_ulonglong , pub start_code : :: std :: os :: raw :: c_ulonglong , pub start_stack : :: std :: os :: raw :: c_ulonglong , pub signal : :: std :: os :: raw :: c_longlong , pub reserved : :: std :: os :: raw :: c_int , pub __bindgen_anon_1 : user__bindgen_ty_1 , pub __bindgen_anon_2 : user__bindgen_ty_2 , pub magic : :: std :: os :: raw :: c_ulonglong , pub u_comm : [ :: std :: os :: raw :: c_char ; 32usize ] , pub u_debugreg : [ :: std :: os :: raw :: c_ulonglong ; 8usize ] , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union user__bindgen_ty_1 { pub u_ar0 : * mut user_regs_struct , pub __u_ar0_word : :: std :: os :: raw :: c_ulonglong , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_user__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < user__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( user__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < user__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( user__bindgen_ty_1 ) ) ) ; } impl Default for user__bindgen_ty_1 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union user__bindgen_ty_2 { pub u_fpstate : * mut user_fpregs_struct , pub __u_fpstate_word : :: std :: os :: raw :: c_ulonglong , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_user__bindgen_ty_2 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < user__bindgen_ty_2 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( user__bindgen_ty_2 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < user__bindgen_ty_2 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( user__bindgen_ty_2 ) ) ) ; } impl Default for user__bindgen_ty_2 { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } # [ test ] fn bindgen_test_layout_user ( ) { assert_eq ! ( :: std :: mem :: size_of :: < user > ( ) , 912usize , concat ! ( "Size of: " , stringify ! ( user ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < user > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( user ) ) ) ; } impl Default for user { fn default ( ) -> Self { unsafe { :: std :: mem :: zeroed ( ) } } } pub const idtype_t_P_ALL : idtype_t = 0 ; pub const idtype_t_P_PID : idtype_t = 1 ; pub const idtype_t_P_PGID : idtype_t = 2 ; pub type idtype_t = u32 ; extern "C" { # [ link_name = "\u{1}_Z4wait" ] pub fn wait ( __stat_loc : __WAIT_STATUS ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z7waitpid" ] pub fn waitpid ( __pid : __pid_t , __stat_loc : * mut :: std :: os :: raw :: c_int , __options : :: std :: os :: raw :: c_int ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z6waitid" ] pub fn waitid ( __idtype : idtype_t , __id : __id_t , __infop : * mut siginfo_t , __options : :: std :: os :: raw :: c_int ) -> :: std :: os :: raw :: c_int ; } extern "C" { # [ link_name = "\u{1}_Z5wait3" ] pub fn wait3 ( __stat_loc : __WAIT_STATUS , __options : :: std :: os :: raw :: c_int , __usage : * mut rusage ) -> __pid_t ; } extern "C" { # [ link_name = "\u{1}_Z5wait4" ] pub fn wait4 ( __pid : __pid_t , __stat_loc : __WAIT_STATUS , __options : :: std :: os :: raw :: c_int , __usage : * mut rusage ) -> __pid_t ; } pub const spdk_scsi_group_code_SPDK_SCSI_6BYTE_CMD : spdk_scsi_group_code = 0 ; pub const spdk_scsi_group_code_SPDK_SCSI_10BYTE_CMD : spdk_scsi_group_code = 32 ; pub const spdk_scsi_group_code_SPDK_SCSI_10BYTE_CMD2 : spdk_scsi_group_code = 64 ; pub const spdk_scsi_group_code_SPDK_SCSI_16BYTE_CMD : spdk_scsi_group_code = 128 ; pub const spdk_scsi_group_code_SPDK_SCSI_12BYTE_CMD : spdk_scsi_group_code = 160 ; pub type spdk_scsi_group_code = u32 ; pub const spdk_scsi_status_SPDK_SCSI_STATUS_GOOD : spdk_scsi_status = 0 ; pub const spdk_scsi_status_SPDK_SCSI_STATUS_CHECK_CONDITION : spdk_scsi_status = 2 ; pub const spdk_scsi_status_SPDK_SCSI_STATUS_CONDITION_MET : spdk_scsi_status = 4 ; pub const spdk_scsi_status_SPDK_SCSI_STATUS_BUSY : spdk_scsi_status = 8 ; pub const spdk_scsi_status_SPDK_SCSI_STATUS_INTERMEDIATE : spdk_scsi_status = 16 ; pub const spdk_scsi_status_SPDK_SCSI_STATUS_INTERMEDIATE_CONDITION_MET : spdk_scsi_status = 20 ; pub const spdk_scsi_status_SPDK_SCSI_STATUS_RESERVATION_CONFLICT : spdk_scsi_status = 24 ; pub const spdk_scsi_status_SPDK_SCSI_STATUS_Obsolete : spdk_scsi_status = 34 ; pub const spdk_scsi_status_SPDK_SCSI_STATUS_TASK_SET_FULL : spdk_scsi_status = 40 ; pub const spdk_scsi_status_SPDK_SCSI_STATUS_ACA_ACTIVE : spdk_scsi_status = 48 ; pub const spdk_scsi_status_SPDK_SCSI_STATUS_TASK_ABORTED : spdk_scsi_status = 64 ; pub type spdk_scsi_status = u32 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_NO_SENSE : spdk_scsi_sense = 0 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_RECOVERED_ERROR : spdk_scsi_sense = 1 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_NOT_READY : spdk_scsi_sense = 2 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_MEDIUM_ERROR : spdk_scsi_sense = 3 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_HARDWARE_ERROR : spdk_scsi_sense = 4 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_ILLEGAL_REQUEST : spdk_scsi_sense = 5 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_UNIT_ATTENTION : spdk_scsi_sense = 6 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_DATA_PROTECT : spdk_scsi_sense = 7 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_BLANK_CHECK : spdk_scsi_sense = 8 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_VENDOR_SPECIFIC : spdk_scsi_sense = 9 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_COPY_ABORTED : spdk_scsi_sense = 10 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_ABORTED_COMMAND : spdk_scsi_sense = 11 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_VOLUME_OVERFLOW : spdk_scsi_sense = 13 ; pub const spdk_scsi_sense_SPDK_SCSI_SENSE_MISCOMPARE : spdk_scsi_sense = 14 ; pub type spdk_scsi_sense = u32 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_NO_ADDITIONAL_SENSE : spdk_scsi_asc = 0 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_PERIPHERAL_DEVICE_WRITE_FAULT : spdk_scsi_asc = 3 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_LOGICAL_UNIT_NOT_READY : spdk_scsi_asc = 4 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_WARNING : spdk_scsi_asc = 11 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_LOGICAL_BLOCK_GUARD_CHECK_FAILED : spdk_scsi_asc = 16 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_LOGICAL_BLOCK_APP_TAG_CHECK_FAILED : spdk_scsi_asc = 16 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_LOGICAL_BLOCK_REF_TAG_CHECK_FAILED : spdk_scsi_asc = 16 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_UNRECOVERED_READ_ERROR : spdk_scsi_asc = 17 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_MISCOMPARE_DURING_VERIFY_OPERATION : spdk_scsi_asc = 29 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_INVALID_COMMAND_OPERATION_CODE : spdk_scsi_asc = 32 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_ACCESS_DENIED : spdk_scsi_asc = 32 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_LOGICAL_BLOCK_ADDRESS_OUT_OF_RANGE : spdk_scsi_asc = 33 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_INVALID_FIELD_IN_CDB : spdk_scsi_asc = 36 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_LOGICAL_UNIT_NOT_SUPPORTED : spdk_scsi_asc = 37 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_WRITE_PROTECTED : spdk_scsi_asc = 39 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_FORMAT_COMMAND_FAILED : spdk_scsi_asc = 49 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_SAVING_PARAMETERS_NOT_SUPPORTED : spdk_scsi_asc = 57 ; pub const spdk_scsi_asc_SPDK_SCSI_ASC_INTERNAL_TARGET_FAILURE : spdk_scsi_asc = 68 ; pub type spdk_scsi_asc = u32 ; pub const spdk_scsi_ascq_SPDK_SCSI_ASCQ_CAUSE_NOT_REPORTABLE : spdk_scsi_ascq = 0 ; pub const spdk_scsi_ascq_SPDK_SCSI_ASCQ_BECOMING_READY : spdk_scsi_ascq = 1 ; pub const spdk_scsi_ascq_SPDK_SCSI_ASCQ_FORMAT_COMMAND_FAILED : spdk_scsi_ascq = 1 ; pub const spdk_scsi_ascq_SPDK_SCSI_ASCQ_LOGICAL_BLOCK_GUARD_CHECK_FAILED : spdk_scsi_ascq = 1 ; pub const spdk_scsi_ascq_SPDK_SCSI_ASCQ_LOGICAL_BLOCK_APP_TAG_CHECK_FAILED : spdk_scsi_ascq = 2 ; pub const spdk_scsi_ascq_SPDK_SCSI_ASCQ_NO_ACCESS_RIGHTS : spdk_scsi_ascq = 2 ; pub const spdk_scsi_ascq_SPDK_SCSI_ASCQ_LOGICAL_BLOCK_REF_TAG_CHECK_FAILED : spdk